import { useState, useMemo, useCallback, useRef, useEffect } from "react";

// ============================================================
// 林夕粵語填詞作品 Credit 查詢 v3
// ============================================================

const DATA=[{"y":1985,"t":"曾經","s":"鍾鎮濤","c":"蔡國權"},{"y":1986,"t":"吸煙的女人","s":"Raidas","c":"黃耀光"},{"y":1986,"t":"不願置評","s":"Raidas","c":"黃耀光"},{"y":1986,"t":"杯中冷巷","s":"Raidas","c":"黃耀光"},{"y":1986,"t":"午夜場","s":"川鳴","c":"潘健康"},{"y":1986,"t":"歲月","s":"川鳴","c":"潘健康"},{"y":1986,"t":"孩子（給被遺棄的一群）","s":"川鳴","c":"潘健康"},{"y":1987,"t":"傳說","s":"Raidas","c":"黃耀光"},{"y":1987,"t":"別人的歌","s":"Raidas","c":"黃耀光"},{"y":1987,"t":"某月某日","s":"Raidas","c":"黃耀光"},{"y":1987,"t":"穿黑衣的少年","s":"Raidas","c":"黃耀光"},{"y":1987,"t":"再見朋友","s":"Raidas","c":"黃耀光"},{"y":1987,"t":"低調感覺","s":"Raidas","c":"黃耀光"},{"y":1987,"t":"危險遊戲","s":"Raidas","c":"黃耀光"},{"y":1987,"t":"人海中我是誰","s":"Raidas","c":"黃耀光"},{"y":1987,"t":"突發事件","s":"Raidas","c":"黃耀光"},{"y":1987,"t":"第三者","s":"Raidas","c":"黃耀光"},{"y":1987,"t":"飲馬江湖","s":"Raidas","c":"黃耀光"},{"y":1987,"t":"沒有路人的都市","s":"Raidas","c":"黃耀光"},{"y":1987,"t":"熱鬧過後","s":"Raidas","c":"黃耀光"},{"y":1987,"t":"壓軸","s":"Raidas","c":"黃耀光"},{"y":1987,"t":"苦戀","s":"Raidas","c":"黃耀光"},{"y":1987,"t":"季候風","s":"凡風","c":"區新明"},{"y":1987,"t":"兩個屋企","s":"凡風","c":"區新明"},{"y":1987,"t":"純屬廢話","s":"何嘉麗","c":"Dieter Bohlen","r":"外"},{"y":1987,"t":"午後的溫柔","s":"何嘉麗","c":"郭小霖"},{"y":1987,"t":"三更半夜","s":"何嘉麗","c":"Hubert Kenner","r":"外"},{"y":1987,"t":"不規則","s":"郭小霖","c":"郭小霖"},{"y":1987,"t":"他是誰","s":"郭小霖","c":"銀色夏生/大沢譽志幸","r":"日"},{"y":1987,"t":"唔？......\"I Love You\"","s":"郭小霖","c":"郭小霖"},{"y":1987,"t":"說天說地","s":"郭小霖","c":"郭小霖"},{"y":1987,"t":"夏日故事","s":"呂珊","c":"Gazebo","r":"外"},{"y":1987,"t":"像我這樣的一個女子","s":"呂珊","c":"周成恭"},{"y":1987,"t":"是你","s":"李麗蕊","c":"李麗蕊"},{"y":1987,"t":"午夜戀歌","s":"杜德偉","c":"徐日勤"},{"y":1987,"t":"抱緊我","s":"杜德偉","c":"Johnny Logan","r":"外"},{"y":1987,"t":"不可思議","s":"周啟生","c":"黃耀光（Wong Yiu Kwong）"},{"y":1987,"t":"禿鷹使命","s":"洪金寶、劉美君等","c":"李宗盛"},{"y":1987,"t":"妄想","s":"張國榮","c":"唐奕聰"},{"y":1987,"t":"解悶方法","s":"張德蘭","c":"黃耀光"},{"y":1987,"t":"尋人啟事","s":"張德蘭","c":"盧冠廷"},{"y":1987,"t":"天地蒼茫","s":"張德蘭","c":"天主教會"},{"y":1987,"t":"真空十九小時","s":"張學友","c":"高橋研","r":"日"},{"y":1987,"t":"Maria","s":"張學友","c":"Drafi Deutscher","r":"外"},{"y":1987,"t":"恩愛故事","s":"戚美珍","c":"徐日勤"},{"y":1987,"t":"心跳","s":"傅振榮","c":"作曲研究所"},{"y":1987,"t":"或者我錯","s":"傅振榮","c":""},{"y":1987,"t":"我沾濕了的臉","s":"黃凱芹","c":"德永英明","r":"日"},{"y":1987,"t":"未曾","s":"馮曉文","c":"解承強"},{"y":1987,"t":"害怕寂寞","s":"黃寶欣","c":"Veikkosamuli","r":"外"},{"y":1987,"t":"暫停厭倦","s":"梅艷芳","c":"井上大輔","r":"日"},{"y":1987,"t":"既是朋友","s":"溫兆倫","c":"顧嘉煇"},{"y":1987,"t":"沒有寄出的信","s":"雷安娜","c":"Jennifer Kimball / C. Richardson","r":"外"},{"y":1987,"t":"狠心女子","s":"甄楚倩","c":"G.Moore","r":"外"},{"y":1987,"t":"失戀Cafe","s":"劉美君","c":"J.C. Suarez","r":"外"},{"y":1987,"t":"點解","s":"劉美君","c":"D. Lowe/N. Tennant/Allee Willis","r":"外"},{"y":1987,"t":"遺棄","s":"鄺美雲","c":"徐日勤"},{"y":1987,"t":"即興演出","s":"羅文","c":"黃耀光"},{"y":1988,"t":"人生如此","s":"Chyna","c":"A. Banks、P. Collins、M. Rutherford","r":"外"},{"y":1988,"t":"不相信","s":"Chyna","c":"Chyna/袁卓繁"},{"y":1988,"t":"沒法拒絕","s":"Chyna","c":"Chyna/袁卓繁"},{"y":1988,"t":"告別校園","s":"Fundamental","c":"飯田淳人","r":"日"},{"y":1988,"t":"標準情人","s":"Fundamental","c":"陳光榮"},{"y":1988,"t":"當我寂寞","s":"Maria Cordero","c":"Albert Hammond/Carole Bayer Sager","r":"外"},{"y":1988,"t":"太陽計劃","s":"Raidas、香港電台第二台全體D.J.","c":"黃耀光"},{"y":1988,"t":"夢中戰士","s":"友誼接觸","c":"林伊笙"},{"y":1988,"t":"拼圖","s":"友誼接觸","c":"林伊笙"},{"y":1988,"t":"大話西遊","s":"友誼接觸、Raidas等","c":"中国民谣（編 : 黃耀光）"},{"y":1988,"t":"愛的竟是我","s":"文佩玲","c":"黎小田"},{"y":1988,"t":"熱吻我吧","s":"民間傳奇","c":"陳國基"},{"y":1988,"t":"Baby Baby","s":"江欣燕","c":"Samuel Domingo/John Forte","r":"外"},{"y":1988,"t":"貪愛的人","s":"何嘉麗","c":"Luiz Bonfá","r":"外"},{"y":1988,"t":"不自我","s":"何嘉麗","c":"崔炎德"},{"y":1988,"t":"個個好奇","s":"吳潔梅","c":"Stock、Aitken、Waterman","r":"外"},{"y":1988,"t":"我寧願一個","s":"吳潔梅","c":"甘仕良"},{"y":1988,"t":"夜色無情","s":"吳潔梅","c":"鄭子固"},{"y":1988,"t":"曾經愛過","s":"呂方","c":"徐日勤"},{"y":1988,"t":"回頭","s":"呂珊","c":"中島美雪","r":"日"},{"y":1988,"t":"突然","s":"李明珠","c":"杜自持"},{"y":1988,"t":"唯一證人","s":"李珊珊","c":""},{"y":1988,"t":"閒人免問","s":"李美欣","c":"盧東尼"},{"y":1988,"t":"不","s":"李麗蕊","c":"李麗蕊"},{"y":1988,"t":"等待重逢","s":"李麗蕊","c":"G. Moore","r":"外"},{"y":1988,"t":"終於想到我","s":"李麗蕊","c":"杜自持"},{"y":1988,"t":"暗夜","s":"杜德偉","c":"Martin Fry/Mark White","r":"外"},{"y":1988,"t":"錯了","s":"杜德偉","c":"徐日勤"},{"y":1988,"t":"戲弄","s":"杜德偉","c":"Keith Richards Mick Jagger","r":"外"},{"y":1988,"t":"忘情號","s":"杜德偉","c":"徐日勤"},{"y":1988,"t":"是誰幼稚","s":"杜德偉","c":"S.Cutugno","r":"外"},{"y":1988,"t":"永遠作伴","s":"杜德偉","c":"Maurizio Bassi|James Mc Shane","r":"外"},{"y":1988,"t":"好戲","s":"杜德智","c":"姚志漢"},{"y":1988,"t":"創世啟示錄","s":"杜德智","c":"DOZIER / FISH / WATSON LORD","r":"外"},{"y":1988,"t":"過客","s":"杜麗莎","c":"J.PETERIK J.JAMISON","r":"外"},{"y":1988,"t":"被動者","s":"周慧敏","c":"都志見隆","r":"日"},{"y":1988,"t":"從前名字，新故事","s":"孟素伶","c":"馬兆駿"},{"y":1988,"t":"戀愛小說","s":"孟素伶","c":"黃耀光"},{"y":1988,"t":"揭幕","s":"孟素伶","c":"馬兆駿"},{"y":1988,"t":"童話","s":"柏安妮","c":"Jeanne Ma/Romano Musumara/R.zaneil","r":"外"},{"y":1988,"t":"埋藏的太陽","s":"風雲","c":"陳少偉"},{"y":1988,"t":"再見七月","s":"草蜢","c":"Suzuki Kisaburou","r":"日"},{"y":1988,"t":"Happy With You","s":"區瑞強","c":""},{"y":1988,"t":"放心","s":"張立基","c":"Kuchi Yoloyama","r":"日"},{"y":1988,"t":"笑話","s":"張立基","c":"J HARRIS III T LEWIS","r":"外"},{"y":1988,"t":"無需要太多","s":"張國榮","c":"馬兆駿、袁瓊瓊"},{"y":1988,"t":"不再是我","s":"張學友","c":"Donald Ashley","r":"外"},{"y":1988,"t":"軟禁","s":"梅愛芳","c":"花比傲"},{"y":1988,"t":"台板人生","s":"梅愛芳","c":"花比傲"},{"y":1988,"t":"五日四夜","s":"梅愛芳","c":"花比傲"},{"y":1988,"t":"瘋癲愛情","s":"許志安","c":"Peter De Wijn","r":"外"},{"y":1988,"t":"那可問旁人","s":"許志安","c":"黎小田"},{"y":1988,"t":"不要問","s":"許冠傑","c":"單立文"},{"y":1988,"t":"從今以後","s":"陳百強","c":"徐日勤"},{"y":1988,"t":"怨女","s":"陳百強","c":"徐日勤"},{"y":1988,"t":"無聲勝有聲","s":"陳百強","c":"徐日勤"},{"y":1988,"t":"自作自受","s":"麥潔文","c":"麥潔文"},{"y":1988,"t":"絕望","s":"麥潔文","c":"Ann Wilson/Nancy Wilson","r":"外"},{"y":1988,"t":"迷亂","s":"麥潔文","c":"Kapla Bonoff","r":"外"},{"y":1988,"t":"戀愛本色","s":"黃早慧","c":"荻野目洋子","r":"日"},{"y":1988,"t":"200年之戀","s":"黃敏華","c":"Greenberg","r":"外"},{"y":1988,"t":"過氣晚裝","s":"黃敏華","c":"Vimi / Kynsha","r":"外"},{"y":1988,"t":"日安憂鬱","s":"黃凱芹","c":"徐日勤"},{"y":1988,"t":"然後","s":"黃寶欣","c":"林敏怡"},{"y":1988,"t":"雨巷","s":"黃寶欣","c":"鮑比達"},{"y":1988,"t":"假使真的可以","s":"黃露儀","c":"陳煥昌"},{"y":1988,"t":"求妳騙我","s":"葉振棠","c":"甘仕良"},{"y":1988,"t":"人間有情","s":"葉麗儀","c":"顧嘉煇"},{"y":1988,"t":"恕不奉陪","s":"甄楚倩","c":"冬杜花代子, 都志見隆","r":"日"},{"y":1988,"t":"也許是愛","s":"劉美君","c":"劉諾生"},{"y":1988,"t":"討厭","s":"劉美君","c":"雷頌德"},{"y":1988,"t":"留言","s":"劉德華","c":"JUOKO REKOLA","r":"外"},{"y":1988,"t":"誰人","s":"劉德華","c":"王醒陶"},{"y":1988,"t":"情不自禁","s":"蔡立兒","c":"Gibson Deborah Ann","r":"外"},{"y":1988,"t":"日望夜望","s":"蔡立兒","c":"J. M. GALLIAND","r":"法"},{"y":1988,"t":"一走了之","s":"蔡國權","c":"唐奕聰"},{"y":1988,"t":"陌生人","s":"鄭敬基","c":"玉置浩二","r":"日"},{"y":1988,"t":"全球傳聲新一代","s":"盧業瑂","c":"改編自《友誼萬歲》(Auld Lang Syne)","r":"外"},{"y":1988,"t":"Brenda點唱機","s":"盧業瑂","c":"盧冠廷"},{"y":1989,"t":"從不痛哭","s":"孟素伶","c":"亀井登志夫","r":"日"},{"y":1989,"t":"埋藏的說話","s":"孟素伶","c":"巫啓賢"},{"y":1989,"t":"我又佔多少","s":"孟素伶","c":"馬兆駿"},{"y":1989,"t":"為誰消瘦","s":"孟素伶","c":"尾崎亜美","r":"日"},{"y":1989,"t":"無言的愛","s":"孟素伶","c":"巫啓賢"},{"y":1989,"t":"終於勝利","s":"林子祥","c":"B.Gibb/R.Gibb/M.Gibb","r":"外"},{"y":1989,"t":"一生知己","s":"林志美","c":"Giorgio Moroder,Brian Reeves","r":"外"},{"y":1989,"t":"永遠動聽","s":"林志美","c":"Laurent Voulzy,Alain Souchon","r":"外"},{"y":1989,"t":"說不出感想","s":"林志美","c":"G.Moroder/I.Cara","r":"外"},{"y":1989,"t":"浪漫假日","s":"林志美","c":"林志美"},{"y":1989,"t":"無謂清醒","s":"林姍姍","c":"Candy De Rouge, Gunther Mende, Jennifer Rush","r":"外"},{"y":1989,"t":"不准挑剔","s":"林姍姍","c":"Frank Wildhorn, Sue Shifrin","r":"外"},{"y":1989,"t":"看着我雙眼","s":"林姍姍","c":"Frank Wildhorn, Sue Shifrin","r":"外"},{"y":1989,"t":"慢鏡重播","s":"柏安妮","c":"Maue","r":"外"},{"y":1989,"t":"昨日少年","s":"鍾鎮濤","c":"Dan Hill","r":"外"},{"y":1989,"t":"等妳","s":"鍾鎮濤","c":"P Glaston/N M Walden/W Afanasieff","r":"外"},{"y":1989,"t":"我家我心","s":"鍾鎮濤","c":"鍾鎮濤"},{"y":1989,"t":"夢想辦公室","s":"魏綺清","c":"區新明"},{"y":1989,"t":"偷戀","s":"鄺美雲","c":"筒美京平","r":"日"},{"y":1989,"t":"塵緣（粵）","s":"羅文","c":"徐日勤"},{"y":1989,"t":"未知","s":"羅文","c":"Jule Styne","r":"外"},{"y":1989,"t":"甚麼","s":"羅文","c":"徐日勤"},{"y":1989,"t":"得不到","s":"羅嘉良","c":"M.Gallaedo/Leung Wai Man","r":"混"},{"y":1989,"t":"八十歲後","s":"譚詠麟","c":"森進一","r":"日"},{"y":1990,"t":"隨時隨地","s":"Echo","c":"倫永亮"},{"y":1990,"t":"你有你，我有我","s":"Echo","c":"黃良昇"},{"y":1990,"t":"沒有月亮的晚上","s":"Echo","c":"陳少偉"},{"y":1990,"t":"常情","s":"Fundamental","c":"胡玉儀"},{"y":1990,"t":"曾經擁有","s":"Maria Cordero","c":"鄭敬基"},{"y":1990,"t":"感激","s":"Maria Cordero","c":"A. McBroom","r":"外"},{"y":1990,"t":"我笑我哭","s":"王傑","c":"王傑"},{"y":1990,"t":"生和死","s":"王傑","c":"王傑"},{"y":1990,"t":"煩惱只因我","s":"王傑","c":"王傑"},{"y":1990,"t":"無奈那天","s":"王靖雯","c":"EPO","r":"日"},{"y":1990,"t":"心病","s":"吳國敬","c":"徐日勤"},{"y":1990,"t":"在那遙遠的地方","s":"吳國敬","c":"楊雲驃"},{"y":1990,"t":"天作之合","s":"李克勤","c":"Elton John/Taupin","r":"外"},{"y":1990,"t":"時光之旅","s":"李達成","c":"徐日勤"},{"y":1990,"t":"自作自受","s":"李閏雄","c":"徐日勤"},{"y":1990,"t":"聽錯望錯","s":"杜德偉","c":"Elvis Presley/Mae Boren Axton/Tommy Durden","r":"外"},{"y":1990,"t":"一場朋友","s":"阮兆祥","c":"陳佳明"},{"y":1990,"t":"親親孩子天","s":"林保怡","c":"袁家揚"},{"y":1990,"t":"時光配件","s":"周啟生","c":"周啟生"},{"y":1990,"t":"沒有他","s":"柏安妮","c":""},{"y":1990,"t":"讓我孤單過這一晚","s":"夏韶聲","c":"G.Yanagl","r":"日"},{"y":1990,"t":"Charlie Charlie","s":"徐佩兒","c":"Ira Gershwin / Harry Warren","r":"外"},{"y":1990,"t":"曾覺得","s":"張立基","c":"孫偉明"},{"y":1990,"t":"飛虎隊","s":"張立基","c":"徐日勤"},{"y":1990,"t":"變心","s":"張立基","c":"徐日勤"},{"y":1990,"t":"不必講理由","s":"張立基","c":"徐日勤"},{"y":1990,"t":"側面","s":"張國榮","c":"PAUL GRAY","r":"外"},{"y":1990,"t":"我眼中的她","s":"張國榮","c":"周華健"},{"y":1990,"t":"未來之歌","s":"張國榮","c":"Bon Jovi/R.Sambora","r":"外"},{"y":1990,"t":"你沒有錯","s":"張學友","c":"徐日勤"},{"y":1990,"t":"傲慢","s":"梅艷芳","c":"徐日勤"},{"y":1990,"t":"朝朝暮暮","s":"梅艷芳","c":"徐日勤"},{"y":1990,"t":"失落嘉年華","s":"梅艷芳","c":"鮑比達"},{"y":1990,"t":"第四十夜","s":"梅艷芳","c":"Jackson,Drewery,Connell","r":"外"},{"y":1990,"t":"夢中見","s":"郭小霖","c":"Suzuki Shouko","r":"日"},{"y":1990,"t":"無論如何","s":"郭小霖","c":"郭小霖"},{"y":1990,"t":"背着良心的說話","s":"陳百強","c":"徐日勤"},{"y":1990,"t":"假話實說","s":"麥偉豪","c":"Romeo"},{"y":1990,"t":"就在今天開始","s":"彭鏡光","c":"M. Ernst / R. Martin / Koch Verlag","r":"外"},{"y":1990,"t":"愛在思念蔓延時","s":"曾路得","c":"蔣志光"},{"y":1990,"t":"她的燦爛","s":"曾路得","c":"Eric Lowen","r":"外"},{"y":1990,"t":"客人","s":"黃翊","c":"孫偉明"},{"y":1990,"t":"皆因一經過六四","s":"黃霑","c":"傳統聖誕歌（改編）"},{"y":1990,"t":"聖誕堅持","s":"黃霑","c":"傳統聖誕歌（原曲 O Come All Ye Faithful）","r":"外"},{"y":1990,"t":"我的基本法","s":"黃霑","c":"傳統聖誕歌（原曲 Rudolph the Red-Nosed Reindeer）","r":"外"},{"y":1990,"t":"不再難過","s":"黃寶欣","c":"周啟生"},{"y":1990,"t":"兜亂兩仔爺","s":"賈思樂","c":"徐日勤"},{"y":1990,"t":"只愛一次","s":"葉蒨文","c":"徐嘉良"},{"y":1990,"t":"異國情緣","s":"雷安娜","c":"花比傲"},{"y":1990,"t":"Anything for you","s":"雷安娜","c":"Gloria M. Estefan","r":"外"},{"y":1990,"t":"別離在秋季","s":"雷安娜","c":"馬兆駿"},{"y":1990,"t":"天真","s":"雷安娜","c":"馮鏡輝"},{"y":1990,"t":"獨白","s":"甄妮","c":"黃良昇"},{"y":1990,"t":"怨偶故事","s":"甄妮","c":"杜自持"},{"y":1990,"t":"望我一眼","s":"甄妮","c":"鮑比達"},{"y":1990,"t":"一錯再錯","s":"甄妮","c":"G.Zandona/M.Natale/S.Melloni/R.Turatti/T.Hooker","r":"外"},{"y":1990,"t":"好夢","s":"甄楚倩","c":"徐日勤"},{"y":1990,"t":"Sayonara","s":"甄楚倩","c":"L. A. Reid/Babyface","r":"外"},{"y":1990,"t":"夜癡纏","s":"甄楚倩","c":"黃良昇"},{"y":1990,"t":"有人","s":"劉美君","c":"P. Gary","r":"外"},{"y":1990,"t":"失樂園","s":"蔡立兒","c":"James Horner","r":"外"},{"y":1990,"t":"就此解決","s":"蔡立兒","c":"陳進興"},{"y":1990,"t":"可會重逢","s":"蔡立兒","c":"李宗盛"},{"y":1990,"t":"一代人","s":"蔡楓華","c":"蔡楓華"},{"y":1990,"t":"近在眼前","s":"鄭少秋","c":"徐日勤"},{"y":1990,"t":"妙探出租","s":"鄭祖同","c":"徐日勤"},{"y":1990,"t":"沒有愛情的日子","s":"鄭敬基","c":"花比傲"},{"y":1990,"t":"火燙濃情","s":"鄭敬基","c":"花比傲"},{"y":1990,"t":"Bad Timing","s":"鄭瑞芬、林保怡","c":"佚名"},{"y":1990,"t":"只要你欣賞","s":"鍾鎮濤","c":"鍾鎮濤"},{"y":1990,"t":"讓我好好想昨天","s":"鍾鎮濤","c":"陳志遠"},{"y":1990,"t":"關於我的愛人","s":"鍾鎮濤","c":"Norman Saleet","r":"外"},{"y":1990,"t":"總是一對","s":"鍾鎮濤","c":"林敏怡"},{"y":1990,"t":"奇遇","s":"藍戰士","c":"單立文"},{"y":1990,"t":"無謂客氣","s":"藍戰士","c":"蘇德華"},{"y":1990,"t":"不回頭","s":"藍戰士","c":"黃良昇"},{"y":1990,"t":"難得一起","s":"鄺美雲","c":"張國祖"},{"y":1990,"t":"誰是知己","s":"陳百強","c":"林敏怡"},{"y":1990,"t":"那是我眼淚","s":"陳德彰","c":"慄林誠一郎","r":"日"},{"y":1990,"t":"午夜放送","s":"陳德彰","c":"陳迪文"},{"y":1990,"t":"孤單競賽","s":"陳德彰","c":"陳耀川"},{"y":1990,"t":"如果那天","s":"陳德彰","c":"姚大衛"},{"y":1990,"t":"此情可待","s":"陳德彰","c":"甘仕良"},{"y":1990,"t":"十萬個可能","s":"陳德彰","c":"姚志漢"},{"y":1990,"t":"所謂無所謂","s":"陳德彰","c":"周啟生"},{"y":1990,"t":"從前......","s":"陳德彰","c":"花比傲"},{"y":1990,"t":"知得太多","s":"陳德彰","c":"姚大衛"},{"y":1990,"t":"好事","s":"陳德彰","c":"劉諾生"},{"y":1990,"t":"為何是我","s":"陳德彰","c":"鄭子固"},{"y":1990,"t":"還是算了吧！","s":"麥偉豪","c":"蔡國權"},{"y":1990,"t":"可否等一會","s":"羅文","c":"黃麗星"},{"y":1990,"t":"天地有誰","s":"羅文","c":"Kwang Hoon Ha","r":"韓"},{"y":1990,"t":"浪漫之後","s":"譚詠麟","c":"梁弘志"},{"y":1990,"t":"距離","s":"邊界","c":"Melchior Sarreal","r":"外"},{"y":1990,"t":"又再見面","s":"關淑怡","c":"葉廣權"},{"y":1990,"t":"請不要認錯我","s":"關淑怡","c":"Yoshimasa Shiozaki","r":"日"},{"y":1990,"t":"最深刻一次","s":"關淑怡","c":"Ralph Siegel","r":"外"},{"y":1990,"t":"不想也罷","s":"寶佩如","c":"蘇德華"},{"y":1990,"t":"無緣者","s":"寶佩如","c":"鮑比達"},{"y":1990,"t":"討好","s":"寶佩如","c":"佐佐木研","r":"日"},{"y":1990,"t":"大女人本色","s":"寶佩如","c":"徐日勤"},{"y":1990,"t":"只差一句話","s":"林漢揚","c":""},{"y":1990,"t":"你令我性感","s":"林憶蓮","c":"N.M.Walden/L.Jackson/W.Afansteff","r":"外"},{"y":1990,"t":"作家的情人","s":"姚志漢","c":"姚志漢"},{"y":1990,"t":"沉睡的戀人","s":"姚志漢","c":"姚志漢"},{"y":1990,"t":"曾是漆黑的某天","s":"袁志偉","c":"袁志偉"},{"y":1990,"t":"無家天使","s":"戴蘊慧","c":"Michael Jay,Martika","r":"外"},{"y":1990,"t":"風花雪月","s":"鍾鎮濤","c":"王利名"},{"y":1990,"t":"開心氣候","s":"鍾鎮濤","c":"Domenico Modugno, Franco Migliacci","r":"外"},{"y":1990,"t":"無法再傷多半次","s":"鄺美雲","c":"杜自持"},{"y":1990,"t":"還看今朝","s":"羅文","c":"徐日勤"},{"y":1990,"t":"誰不知","s":"羅文、麥潔文","c":"徐日勤"},{"y":1991,"t":"佔領理想街","s":"City Beat","c":"John Laudon","r":"外"},{"y":1991,"t":"他最愛的歌","s":"Echo","c":"Lewis A. Martinee","r":"外"},{"y":1991,"t":"深呼吸","s":"Echo","c":"D. Simmons/K. Edmonds/L.A. Reid","r":"原曲 : Paula Abdul - Knocked Out"},{"y":1991,"t":"誰是真正寂寞人","s":"Echo","c":"杜自持"},{"y":1991,"t":"新人類","s":"Face To Face","c":"Phil Collins","r":"外"},{"y":1991,"t":"願為妳做奴隸","s":"三個寂寞的心","c":""},{"y":1991,"t":"戀愛樣子","s":"三個寂寞的心","c":""},{"y":1991,"t":"用信將心偷","s":"三個寂寞的心","c":""},{"y":1991,"t":"親蜜基本法","s":"三個寂寞的心","c":""},{"y":1991,"t":"點樣手拖手","s":"三個寂寞的心","c":""},{"y":1991,"t":"生日殺手","s":"三個寂寞的心","c":""},{"y":1991,"t":"你知道我在等你嗎？","s":"三個寂寞的心","c":""},{"y":1991,"t":"天涯何處無芳草","s":"三個寂寞的心","c":""},{"y":1991,"t":"自我催谷歌","s":"三個寂寞的心","c":""},{"y":1991,"t":"為何仍然未醉","s":"王傑","c":"王傑"},{"y":1991,"t":"哭牆","s":"王靖雯","c":"J. Gruska/Marilyn Martin/J. Astley","r":"外"},{"y":1991,"t":"一剎那","s":"王靖雯","c":"梁榮駿"},{"y":1991,"t":"不可多得","s":"王靖雯","c":"EPO","r":"日"},{"y":1991,"t":"然後某天","s":"王靖雯","c":"Chris White","r":"外"},{"y":1991,"t":"多得他","s":"王靖雯","c":"Babyface/L.A. Reid/Daryl Simmons","r":"外"},{"y":1991,"t":"只有你","s":"王靖雯","c":"EPO","r":"日"},{"y":1991,"t":"明年今夜","s":"王靖雯","c":"小さなＫＩＳＳ)]","r":"日"},{"y":1991,"t":"唱不完的歌","s":"王靖雯等","c":"黃家駒"},{"y":1991,"t":"曾相識","s":"吳國敬","c":"倫永亮"},{"y":1991,"t":"今生今世","s":"吳國敬","c":"吳國敬/孫偉明"},{"y":1991,"t":"一樣的愛人","s":"吳婉芳","c":"徐日勤"},{"y":1991,"t":"愛是何物","s":"吳婉芳","c":"郭小霖"},{"y":1991,"t":"醉生如夢","s":"吳婉芳","c":"杜自持"},{"y":1991,"t":"浪漫歲月","s":"吳婉芳","c":"Glasser/Kuimin/Metz/Munson","r":"外"},{"y":1991,"t":"情場戰場","s":"吳婉芳","c":"Ren Salas/Kipper Jones","r":"外"},{"y":1991,"t":"最後一次別離","s":"呂方","c":"小剛/李常煌"},{"y":1991,"t":"別再講他","s":"呂方","c":"Ryo Matsuda","r":"日"},{"y":1991,"t":"觸電情緣","s":"賈思樂、李麗蕊","c":"徐日勤"},{"y":1991,"t":"她也是人","s":"杜德偉","c":"MAYUMI","r":"日"},{"y":1991,"t":"再造繁榮","s":"伍詠薇","c":"蘇越"},{"y":1991,"t":"你是誰","s":"李麗蕊","c":"徐日勤"},{"y":1991,"t":"終於發生","s":"周美茵","c":"陳澤忠"},{"y":1991,"t":"在這遙遠的地方","s":"周慧敏","c":"唐奕聰"},{"y":1991,"t":"人間有緣","s":"周慧敏","c":"周慧敏"},{"y":1991,"t":"讓我知道","s":"周慧敏","c":"Philip Chan"},{"y":1991,"t":"留我一聲","s":"周慧敏","c":"顧嘉煇"},{"y":1991,"t":"沒有妳的日子","s":"袁志偉","c":"祝宗豪"},{"y":1991,"t":"Cappuccino戀曲","s":"區瑞強","c":""},{"y":1991,"t":"一世","s":"區瑞強","c":""},{"y":1991,"t":"無言的結局（現代版）","s":"區瑞強、黃寶欣","c":"劉明瑞"},{"y":1991,"t":"Dreaming","s":"張國榮","c":"L. Montgomery/G. Paschal","r":"外"},{"y":1991,"t":"黑色偶然","s":"梁漢文","c":"德永英明","r":"日"},{"y":1991,"t":"情敵角色","s":"梅艷芳","c":"徐日勤"},{"y":1991,"t":"Missing You","s":"許志安","c":"Chris De Burgh","r":"外"},{"y":1991,"t":"永遠懷念妳","s":"許志安","c":"張國榮"},{"y":1991,"t":"打工貴族","s":"許志安","c":"郭小霖"},{"y":1991,"t":"想你","s":"郭小霖","c":"郭小霖"},{"y":1991,"t":"空氣中等你","s":"陳百強","c":"孫崇偉"},{"y":1991,"t":"當晚夢見是你？","s":"陳百強","c":"杜自持"},{"y":1991,"t":"滾滾紅塵","s":"陳淑樺","c":"羅大佑"},{"y":1991,"t":"心中有你","s":"陳聲妮","c":"徐日勤"},{"y":1991,"t":"一分一秒","s":"陳慧麗","c":""},{"y":1991,"t":"新的故人","s":"陳雅雯","c":"趙增熹"},{"y":1991,"t":"正義朋友","s":"彭健新","c":"徐日勤"},{"y":1991,"t":"半段情","s":"彭家麗","c":"彭家麗"},{"y":1991,"t":"何必相愛","s":"曾航生","c":"Kazuhiko Iguchi","r":"日"},{"y":1991,"t":"忘了","s":"曾航生","c":"陳秀男"},{"y":1991,"t":"兩個情人","s":"湯美君","c":"鮑比達"},{"y":1991,"t":"情真情假","s":"湯美君","c":"姚大偉"},{"y":1991,"t":"可以嗎？","s":"黃翊","c":"EPO","r":"日"},{"y":1991,"t":"兒歌","s":"黃翊","c":"陳永良"},{"y":1991,"t":"專制情人","s":"黃翊","c":"Babyface/L.A. Reid","r":"外"},{"y":1991,"t":"錯愛也是愛","s":"黃翊","c":"蘇來"},{"y":1991,"t":"搞風搞雨","s":"黃翊","c":"梁榮駿"},{"y":1991,"t":"情深緣淺","s":"黃凱芹","c":"黃凱芹"},{"y":1990,"t":"四級洞房秘笈","s":"黃霑","c":""},{"y":1991,"t":"十三皇朝","s":"戚美珍","c":"徐日勤"},{"y":1991,"t":"失蹤伴侶","s":"甄楚倩","c":"鮑比達"},{"y":1991,"t":"末代畢業生","s":"劉祖兒","c":"劉以達"},{"y":1991,"t":"追尋","s":"劉祖兒","c":"劉以達"},{"y":1991,"t":"不需要愛情","s":"劉德華","c":"楊振龍"},{"y":1991,"t":"回復自我","s":"蔣志光","c":"蔣志光"},{"y":1991,"t":"現代戰士","s":"蔡濟文","c":"徐日勤"},{"y":1991,"t":"最美麗一刻","s":"鄭秀文","c":"Gloria M"},{"y":1991,"t":"無名份的浪漫","s":"黎明","c":"Hassan、Juwie","r":"外"},{"y":1991,"t":"龍泉奇俠","s":"李瑞雲","c":"黎小田"},{"y":1991,"t":"一千次談情","s":"戴蘊慧","c":"李雅桑"},{"y":1992,"t":"一夜危情","s":"曾航生","c":"徐日勤"},{"y":1992,"t":"午夜刺激","s":"Girl Friends","c":"譚國政"},{"y":1992,"t":"一個戀愛故事","s":"太極","c":"太極"},{"y":1992,"t":"她","s":"王傑","c":"陳大力/陳秀男"},{"y":1992,"t":"情敵","s":"王靖雯","c":"唐奕聰"},{"y":1992,"t":"從明日開始","s":"王靖雯","c":"Ben Watt","r":"外"},{"y":1992,"t":"冷戰","s":"王靖雯","c":"Tori Amos","r":"外"},{"y":1992,"t":"天生不是情造","s":"王靖雯","c":"聶周燕"},{"y":1992,"t":"忘掉你像忘掉我","s":"王靖雯","c":"張國榮"},{"y":1992,"t":"請不必再等","s":"王馨平","c":"蔡議樟"},{"y":1992,"t":"再生天地","s":"伍詠薇","c":"韋立屯"},{"y":1992,"t":"知你為我好","s":"伊能靜","c":"紀宏仁"},{"y":1992,"t":"偷戀","s":"伊能靜","c":"陳耀川"},{"y":1992,"t":"在晴朗的天空下","s":"成龍、黃耀明、周華健、李宗盛","c":"李宗盛"},{"y":1992,"t":"你的女人","s":"何超儀","c":"羅大佑"},{"y":1992,"t":"從來沒有問你愛誰","s":"何寶生","c":""},{"y":1992,"t":"悲劇","s":"李迪文","c":"Tony A"},{"y":1992,"t":"一生的歌","s":"李國祥","c":"陳錦輝"},{"y":1992,"t":"唯有今夜","s":"李樂詩","c":"李樂詩"},{"y":1992,"t":"准我自我","s":"杜德偉","c":"Waymon Chapman","r":"外"},{"y":1992,"t":"愛着你如愛着我","s":"杜德偉","c":"Toshinobu Kubota","r":"日"},{"y":1992,"t":"一人舞會","s":"杜德偉","c":"黃韻玲"},{"y":1992,"t":"這一雙手","s":"杜德偉","c":"袁懷湘"},{"y":1993,"t":"忘我忘你","s":"周華健、唐季禮","c":""},{"y":1992,"t":"你還記得從前嗎？","s":"周慧敏","c":"周慧敏"},{"y":1992,"t":"我的一生","s":"林子祥","c":"林子祥"},{"y":1992,"t":"舊居中的鋼琴","s":"林子祥","c":"林子祥"},{"y":1992,"t":"不如重新開始","s":"林憶蓮","c":"許願"},{"y":1992,"t":"天大地大","s":"林憶蓮","c":"L A Reid，Baby Face，D Simmons","r":"外"},{"y":1992,"t":"當我眼前只有你","s":"林憶蓮","c":"許願/胡偉立"},{"y":1992,"t":"愛了再說","s":"風火海","c":""},{"y":1992,"t":"我愛你好不好","s":"風火海","c":"Robbie Nevil/Tommy Faragher/Lotti Golden","r":"外"},{"y":1992,"t":"我是你好知音","s":"倫永亮","c":"馬怡靜"},{"y":1992,"t":"朋友","s":"草蜢","c":"蔡一智/蔡一傑"},{"y":1992,"t":"情難獨奏","s":"袁鳳瑛","c":"周世暉"},{"y":1992,"t":"不必騷擾","s":"袁鳳瑛","c":"花比傲"},{"y":1992,"t":"為未來回憶","s":"袁鳳瑛","c":"花比傲"},{"y":1992,"t":"後悔（原曲：《如果你知我苦衷》）","s":"周慧敏","c":"張國榮"},{"y":1992,"t":"你是我的意義","s":"袁鳳瑛","c":"羅大佑"},{"y":1992,"t":"糊塗感情永不老","s":"梁漢文","c":"許願"},{"y":1992,"t":"可否給我多一次","s":"梁漢文","c":"MASSER MICHAEL Weil Cynthia SNOW THOMAS R","r":"外"},{"y":1992,"t":"女人心","s":"梅艷芳","c":"羅大佑"},{"y":1992,"t":"莫問一生","s":"梅艷芳","c":"羅大佑"},{"y":1992,"t":"終於都失去妳","s":"莫少聰","c":"莫少聰"},{"y":1992,"t":"一樣","s":"郭富城","c":"雷頌德"},{"y":1992,"t":"Merry Christmas","s":"郭富城","c":"桑田佳佑","r":"日"},{"y":1992,"t":"心對心","s":"陸家俊","c":""},{"y":1992,"t":"龍吐珠","s":"陸家俊","c":"D.Child","r":"外"},{"y":1992,"t":"今夜夢中只有你","s":"陸家俊","c":"佚名"},{"y":1992,"t":"不傷不痛不像愛","s":"彭家麗","c":"李雅桑"},{"y":1992,"t":"分手前一小時四分廿四秒","s":"彭家麗","c":"筒美京平","r":"日"},{"y":1992,"t":"原來只喜歡孤單一個","s":"彭家麗","c":"游鴻明"},{"y":1992,"t":"如果得不到愛情","s":"彭羚","c":"江志仁"},{"y":1992,"t":"愛得自然","s":"黃凱芹","c":"EPO","r":"日"},{"y":1992,"t":"花非花","s":"黃耀明","c":"黃耀明/蔡德才"},{"y":1992,"t":"不夜情","s":"黃耀明","c":"羅大佑"},{"y":1992,"t":"邊走邊唱","s":"黃耀明","c":"黃耀明/蔡德才"},{"y":1992,"t":"四季歌","s":"黃耀明","c":"鄧雨賢"},{"y":1992,"t":"愛情國","s":"黃耀明","c":"羅大佑"},{"y":1992,"t":"忽爾今夏","s":"黃耀明","c":"花比傲"},{"y":1992,"t":"你對我說：快睡吧！","s":"楊采妮","c":"江志仁"},{"y":1992,"t":"新不了情（粵）","s":"萬芳","c":"鮑比達"},{"y":1992,"t":"愛火蔓延時","s":"鄒靜","c":"B Jackson","r":"外"},{"y":1992,"t":"從頭開始","s":"甄楚倩","c":"交川眠子/八田雅弘","r":"日"},{"y":1992,"t":"情人不難做","s":"劉玉翠","c":"Les Maracas","r":"外"},{"y":1992,"t":"在你眼中","s":"劉玉翠","c":"趙增熹"},{"y":1992,"t":"你是我的夢","s":"劉德華","c":"杜自持/高世章"},{"y":1992,"t":"永遠寂寞","s":"劉德華","c":"Sada Mosashi","r":"日"},{"y":1992,"t":"我愛你","s":"劉德華","c":"杜自持"},{"y":1992,"t":"砂丘之女","s":"劉錫明","c":"林慕德"},{"y":1992,"t":"永遠浪漫","s":"蔡興麟","c":"石田正人","r":"日"},{"y":1992,"t":"暫時相戀","s":"蔡興麟","c":"後藤友","r":"日"},{"y":1992,"t":"情迷","s":"蔡齡齡","c":"Walter Scharf","r":"外"},{"y":1992,"t":"衝動點唱","s":"鄭秀文","c":"Tetsuto Oda/Uesugisho/Makoto Sekiguchi","r":"日"},{"y":1992,"t":"Lonely Line","s":"鄭梓浩","c":"不詳"},{"y":1992,"t":"就這樣吧","s":"鄭梓浩","c":"柳啟強"},{"y":1992,"t":"比煙花更燦爛","s":"鄭嘉穎","c":"德永英明/Shinohara Hitoshi","r":"日"},{"y":1992,"t":"一生最愛","s":"黎明","c":"張國榮"},{"y":1992,"t":"等到今夜","s":"黎瑞恩","c":"方樹樑"},{"y":1992,"t":"不知不覺想起你","s":"黎瑞恩","c":"盧東尼"},{"y":1993,"t":"逃出人間世外","s":"袁鳳瑛","c":"劉以達"},{"y":1993,"t":"戲迷情人","s":"袁鳳瑛","c":"小蟲"},{"y":1993,"t":"一個你一個我","s":"袁鳳瑛","c":"徐日勤"},{"y":1993,"t":"你的來信收到了","s":"袁鳳瑛","c":"羅大佑"},{"y":1993,"t":"這歌要為明日唱","s":"袁鳳瑛","c":"羅大佑"},{"y":1993,"t":"隨緣","s":"張偉文、鄧祖德等","c":""},{"y":1993,"t":"紅顏白髮","s":"張國榮","c":"張國榮"},{"y":1993,"t":"如此這般想你","s":"張智霖","c":"O.Quesada,B.Dasig","r":"外"},{"y":1993,"t":"終生情人","s":"張衛健","c":"川村榮二","r":"日"},{"y":1993,"t":"求神","s":"梁兆基、林帆","c":"胡偉立"},{"y":1993,"t":"In Your Eyes","s":"鍾鎮濤","c":"許華強"},{"y":1993,"t":"小心女人","s":"鄺美雲","c":"徐日勤"},{"y":1993,"t":"戲假情真","s":"羅文","c":"呂國良"},{"y":1993,"t":"壞情人","s":"羅文","c":"葉以柏（Keith Yip）/麥浩倫（Holun Mak）"},{"y":1993,"t":"人間","s":"羅文","c":"徐日勤"},{"y":1993,"t":"江湖路","s":"羅文","c":"徐日勤"},{"y":1993,"t":"愛多一次，痛多一次","s":"譚詠麟","c":"童安格"},{"y":1993,"t":"重新開始","s":"蘇永康","c":"黃尚偉"},{"y":1993,"t":"雞翼歌","s":"周星馳、朱鐵和、朱咪咪","c":"胡文森"},{"y":1994,"t":"胡思亂想","s":"王菲","c":"FRASER ELIZABETH DAVIDSON","r":"外"},{"y":1994,"t":"知己知彼","s":"王菲","c":"Raymonde/Simon Philip|Fraser/Elizabeth Davidson/Guthrie| Robin Andrew","r":"外"},{"y":1994,"t":"純情","s":"王菲","c":"江志仁"},{"y":1994,"t":"夢遊","s":"王菲","c":"江志仁"},{"y":1994,"t":"藍色時份","s":"王菲","c":"陳小霞"},{"y":1994,"t":"蜜月期","s":"王靖雯","c":"辛偉力"},{"y":1994,"t":"我怕","s":"王靖雯","c":"辛偉力"},{"y":1994,"t":"飄","s":"王靖雯","c":"張亞東"},{"y":1994,"t":"背影","s":"王靖雯","c":"Shoji Ishi","r":"日"},{"y":1994,"t":"痴心救地球","s":"王馨平","c":"郭峯/許常德"},{"y":1994,"t":"新歡","s":"王馨平","c":"劉諾生"},{"y":1994,"t":"不要躲避我的眼睛","s":"王馨平","c":"胡偉立"},{"y":1994,"t":"請你看着我的眼睛","s":"王馨平","c":"胡偉立"},{"y":1994,"t":"Ophelia","s":"甘子暉","c":"井上陽水","r":"日"},{"y":1994,"t":"換季情人","s":"甘子暉","c":"Schimscheimer Walterus Marcel, Katwijk Van John C","r":"外"},{"y":1994,"t":"相戀一個晚上","s":"甘子暉","c":"林東松"},{"y":1994,"t":"誰都知我想着誰","s":"古巨基","c":"薛學泉"},{"y":1994,"t":"感覺到","s":"白嘉倩","c":"黃偉年"},{"y":1994,"t":"醉拳","s":"成龍","c":"李偲菘/李偉菘"},{"y":1994,"t":"一言難盡","s":"何家勁","c":"馮鏡輝"},{"y":1994,"t":"新鴛鴦蝴蝶夢（粵）","s":"何家勁","c":"黃安"},{"y":1994,"t":"天下浪子不獨你一人","s":"吳倩蓮","c":"黃嘉倩"},{"y":1994,"t":"只有我在等我","s":"吳倩蓮","c":"黃嘉倩"},{"y":1994,"t":"天知地知","s":"吳倩蓮","c":"黃嘉倩"},{"y":1994,"t":"愛得乾脆","s":"吳倩蓮","c":"林志美"},{"y":1994,"t":"不能再寂寞","s":"吳倩蓮","c":"黃嘉倩"},{"y":1994,"t":"如果只可以做朋友","s":"吳倩蓮","c":"馮鏡輝"},{"y":1994,"t":"憶","s":"吳倩蓮","c":"黃嘉倩"},{"y":1994,"t":"回歸","s":"吳倩蓮","c":"黃嘉倩"},{"y":1994,"t":"相戀一秒鐘","s":"呂方","c":"Louis Mc Call,Linda Lou Mc Call","r":"外"},{"y":1994,"t":"新宿愛的故事","s":"呂方","c":"江志仁"},{"y":1994,"t":"夜迷藏","s":"李家明","c":"Chage","r":"日"},{"y":1994,"t":"妒忌","s":"李國祥","c":"黃尚偉"},{"y":1994,"t":"驚情四百年","s":"李婉華","c":"鄭敬基"},{"y":1994,"t":"想想","s":"杜德偉","c":"小蟲"},{"y":1994,"t":"阿花的故事","s":"袁鳳瑛","c":"鄧雨賢"},{"y":1994,"t":"寂寞是","s":"袁鳳瑛","c":"李泰祥"},{"y":1994,"t":"天知道","s":"袁鳳瑛","c":"陳揚"},{"y":1994,"t":"別要愛得太難過","s":"袁鳳瑛","c":"花比傲"},{"y":1994,"t":"草原小天使","s":"袁鳳瑛","c":"花比傲"},{"y":1994,"t":"愛的化身","s":"馬浚偉","c":"江志仁"},{"y":1994,"t":"不要悶人","s":"張立基","c":"張立基"},{"y":1994,"t":"追","s":"張國榮","c":"李迪文"},{"y":1994,"t":"原諒我過去","s":"張智霖","c":"許願"},{"y":1994,"t":"難得糊塗","s":"張智霖","c":"馮鏡輝"},{"y":1994,"t":"它","s":"張衛健","c":"區新明"},{"y":1994,"t":"在森林和原野","s":"梁家輝","c":"Traditional"},{"y":1994,"t":"其實我怕愛上你","s":"梁朝偉","c":"陳耀川"},{"y":1994,"t":"一切為你好","s":"梁朝偉","c":"紅螞蟻"},{"y":1994,"t":"過去四分零五秒","s":"梁朝偉","c":"紅螞蟻"},{"y":1994,"t":"愛情釀的酒","s":"梁朝偉","c":"紅螞蟻"},{"y":1994,"t":"纏綿遊戲","s":"梁漢文","c":"申升勳","r":"韓"},{"y":1994,"t":"感激","s":"梅艷芳","c":"倫永亮"},{"y":1994,"t":"悲情城市","s":"梅艷芳","c":"Amii Ozaki","r":"日"},{"y":1994,"t":"就算是情人","s":"郭富城","c":"胡偉立"},{"y":1994,"t":"鐵幕誘惑","s":"郭富城","c":"譚國政"},{"y":1994,"t":"失戀公路","s":"陳山蔥","c":"楠瀬誠志郎","r":"日"},{"y":1994,"t":"愛就愛我這一次","s":"陳松齡","c":"熊美玲"},{"y":1994,"t":"三心兩意","s":"彭家麗","c":"甘志偉"},{"y":1994,"t":"一個女人兩個男人","s":"彭羚","c":"Vassal Benford ,Ron","r":"外"},{"y":1994,"t":"今生不再","s":"彭羚","c":"李迪文"},{"y":1994,"t":"當初手牽手","s":"彭羚","c":"黃霑"},{"y":1994,"t":"開心小懶豬","s":"黃霑","c":"黃霑"},{"y":1994,"t":"從前有個小伙子","s":"黃耀明","c":"臺灣民謠"},{"y":1994,"t":"超時空傳說","s":"黃耀明","c":"羅大佑"},{"y":1994,"t":"教我如何愛一個我愛的人","s":"黃耀明","c":"花比傲"},{"y":1994,"t":"我們不是天使","s":"黃耀明","c":"黃耀明/蔡德才"},{"y":1994,"t":"夜生活","s":"黃耀明","c":"Alicia Keys","r":"外"},{"y":1994,"t":"想入非非","s":"黃耀明","c":"黃耀明/蔡德才"},{"y":1994,"t":"等愛的心","s":"葉蒨文","c":"殷文琦"},{"y":1994,"t":"別人的情歌","s":"葉蒨文","c":"Kenneth B. Edmonds/Simmons","r":"外"},{"y":1994,"t":"舊情復熾","s":"杜德偉、蘇慧倫","c":"李振權"},{"y":1994,"t":"給兒子的情歌","s":"周華健","c":"羅大佑"},{"y":1994,"t":"皇后大道東上虹彩妹妹愛的故事","s":"周華健","c":"周華健"},{"y":1994,"t":"只送你十一朵玫瑰","s":"周華健","c":"劉志宏"},{"y":1994,"t":"當天的心","s":"周華健","c":"周治平"},{"y":1994,"t":"海角天涯","s":"周華健","c":"宮尺和史"},{"y":1994,"t":"昨晚你已嫁給誰","s":"周華健","c":"周華健"},{"y":1994,"t":"刀劍若夢","s":"周華健","c":"周華健"},{"y":1994,"t":"難兄難弟","s":"周華健、杜德偉","c":"周華健"},{"y":1994,"t":"其實那個不是我","s":"周慧敏","c":"Liane Foly Philippe Viennet|Andre Manoukian","r":"外"},{"y":1994,"t":"感情不老","s":"林憶蓮","c":"陳錦輝"},{"y":1994,"t":"決心","s":"林憶蓮","c":"山田直毅","r":"日"},{"y":1994,"t":"願","s":"林憶蓮","c":"許願/黃偉年"},{"y":1994,"t":"我還是愛你到老","s":"洪楗華","c":"林隆旋"},{"y":1994,"t":"一夕愛","s":"風火海","c":"李迪文"},{"y":1994,"t":"他有自由","s":"風火海","c":"江志仁"},{"y":1994,"t":"沒有心情去失戀","s":"倫永亮","c":"江志仁"},{"y":1994,"t":"不可思議","s":"草蜢","c":"譚國政"},{"y":1994,"t":"隨時見你隨時愛你","s":"草蜢","c":"Giacobbe Sandro","r":"外"},{"y":1994,"t":"一等再等","s":"草蜢","c":"Antonina Armato","r":"外"},{"y":1994,"t":"怎麼天生不是女人","s":"草蜢","c":"蔡一傑"},{"y":1994,"t":"絕對？","s":"草蜢","c":"蔡一傑"},{"y":1994,"t":"真眼淚．假說話","s":"劉小慧","c":"吳旭文"},{"y":1994,"t":"花花世界","s":"劉德華","c":"杜自持"},{"y":1994,"t":"誰人知","s":"劉德華","c":"張映坤"},{"y":1994,"t":"9990次想她","s":"鄭伊健","c":"桑田佳佑","r":"日"},{"y":1994,"t":"Lady Rain","s":"鄭伊健","c":"Coler/Richardson/Sims/Szumowski","r":"外"},{"y":1994,"t":"十誡","s":"鄭秀文","c":"ISHIKAWA HIROSHI","r":"日"},{"y":1994,"t":"可愛可恨","s":"鄭秀文","c":"盧冠廷"},{"y":1994,"t":"但願愛一個人","s":"黎明詩","c":"Yuriko Koizumi/Keiko Ishida","r":"日"},{"y":1994,"t":"懲罰你","s":"黎姿","c":"中島美雪","r":"日"},{"y":1994,"t":"如果有一個他","s":"黎姿","c":"雷頌德"},{"y":1994,"t":"不相干","s":"黎姿","c":"蔡議樟"},{"y":1994,"t":"不愛天才","s":"黎瑞恩","c":"王雙駿"},{"y":1994,"t":"一見如故","s":"黎瑞恩","c":"林志美"},{"y":1994,"t":"我愛我","s":"羅文","c":"Stephens Geoffrey","r":"外"},{"y":1994,"t":"一生一次真情","s":"羅文","c":"倫永亮"},{"y":1994,"t":"笑問江湖","s":"羅文","c":"馮添枝"},{"y":1994,"t":"一首歌一個故事","s":"譚詠麟","c":"林慕德"},{"y":1994,"t":"天台上的星光","s":"蘇慧倫","c":"齊秦"},{"y":1994,"t":"失戀娃娃","s":"蘇慧倫","c":"陳家麗"},{"y":1994,"t":"多情種籽","s":"蘇慧倫","c":"蘇慧倫"},{"y":1994,"t":"死心塌地","s":"蘇慧倫","c":"李宗盛"},{"y":1995,"t":"沒法不想他","s":"Summer Grace","c":"梁建菲"},{"y":1995,"t":"這是愛的故事","s":"Summer Grace","c":"梁建菲"},{"y":1995,"t":"Di-Dar","s":"王菲","c":"王菲/江志仁"},{"y":1995,"t":"假期","s":"王菲","c":"王菲"},{"y":1995,"t":"迷路","s":"王菲","c":"江志仁"},{"y":1995,"t":"曖昧","s":"王菲","c":"陳小霞"},{"y":1995,"t":"或者","s":"王菲","c":"辛偉力"},{"y":1995,"t":"我想","s":"王菲","c":"張亞東（Ya Tong Zhang）"},{"y":1995,"t":"享受","s":"王菲","c":"Suzuki Syoko,Tozawa Yoshimi","r":"日"},{"y":1995,"t":"一半","s":"王菲","c":"Viktoria"},{"y":1995,"t":"（無題）","s":"王菲","c":"江志仁"},{"y":1995,"t":"Desire","s":"王馨平","c":"江志仁"},{"y":1995,"t":"再生花","s":"王馨平","c":"林偉文"},{"y":1995,"t":"新鮮感發作","s":"古巨基","c":"區新明"},{"y":1995,"t":"戀愛熱","s":"江希文","c":"大黒摩季","r":"日"},{"y":1995,"t":"一分鐘英雄","s":"成龍","c":"梁邦彥"},{"y":1995,"t":"我愛香港","s":"成龍","c":"李宗盛"},{"y":1995,"t":"問心無愧","s":"成龍","c":"包小松,包小柏"},{"y":1995,"t":"對得起自己","s":"成龍","c":"包小松/包小柏"},{"y":1995,"t":"多情的愛人","s":"吳倩蓮","c":"黃嘉倩"},{"y":1995,"t":"心亂如麻","s":"吳倩蓮","c":"馮鏡輝"},{"y":1995,"t":"不是壞女人","s":"吳倩蓮","c":"蔡國權"},{"y":1995,"t":"愛到下一個日落","s":"吳倩蓮","c":"鍾志榮"},{"y":1995,"t":"爭取時間","s":"呂方","c":"辛偉力"},{"y":1995,"t":"阿方正傳","s":"呂方","c":"袁惟仁"},{"y":1995,"t":"戀愛中的男人","s":"呂方","c":"呂方"},{"y":1995,"t":"我不哭","s":"呂方","c":"辛偉力"},{"y":1995,"t":"冷感","s":"李克勤","c":"羅宇榮"},{"y":1995,"t":"不必對我好","s":"李克勤","c":"殷文琦"},{"y":1995,"t":"非愛不可","s":"李國祥","c":"藤井フミヤ","r":"日"},{"y":1995,"t":"答應我妳會愛上好男人","s":"李國祥","c":"李國祥"},{"y":1995,"t":"Be Your Love","s":"杜德偉","c":"小蟲"},{"y":1995,"t":"天使對魔鬼","s":"杜德偉","c":"李振權"},{"y":1995,"t":"下世紀的戀人","s":"杜德偉","c":"辛偉力"},{"y":1995,"t":"天真","s":"杜德偉","c":"小蟲"},{"y":1995,"t":"誰來愛我","s":"杜德偉","c":"杜德偉/Randall Lipford Jr","r":"混"},{"y":1995,"t":"如果你是我一半","s":"杜德偉","c":"杜德偉"},{"y":1995,"t":"誰說不可以","s":"金城武","c":"花比傲"},{"y":1995,"t":"愛我吧","s":"金城武","c":"劉諾生"},{"y":1995,"t":"自言自語","s":"風火海","c":"黃偉年"},{"y":1995,"t":"偷","s":"風火海","c":"黃偉年"},{"y":1995,"t":"霹靂啪嘞踢踢踢","s":"風火海","c":"辛偉力"},{"y":1995,"t":"一絲不掛","s":"風火海","c":"澤日生"},{"y":1995,"t":"為何天生不是女人","s":"草蜢","c":"蔡一傑"},{"y":1995,"t":"到處睡的女人","s":"草蜢","c":"楊震龍"},{"y":1995,"t":"弟兄姊妹","s":"草蜢","c":"蔡一傑"},{"y":1995,"t":"我們都是這樣失戀的","s":"草蜢","c":"蔡一智"},{"y":1995,"t":"難道我們就這樣分手","s":"草蜢","c":"蔡一智"},{"y":1995,"t":"蝴蝶吻","s":"孫耀威","c":"江志仁"},{"y":1995,"t":"多謝關心","s":"張智霖","c":"張宇"},{"y":1995,"t":"剎那愛","s":"張學友","c":"谷村新司","r":"日"},{"y":1995,"t":"故事的名字","s":"梁朝偉","c":"盧冠廷"},{"y":1995,"t":"愛與情","s":"梁漢文","c":"李偲菘"},{"y":1995,"t":"多多少少","s":"梁漢文","c":"黃國倫"},{"y":1995,"t":"愛情甜蜜債","s":"梅艷芳","c":"米米CLUB","r":"日"},{"y":1995,"t":"從你祝福中離開","s":"許志安","c":"倫永亮"},{"y":1995,"t":"電影少女","s":"許秋怡","c":"蔡德才"},{"y":1995,"t":"情人眼裏看世界","s":"郭富城","c":"黃尚偉"},{"y":1995,"t":"戀愛中","s":"郭富城","c":"雷頌德"},{"y":1995,"t":"不只一次","s":"郭富城","c":"甘志偉"},{"y":1995,"t":"化裝舞會","s":"郭富城","c":"譚國政"},{"y":1995,"t":"用一首歌的時間懷念妳","s":"郭富城","c":"葉展華"},{"y":1995,"t":"你給我自信","s":"陳建穎","c":"辛偉力"},{"y":1995,"t":"死黨","s":"陳建穎","c":"辛偉力"},{"y":1996,"t":"別放棄","s":"Eric Raymond（ER）","c":"Eric Raymond（ER）"},{"y":1996,"t":"暗湧","s":"王菲","c":"陳輝陽"},{"y":1996,"t":"有心","s":"古巨基","c":"黃家強"},{"y":1996,"t":"難道你都記不起","s":"古巨基、陳慧琳","c":"陳輝虹"},{"y":1996,"t":"等的只是你","s":"伍詠薇、巫啟賢","c":"郭文宗"},{"y":1996,"t":"三個星期","s":"吳倩蓮","c":"子勇"},{"y":1996,"t":"愛您這一場","s":"吳倩蓮","c":"胡偉立"},{"y":1996,"t":"愛您是我不對","s":"吳倩蓮","c":"胡偉立"},{"y":1996,"t":"高溫接觸","s":"吳倩蓮","c":"Keun Tae Park","r":"韓"},{"y":1996,"t":"無話可說","s":"呂方","c":"陳澤忠（Chan Chak Chung）"},{"y":1996,"t":"我不是你","s":"巫奇","c":"巫奇"},{"y":1996,"t":"心不死","s":"巫啟賢","c":"杜琪峯"},{"y":1996,"t":"不傷感情","s":"巫啟賢","c":"巫啓賢"},{"y":1996,"t":"將錯就錯","s":"李克勤","c":"辛偉力"},{"y":1996,"t":"心領","s":"李克勤","c":"蔡一智"},{"y":1996,"t":"一知半解","s":"李克勤","c":"吳國敬"},{"y":1996,"t":"叫世界喝采","s":"李克勤、劉德華","c":"黃英華"},{"y":1996,"t":"讓時間做證","s":"李蕙敏","c":"曾加謀"},{"y":1996,"t":"贈興","s":"李蕙敏","c":"曾加謀"},{"y":1996,"t":"其實你可以","s":"車沅沅","c":"江志仁"},{"y":1996,"t":"最好不過","s":"車沅沅","c":"陳偉文"},{"y":1996,"t":"笑與哭","s":"周華健","c":"包小銘"},{"y":1996,"t":"我知道","s":"周華健","c":"周華健"},{"y":1996,"t":"擺渡的歲月","s":"周華健","c":"周華健"},{"y":1996,"t":"快樂","s":"周華健","c":"包小松"},{"y":1996,"t":"愛冒險","s":"周華健","c":"聶周燕"},{"y":1996,"t":"像我這樣的男人","s":"周華健","c":"周華健"},{"y":1996,"t":"愛你一眼","s":"周華健","c":"周華健"},{"y":1996,"t":"處處愛","s":"周華健","c":"周華健"},{"y":1996,"t":"為甚麼我要走","s":"周華健","c":"周華健"},{"y":1996,"t":"你有愛過我嗎","s":"周華健","c":"周華健"},{"y":1996,"t":"難唸的經","s":"周華健","c":"周華健"},{"y":1996,"t":"曲終人不散","s":"周華健","c":"包小柏"},{"y":1996,"t":"答案","s":"林子祥","c":"雷宇揚"},{"y":1996,"t":"天衣無縫","s":"林憶蓮","c":"李宗盛"},{"y":1996,"t":"色情男女","s":"莫文蔚","c":"蔡德才"},{"y":1996,"t":"浮砂","s":"莫文蔚","c":"劉沁"},{"y":1996,"t":"暗戀的習慣","s":"許志安","c":"黃國倫"},{"y":1996,"t":"下次","s":"許志安","c":"黃國倫"},{"y":1996,"t":"化妝舞會","s":"郭富城","c":"譚國政"},{"y":1996,"t":"脫軌","s":"郭富城","c":"黃國倫"},{"y":1996,"t":"盛大獻映","s":"郭富城","c":"江志仁"},{"y":1996,"t":"緩慢","s":"郭富城","c":"江志仁"},{"y":1996,"t":"戰無不勝","s":"陳小春","c":"伍樂城"},{"y":1996,"t":"安守本份","s":"陳奕迅","c":"吳旭文"},{"y":1996,"t":"愛情，幼稚！","s":"陳奕迅","c":"李偉菘"},{"y":1996,"t":"你有幾多情","s":"陳建穎","c":"Luis Angel Marquez","r":"外"},{"y":1996,"t":"寧願我會記不起","s":"陳慧琳","c":"陳輝虹"},{"y":1996,"t":"收音機","s":"陳慧琳","c":"陳輝虹"},{"y":1996,"t":"心滿意足","s":"陳慧嫻","c":"李偲菘"},{"y":1996,"t":"我肯，我等，我害怕","s":"陳慧嫻","c":"洪堯斌"},{"y":1996,"t":"不安的快樂","s":"陳曉東","c":"劉志遠"},{"y":1996,"t":"春風","s":"彭羚","c":"杜自持"},{"y":1996,"t":"在晨曦中出發","s":"彭羚","c":"葉良俊"},{"y":1996,"t":"生日快樂","s":"彭羚","c":"Billy Chan"},{"y":1996,"t":"我想笑","s":"彭羚","c":"辛葆璉"},{"y":1996,"t":"你有，我沒有","s":"彭羚","c":"葉良俊"},{"y":1996,"t":"你和我一樣","s":"彭羚","c":"黃艾倫"},{"y":1996,"t":"當世上只得你","s":"曾仕賢","c":"陳嘉樂"},{"y":1996,"t":"感冒","s":"湯寶如","c":"沈慶良（Robert Seng）"},{"y":1996,"t":"小事","s":"湯寶如","c":"郭靖"},{"y":1996,"t":"我敢","s":"湯寶如","c":"Maki"},{"y":1996,"t":"夏娃的第8天","s":"黃耀明","c":"黃耀明/Minimal"},{"y":1996,"t":"陌生人","s":"楊千嬅","c":"譚展輝"},{"y":1996,"t":"我錯過了甚麼","s":"楊千嬅","c":"陳輝陽"},{"y":1996,"t":"不死身","s":"葉蒨文","c":"Babyface","r":"外"},{"y":1996,"t":"萬人迷","s":"達明一派","c":"劉以達"},{"y":1996,"t":"甜美生活（萬歲萬歲萬萬歲）","s":"達明一派","c":"劉以達"},{"y":1996,"t":"青春殘酷物語","s":"達明一派","c":"劉以達"},{"y":1996,"t":"晚節不保","s":"達明一派","c":"劉以達"},{"y":1996,"t":"東拉西扯","s":"蔣卓樂","c":"東拉西扯 蔣卓樂"},{"y":1996,"t":"沒時間","s":"胡凱欣","c":"盛川野久","r":"日"},{"y":1996,"t":"我還需要甚麼","s":"胡凱欣","c":"許惠琛"},{"y":1996,"t":"這樣可以嗎","s":"胡凱欣","c":"許惠琛"},{"y":1996,"t":"分別","s":"胡凱欣","c":"許惠琛"},{"y":1996,"t":"我話事","s":"風火海","c":"伍樂城"},{"y":1996,"t":"非一般見識","s":"風火海","c":"林子揚"},{"y":1996,"t":"對一個人愛錯","s":"草蜢","c":"荒木真樹彥","r":"日"},{"y":1996,"t":"今夜唱甚麼歌","s":"張信哲","c":"張宇"},{"y":1996,"t":"他有甚麼好","s":"張信哲","c":"杜自持"},{"y":1996,"t":"偷情","s":"張國榮","c":"江志仁"},{"y":1996,"t":"有心人","s":"張國榮","c":"張國榮"},{"y":1996,"t":"還有誰","s":"張國榮","c":"黃偉年"},{"y":1996,"t":"談情說愛","s":"張國榮","c":"江志仁"},{"y":1996,"t":"你我之間","s":"張國榮","c":"辛偉力"},{"y":1996,"t":"怨男","s":"張國榮","c":"陳輝陽"},{"y":1996,"t":"怪你過份美麗","s":"張國榮","c":"唐奕聰"},{"y":1996,"t":"不想擁抱我的人","s":"張國榮","c":"陳小霞"},{"y":1996,"t":"意猶未盡","s":"張國榮","c":"張國榮"},{"y":1996,"t":"紅","s":"張國榮","c":"張國榮"},{"y":1996,"t":"妳的名字我的姓氏","s":"張學友","c":"李偲菘"},{"y":1996,"t":"偷偷愛你","s":"梁朝偉","c":"周華健"},{"y":1996,"t":"可惜","s":"梁詠琪","c":"Calvin Ho"},{"y":1996,"t":"我需要的只是愛","s":"梁漢文","c":"李偲菘"},{"y":1996,"t":"不枉此生","s":"梅艷芳","c":"許願"},{"y":1996,"t":"怕甚麼","s":"鄭伊健","c":"辛偉力"},{"y":1996,"t":"知己．自己","s":"鄭伊健、風火海","c":"伍樂城"},{"y":1996,"t":"顏色...氣味","s":"鄭秀文","c":"江志仁"},{"y":1996,"t":"不拖不欠","s":"鄭秀文","c":"陳偉堅"},{"y":1996,"t":"只要為你活一晚","s":"鄭秀文","c":"EPO","r":"日"},{"y":1996,"t":"請放心","s":"鄭秀文","c":"SAM LORBER","r":"外"},{"y":1996,"t":"你我","s":"黎明","c":"陳輝虹"},{"y":1996,"t":"或許...未必...不過","s":"黎明","c":"雷頌德"},{"y":1996,"t":"雜念","s":"黎明","c":"雷頌德"},{"y":1996,"t":"小心眼","s":"黎姿","c":"黎姿"},{"y":1996,"t":"一千種不放心","s":"鍾漢良","c":"陳光榮"},{"y":1996,"t":"告訴我要怎樣愛","s":"鍾漢良","c":"李偲菘"},{"y":1996,"t":"兩個字","s":"顏聯武","c":"鮑比達"},{"y":1996,"t":"星閃閃","s":"顏聯武","c":"趙增熹"},{"y":1996,"t":"活着","s":"顏聯武","c":"董繼剛"},{"y":1996,"t":"劫後餘生","s":"顏聯武","c":"蘇德華"},{"y":1996,"t":"天曉得","s":"譚詠麟","c":"FRANK MUSKER |RICHARD DARBYSHIRE","r":"外"},{"y":1996,"t":"假使妳聽得見","s":"譚耀文","c":"小白"},{"y":1996,"t":"歡天喜地留給你","s":"譚耀文","c":"沈慶良（Robert Seng）"},{"y":1996,"t":"這樣已經是最好","s":"蘇慧倫","c":"包小柏"},{"y":1996,"t":"要你記住我","s":"蘇慧倫","c":"包小柏"},{"y":1996,"t":"陌生人快樂","s":"蘇慧倫","c":"劉沁"},{"y":1996,"t":"私人空間","s":"杜德偉","c":"杜德偉"},{"y":1996,"t":"危險關係","s":"杜德偉","c":"黃偉年"},{"y":1996,"t":"Loving You","s":"杜德偉","c":"羅百吉"},{"y":1996,"t":"情感蒸發","s":"周華健","c":"賴雨辰"},{"y":1996,"t":"濃情化不開","s":"周華健","c":"周華健"},{"y":1996,"t":"新天長地久之男大當戀女大當愛","s":"周華健","c":"周華健"},{"y":1996,"t":"為愛情受傷","s":"周華健","c":"周華健"},{"y":1996,"t":"然後然後","s":"周華健","c":"包小柏"},{"y":1996,"t":"風笑痴","s":"周華健","c":"周華健"},{"y":1996,"t":"多一分鐘少一分鐘","s":"周華健","c":"包小松"},{"y":1996,"t":"從一開始","s":"周華健","c":"周華健"},{"y":1996,"t":"沿途有你","s":"周華健","c":"劉志宏"},{"y":1996,"t":"誰叫我","s":"周華健","c":"周華健"},{"y":1996,"t":"是你叫我","s":"周華健","c":"包小柏"},{"y":1996,"t":"一個．兩個","s":"周華健","c":"周華健"},{"y":1996,"t":"欲罷不能","s":"周華健","c":"周華健"},{"y":1996,"t":"神話．情話","s":"周華健、齊豫","c":"周華健"},{"y":1996,"t":"愛了再愛","s":"周華健、蘇慧倫","c":"Robbie"},{"y":1996,"t":"男人心","s":"周慧敏、關淑怡","c":"Benny Andersson/Tim Rice/Bjorn Ulvaeus","r":"外"},{"y":1996,"t":"十八變","s":"林子祥","c":"林子祥"},{"y":1996,"t":"看吧","s":"林憶蓮","c":"小田和正","r":"日"},{"y":1996,"t":"我愛過你還是你愛過我","s":"邱綺玲","c":"邱福興"},{"y":1996,"t":"失戀可以好過些","s":"陳慧琳","c":"雷頌德"},{"y":1996,"t":"不知不覺","s":"陳慧琳","c":"雷頌德"},{"y":1996,"t":"打開天空","s":"陳慧琳、陳曉東、陳建穎、邱穎欣","c":"雷頌德"},{"y":1996,"t":"彷如隔世","s":"彭羚","c":"張宇/何啓弘"},{"y":1996,"t":"雪亮眼睛","s":"湯寶如","c":"林志美/林夕"},{"y":1996,"t":"自命風流","s":"湯寶如","c":"Partrick Delay/甘志偉/譚國政","r":"混"},{"y":1996,"t":"劇情需要","s":"湯寶如","c":"Sarah Nagoumey/Dyna Brein","r":"外"},{"y":1996,"t":"春光乍洩","s":"黃耀明","c":"黃耀明、蔡德才"},{"y":1996,"t":"天國近了（你們應當遊戲）","s":"黃耀明","c":"黃耀明、Minimal"},{"y":1996,"t":"這世界非我家","s":"黃耀明","c":"黃偉光"},{"y":1996,"t":"深呼吸","s":"葉蒨文","c":"Reid/Babyface/Simmons","r":"外"},{"y":1996,"t":"何處見青天","s":"趙傳","c":"陸泓宇"},{"y":1996,"t":"第五季","s":"劉小慧","c":"Freeway"},{"y":1996,"t":"極度情慾","s":"劉德華","c":"許願"},{"y":1996,"t":"愛你沒問題","s":"劉德華","c":"江志仁"},{"y":1996,"t":"我不了解你","s":"鄭伊健","c":"Cong Wang"},{"y":1996,"t":"內心戲","s":"鄭秀文","c":"倫永亮/陳澤忠"},{"y":1996,"t":"奢侈","s":"鄭秀文","c":"譚國政"},{"y":1996,"t":"告訴我你會在夢境中等我","s":"黎明","c":"玉置浩二","r":"日"},{"y":1996,"t":"沒名字的歌．無名字的你","s":"黎明","c":"Calvin Ho"},{"y":1996,"t":"剎那心情","s":"黎明","c":"黎明"},{"y":1996,"t":"糾纏","s":"羅敏莊","c":"安格斯"},{"y":1996,"t":"你想怎樣","s":"蘇永康","c":"江志仁"},{"y":1997,"t":"預備","s":"Beyond","c":"黃家強"},{"y":1997,"t":"我記得","s":"Beyond","c":"黃家強"},{"y":1997,"t":"剎那天地","s":"David Bowie","c":"David Bowie/Reeves Gabrels","r":"外"},{"y":1997,"t":"20,000日環遊世界","s":"Dry","c":"雷頌德"},{"y":1997,"t":"誰來開口","s":"Dry","c":"雷頌德"},{"y":1997,"t":"約定","s":"王菲","c":"陳小霞"},{"y":1997,"t":"敷衍","s":"王菲","c":"黃家強"},{"y":1997,"t":"玩具","s":"王菲","c":"江志仁"},{"y":1997,"t":"我信","s":"王菲","c":"陳偉文"},{"y":1997,"t":"守時","s":"王菲","c":"陳小霞"},{"y":1997,"t":"守護天使","s":"王菲","c":"黃家強"},{"y":1997,"t":"自便","s":"王菲","c":"陳偉文"},{"y":1997,"t":"不得了","s":"王菲","c":"江志仁"},{"y":1997,"t":"心驚膽戰","s":"王菲","c":"張亞東"},{"y":1997,"t":"娛樂場","s":"王菲","c":"Robin Guthrie/Simon Raymonde","r":"外"},{"y":1997,"t":"姥姥之歌","s":"王馨平","c":"胡偉立"},{"y":1997,"t":"失常","s":"古巨基","c":"陳輝虹"},{"y":1997,"t":"要是那時...","s":"古巨基","c":"黃偉年"},{"y":1997,"t":"最後勝利","s":"古巨基","c":"小兵"},{"y":1997,"t":"一千種快樂","s":"正東群星","c":"雷頌德"},{"y":1997,"t":"有事","s":"何超儀","c":"張世彬"},{"y":1997,"t":"看得出的快活","s":"何超儀","c":"錢文璟"},{"y":1997,"t":"前度","s":"何超儀","c":"陳輝陽"},{"y":1997,"t":"我有我愛你","s":"吳倩蓮","c":"許願"},{"y":1997,"t":"合照","s":"吳倩蓮","c":"劉祖德/勞子"},{"y":1997,"t":"40℃接觸","s":"吳倩蓮","c":"Keun Tae Park","r":"韓"},{"y":1997,"t":"愛到厭","s":"呂方","c":"陳偉文"},{"y":1997,"t":"不想再有感覺","s":"呂方","c":"黃舒駿"},{"y":1997,"t":"像你","s":"呂方","c":"陳小霞"},{"y":1997,"t":"虛線","s":"李玟","c":"梁伯君"},{"y":1997,"t":"2090年再愛你","s":"李玟","c":"伍思凱"},{"y":1997,"t":"問自己","s":"李玟","c":"柯貴民"},{"y":1997,"t":"如果你決定不愛我","s":"李玟","c":"李振權"},{"y":1997,"t":"為甚麼是你","s":"梅艷芳","c":"李迪文","r":"?"},{"y":1997,"t":"我愛風光好","s":"梅艷芳、倫永亮","c":"顧嘉煇"},{"y":1997,"t":"只有雪糕的燭光晚餐","s":"莫文蔚","c":"呂聖斐"},{"y":1997,"t":"男人的感慨","s":"許志安","c":"李迪文"},{"y":1997,"t":"阿門","s":"許志安","c":"張佳添"},{"y":1997,"t":"星河感覺","s":"許志安","c":"雷頌德"},{"y":1997,"t":"我的天，我的歌","s":"許志安","c":"雷頌德"},{"y":1997,"t":"心靈相通","s":"許志安","c":"林毅心"},{"y":1997,"t":"明知故犯","s":"許美靜","c":"陳佳明"},{"y":1997,"t":"月光光","s":"許美靜","c":"陳佳明"},{"y":1997,"t":"有效日期","s":"郭富城","c":"譚國政/鄧雷瑩"},{"y":1997,"t":"我抱歉","s":"郭富城","c":"伍樂城"},{"y":1997,"t":"心頭好","s":"郭富城","c":"金小兵"},{"y":1997,"t":"生日禮物","s":"郭富城","c":"黃文廣"},{"y":1997,"t":"與我常在","s":"陳奕迅","c":"林健華"},{"y":1997,"t":"生命有幾好","s":"陳奕迅","c":"王治平"},{"y":1997,"t":"請柬","s":"陳慧琳","c":"雷頌德"},{"y":1997,"t":"有房出租","s":"陳慧琳","c":"金小兵"},{"y":1997,"t":"我要看齣戲","s":"陳慧琳","c":"雷頌德/單立文"},{"y":1997,"t":"一齣戲","s":"陳慧琳","c":"雷頌德"},{"y":1997,"t":"二人時間","s":"陳慧嫻","c":"李偲菘"},{"y":1997,"t":"分享孤獨","s":"陳潔儀","c":"許環良"},{"y":1997,"t":"甚麼吸引","s":"陳曉東","c":"方樹樑"},{"y":1997,"t":"讓我們快樂在一起","s":"彭羚","c":"李迪文"},{"y":1997,"t":"願你也在這裏","s":"彭羚","c":"胡家團"},{"y":1997,"t":"你說","s":"彭羚","c":"李偲菘"},{"y":1997,"t":"我沒有戀愛","s":"湯寶如","c":"唐玉璇"},{"y":1997,"t":"其後","s":"湯寶如","c":"alex dela cruz","r":"外"},{"y":1997,"t":"人山人海","s":"黃耀明","c":"人山人海"},{"y":1997,"t":"風月寶鑑","s":"黃耀明","c":"于逸堯/梁基爵/黃耀明"},{"y":1997,"t":"我要環遊世界","s":"黃耀明","c":"亞里安"},{"y":1997,"t":"唱機","s":"黃耀明","c":"雷頌德"},{"y":1997,"t":"想偷你","s":"楊千嬅","c":"李伯健"},{"y":1997,"t":"非親非故","s":"李蕙敏","c":"李蕙敏"},{"y":1997,"t":"疤痕","s":"李蕙敏","c":"李蕙敏"},{"y":1997,"t":"我是女主角","s":"李蕙敏","c":"澤田知可子","r":"日"},{"y":1997,"t":"愛剎那","s":"李蕙敏","c":"馮穎琪"},{"y":1997,"t":"如果你我","s":"杜德偉","c":"李宗盛"},{"y":1997,"t":"差不多","s":"杜德偉","c":"李宗盛"},{"y":1997,"t":"盪得起","s":"杜德偉","c":"Shin in Soo","r":"韓"},{"y":1997,"t":"窒息","s":"杜德偉","c":"Bulent Aris/Toni Cottura","r":"外"},{"y":1997,"t":"不怕死","s":"杜德偉","c":"杜德偉,Jamie Murcell","r":"混"},{"y":1997,"t":"有過去的人","s":"周華健","c":"周華健"},{"y":1997,"t":"男人緣","s":"周華健","c":"包小松"},{"y":1997,"t":"今夜無所不能","s":"周華健","c":"周華健/郭宗韶/李庭匡"},{"y":1997,"t":"算甚麼","s":"周華健","c":"周華健"},{"y":1997,"t":"夜半歌聲","s":"周華健","c":"周華健"},{"y":1997,"t":"小圈子","s":"周華健","c":"賴雨辰"},{"y":1997,"t":"最後今天","s":"周華健","c":"周華健"},{"y":1997,"t":"女人緣","s":"周華健","c":"包小松"},{"y":1997,"t":"新性情中人","s":"周華健","c":"包小松"},{"y":1997,"t":"世界由你我開始","s":"周華健","c":"周華健"},{"y":1997,"t":"鐘擺","s":"胡蓓蔚","c":"梁邦彥"},{"y":1997,"t":"我不怕哭","s":"孫耀威","c":"陳光榮"},{"y":1997,"t":"二人世界","s":"草蜢","c":"蔡一智"},{"y":1997,"t":"娛樂無窮","s":"草蜢","c":"金崇煥","r":"韓"},{"y":1997,"t":"蜜糖","s":"馬浚偉","c":"辛偉力"},{"y":1997,"t":"早知道愛上你","s":"張信哲","c":"李宗盛"},{"y":1997,"t":"騷擾","s":"張智霖","c":"李偉菘"},{"y":1997,"t":"天馬行空之妙想天開","s":"張學友、劉德華","c":"雷頌德"},{"y":1997,"t":"如何說再見","s":"張燊悅","c":"雷頌德"},{"y":1997,"t":"新居","s":"梁詠琪","c":"黃國倫"},{"y":1997,"t":"學習離開你","s":"梁詠琪","c":"黃韋皓"},{"y":1997,"t":"吞吐","s":"梁詠琪","c":"黃國倫"},{"y":1997,"t":"天涯：太陽之西","s":"梁漢文","c":"伍樂城"},{"y":1997,"t":"海角：國境之南","s":"梁漢文","c":"趙增熹"},{"y":1997,"t":"再見二丁目","s":"楊千嬅","c":"于逸堯"},{"y":1997,"t":"遊花園","s":"楊千嬅","c":"陳輝陽"},{"y":1997,"t":"手信","s":"楊千嬅","c":"于逸堯"},{"y":1997,"t":"二人前","s":"楊千嬅","c":"馮正"},{"y":1997,"t":"E-714342","s":"楊千嬅","c":"于逸堯"},{"y":1997,"t":"數你","s":"楊千嬅","c":"蔡德才"},{"y":1997,"t":"娛樂自己","s":"葉蒨文","c":"Denny Randall/Letty Jo Randall","r":"外"},{"y":1997,"t":"小宇宙","s":"葉蒨文","c":"Allan Rich/Jud Friedman","r":"外"},{"y":1997,"t":"你們都很好","s":"雷頌德","c":"雷頌德"},{"y":1997,"t":"兩心花","s":"趙學而","c":"王雙駿"},{"y":1997,"t":"尋開心","s":"趙學而","c":"周初晨"},{"y":1997,"t":"不談情感","s":"劉德華","c":"孫偉倫"},{"y":1997,"t":"黑山老妖","s":"鄭中基","c":"胡偉立"},{"y":1997,"t":"至少還有我","s":"鄭伊健","c":"李偲菘/陳光榮"},{"y":1997,"t":"誰可情深如我","s":"鄭伊健","c":"李偲菘, 陳光榮"},{"y":1997,"t":"Shine","s":"鄭伊健","c":"伍樂城"},{"y":1997,"t":"唉聲嘆氣","s":"鄭秀文","c":"Cheope、Robert Buti","r":"外"},{"y":1997,"t":"最後一次","s":"鄭秀文","c":"陳偉堅"},{"y":1997,"t":"愛加深","s":"黎明","c":"雷頌德"},{"y":1997,"t":"只要為我愛一天","s":"黎明","c":"雷頌德"},{"y":1997,"t":"世界之最","s":"黎明","c":"雷頌德"},{"y":1997,"t":"煙花背後","s":"黎明","c":"黎明"},{"y":1997,"t":"半生緣","s":"黎明","c":"黃國倫"},{"y":1997,"t":"重複動作","s":"黎明","c":"黎明"},{"y":1997,"t":"招呼你朋友","s":"黎明","c":"雷頌德"},{"y":1997,"t":"貪新愛舊","s":"黎明","c":"雷頌德"},{"y":1997,"t":"黎明與我","s":"黎明","c":"雷頌德"},{"y":1997,"t":"曝光","s":"黎明","c":"謝霆鋒"},{"y":1997,"t":"扮幼稚","s":"黎明","c":"雷頌德"},{"y":1997,"t":"天馬行空之開天闢地","s":"黎明、王菲","c":"雷頌德"},{"y":1997,"t":"逃","s":"黎駿","c":"郭熾賢"},{"y":1997,"t":"為你好","s":"謝霆鋒","c":"徐日勤"},{"y":1997,"t":"如果給我一百歲","s":"謝霆鋒","c":"Job Bartell","r":"外"},{"y":1997,"t":"起身","s":"譚小環","c":"黃丹儀"},{"y":1997,"t":"非愛不可","s":"關淑怡、陳琪","c":"Pamela Sheyne,Phil Manakiza","r":"外"},{"y":1997,"t":"誰肯認命","s":"蘇永康","c":"蘇永康"},{"y":1997,"t":"好朋友","s":"梁漢文","c":"伍樂城"},{"y":1997,"t":"不問自戀","s":"梁漢文","c":"陳輝陽"},{"y":1997,"t":"免費午餐","s":"梁漢文","c":"陳輝陽"},{"y":1997,"t":"秘密宣言","s":"蘇永康","c":"雷頌德"},{"y":1997,"t":"請將音量收細","s":"蘇永康","c":"吳國敬"},{"y":1997,"t":"善忘","s":"蘇永康","c":"黃尚偉"},{"y":1998,"t":"別怪我","s":"Beyond","c":"黃貫中"},{"y":1998,"t":"奉信","s":"Beyond","c":"黃貫中"},{"y":1998,"t":"你的錯是我的對","s":"Dry","c":"馮德倫"},{"y":1998,"t":"原諒自己","s":"王菲","c":"潘協慶"},{"y":1998,"t":"償還","s":"王菲","c":"柳重言"},{"y":1998,"t":"情誡","s":"王菲","c":"陳偉文"},{"y":1998,"t":"Ba Da Da","s":"古巨基","c":"黎允文"},{"y":1998,"t":"冷水","s":"古巨基","c":"小兵"},{"y":1998,"t":"日落大道","s":"古巨基","c":"張佳添"},{"y":1998,"t":"有你一天","s":"古巨基","c":"張佳添"},{"y":1998,"t":"男子漢","s":"成龍、陳慧琳等","c":"殷文琦"},{"y":1998,"t":"兩種人","s":"何嘉莉","c":"伍樂城"},{"y":1998,"t":"成全我","s":"李心潔","c":"張震嶽"},{"y":1998,"t":"百年之癢","s":"林子祥","c":"林子祥"},{"y":1998,"t":"只愛西經","s":"洪楗華","c":"李健達、鄭敬基"},{"y":1998,"t":"難為自己","s":"洪楗華","c":"楊鎮邦"},{"y":1998,"t":"你如何失戀","s":"張信哲","c":"沈慶良（Robert Seng）"},{"y":1998,"t":"多心","s":"張信哲","c":"劉祖德"},{"y":1998,"t":"忘掉了星期天","s":"張信哲","c":"Andy Goldmark","r":"外"},{"y":1998,"t":"憎你","s":"張信哲","c":"Thompson/Verteiney","r":"外"},{"y":1998,"t":"直到明天","s":"張信哲","c":"陳美鳳"},{"y":1998,"t":"別祝我愉快","s":"張信哲","c":"陳建寧"},{"y":1998,"t":"這些年來","s":"張國榮","c":"劉志宏"},{"y":1998,"t":"上帝","s":"張國榮","c":"劉志宏"},{"y":1998,"t":"一千零一晚","s":"彭羚","c":"陳輝陽"},{"y":1998,"t":"你最近怎樣","s":"彭羚","c":"陳小霞"},{"y":1998,"t":"你得我","s":"曾志偉等","c":"雷頌德"},{"y":1998,"t":"舊居入伙（六週年紀念）","s":"湯寶如","c":"王聲震"},{"y":1998,"t":"碎心電話亭","s":"超仁","c":"陳偉"},{"y":1998,"t":"我想要飛","s":"超仁","c":"王美蓮"},{"y":1998,"t":"越快樂越墮落","s":"黃耀明","c":"陳輝陽"},{"y":1998,"t":"客人","s":"黃耀明、胡蓓蔚","c":"孫偉明"},{"y":1998,"t":"曾幾何時","s":"楊千嬅","c":"伍樂城"},{"y":1998,"t":"我有指數","s":"楊千嬅","c":"黃國倫"},{"y":1998,"t":"因為所以","s":"楊千嬅","c":"陳小霞"},{"y":1998,"t":"出埃及記","s":"楊千嬅","c":"梁基爵"},{"y":1998,"t":"台北夜沒有車","s":"楊千嬅","c":"許惠琛"},{"y":1998,"t":"味之素","s":"楊千嬅","c":"陳輝陽"},{"y":1998,"t":"只要為我好","s":"楊千嬅","c":"林慕德"},{"y":1998,"t":"花樣+年華","s":"楊千嬅","c":"鍾國仁"},{"y":1998,"t":"愛人","s":"楊千嬅","c":"于逸堯"},{"y":1998,"t":"非買品","s":"楊千嬅","c":"黃敬佩"},{"y":1998,"t":"我們都一樣","s":"群星","c":"曹軒賓"},{"y":1998,"t":"愛不只一次","s":"葉蒨文","c":"朱敬然"},{"y":1998,"t":"愛得起","s":"趙學而","c":"黃麗星"},{"y":1998,"t":"壞得好","s":"趙學而","c":"劉諾生"},{"y":1998,"t":"早抖","s":"趙學而","c":"李迪文"},{"y":1998,"t":"然後","s":"趙學而","c":"周初晨"},{"y":1998,"t":"據為己有","s":"趙學而","c":"黃國倫"},{"y":1998,"t":"一日一千年","s":"趙學而","c":"李迪文"},{"y":1998,"t":"夠時間","s":"趙學而","c":"曾加謀"},{"y":1998,"t":"手語","s":"趙學而","c":"劉諾生"},{"y":1998,"t":"告解","s":"趙學而","c":"周初晨"},{"y":1998,"t":"我不相信眼淚","s":"劉德華","c":"高楓"},{"y":1998,"t":"你呼我吸","s":"劉德華","c":"李迪文"},{"y":1998,"t":"天方夜譚","s":"鄭中基","c":"Marta Sanchez/Carlos Toro Montro","r":"外"},{"y":1998,"t":"感情用事","s":"鄭伊健","c":"葉良俊"},{"y":1998,"t":"風雲","s":"鄭伊健","c":"陳光榮"},{"y":1998,"t":"一對對","s":"鄭伊健","c":"陳光榮"},{"y":1998,"t":"蟲兒飛","s":"鄭伊健","c":"陳光榮"},{"y":1998,"t":"天氣的錯？","s":"鄭伊健","c":"陳光榮"},{"y":1998,"t":"以後","s":"張國榮","c":"張國榮"},{"y":1998,"t":"最冷一天","s":"張國榮","c":"陳小霞"},{"y":1998,"t":"想哭","s":"張學友","c":"李偲菘"},{"y":1998,"t":"請你","s":"梁漢文","c":"林慕源"},{"y":1998,"t":"大激想","s":"梁漢文、楊千嬅、陳奕迅","c":"林慕德"},{"y":1998,"t":"二人行一日後","s":"許志安","c":"雷頌德"},{"y":1998,"t":"小心天氣","s":"許志安","c":"李偲菘"},{"y":1998,"t":"少數","s":"許美靜","c":"陳佳明"},{"y":1998,"t":"幸福","s":"許美靜","c":"許美靜"},{"y":1998,"t":"想家的女人","s":"許美靜","c":"陳佳明"},{"y":1998,"t":"失戀不是一切","s":"許美靜","c":"陳佳明/許美靜"},{"y":1998,"t":"一場朋友","s":"許美靜","c":"陳佳明"},{"y":1998,"t":"不散不見","s":"許美靜","c":"許美靜"},{"y":1998,"t":"情理","s":"許美靜","c":"許美靜"},{"y":1998,"t":"無中生有","s":"許美靜","c":"許美靜"},{"y":1998,"t":"講理由","s":"許美靜","c":"陳佳明"},{"y":1998,"t":"好一對","s":"郭富城","c":"黃丹儀"},{"y":1998,"t":"最深愛的人是妳","s":"郭富城","c":"李迪文"},{"y":1998,"t":"我的快樂時代","s":"陳奕迅","c":"林健華"},{"y":1998,"t":"我甚麼都沒有","s":"陳奕迅","c":"陳偉"},{"y":1998,"t":"黃金時代","s":"陳奕迅","c":"柳重言"},{"y":1998,"t":"請相信我","s":"陳奕迅","c":"黃國倫"},{"y":1998,"t":"美滿人生","s":"陳奕迅","c":"林慕德"},{"y":1998,"t":"拉拉扯扯","s":"陳展鵬","c":"劉志遠"},{"y":1998,"t":"快快","s":"陳展鵬","c":"鄭光仁（GT）"},{"y":1998,"t":"Da De Dum（我失戀）","s":"陳慧琳","c":"雷頌德"},{"y":1998,"t":"薄情書","s":"陳慧琳","c":"鄧建明"},{"y":1998,"t":"倒影","s":"陳慧琳","c":"Matthew Wilder","r":"外"},{"y":1998,"t":"以你為榮","s":"陳慧琳等","c":"雷頌德"},{"y":1998,"t":"為最愛而戰","s":"陳慧琳等","c":"Matthew Wilder","r":"外"},{"y":1998,"t":"迷信","s":"陳潔儀","c":"潘協慶,梁文福"},{"y":1998,"t":"新歡加精選","s":"陳曉東","c":"黃尚偉"},{"y":1998,"t":"叫我","s":"陳曉東","c":"黃尚偉"},{"y":1998,"t":"下次請早","s":"陳曉東","c":"黃尚偉"},{"y":1998,"t":"一個人","s":"陳曉東","c":"黃尚偉"},{"y":1998,"t":"除非你","s":"鄭伊健","c":"葉良俊"},{"y":1998,"t":"祝大家好過","s":"鄭秀文","c":"黃尚偉"},{"y":1998,"t":"心血來潮","s":"鄭秀文","c":"黃尚偉"},{"y":1998,"t":"有問題","s":"鄭秀文","c":"Tania Tikaram","r":"外"},{"y":1998,"t":"無聊才愛我吧","s":"鄧建明","c":"鄧建明"},{"y":1998,"t":"愛你／不愛你","s":"黎明","c":"雷頌德"},{"y":1998,"t":"我這樣愛你","s":"黎明","c":"Sung Wook Choi","r":"韓"},{"y":1998,"t":"今生不再","s":"黎明","c":"李迪文"},{"y":1998,"t":"等到天昏地暗","s":"黎明","c":"李迪文"},{"y":1998,"t":"如果可以再見你","s":"黎明","c":"雷頌德"},{"y":1998,"t":"心裏有數","s":"黎明","c":"雷頌德"},{"y":1998,"t":"對不起·我愛誰","s":"黎明","c":"雷頌德"},{"y":1998,"t":"我沒有騙你","s":"黎明","c":"雷頌德"},{"y":1998,"t":"不如睡一睡","s":"盧巧音","c":"盧巧音"},{"y":1998,"t":"我很舒服","s":"盧巧音","c":"梁翹柏（Tim Leung）"},{"y":1998,"t":"開放日","s":"謝霆鋒","c":"伍樂城"},{"y":1998,"t":"如果只得一星期","s":"謝霆鋒","c":"伍樂城"},{"y":1998,"t":"謝謝你等我","s":"謝霆鋒","c":"伍樂城"},{"y":1998,"t":"前前後後左左右右","s":"謝霆鋒","c":"伍樂城"},{"y":1998,"t":"你情人在那裏","s":"謝霆鋒","c":"伍樂城"},{"y":1998,"t":"入口愛情","s":"謝霆鋒","c":"林夕"},{"y":1998,"t":"大世界","s":"謝霆鋒","c":"伍樂城"},{"y":1998,"t":"失戀形像","s":"譚小環","c":"陳國華"},{"y":1998,"t":"最差情人","s":"譚小環、Zen","c":"王雙駿"},{"y":1998,"t":"多一個少一個","s":"譚耀文","c":"辛偉力"},{"y":1998,"t":"我為你傷心","s":"蘇永康","c":"吳國敬"},{"y":1998,"t":"越吻越傷心","s":"蘇永康","c":"吳國敬"},{"y":1998,"t":"傾情割引","s":"蘇永康","c":"黃尚偉"},{"y":1998,"t":"小動作","s":"蘇永康","c":"雷頌德"},{"y":1998,"t":"向前行","s":"蘇永康等","c":"雷頌德"},{"y":1998,"t":"越吻越傷心（情人版）","s":"蘇永康、陳潔儀","c":"吳國敬"},{"y":1999,"t":"進化論","s":"Beyond","c":"黃貫中"},{"y":1999,"t":"千禧年","s":"Zen","c":"鄭偉鴻"},{"y":1999,"t":"晴天","s":"Zen","c":"鄭偉鴻"},{"y":1999,"t":"守望麥田","s":"王菲","c":"江志仁/陳偉文"},{"y":1999,"t":"郵差","s":"王菲","c":"陳偉文"},{"y":1999,"t":"擁有","s":"何嘉莉","c":"伍樂城"},{"y":1999,"t":"下一位","s":"何嘉莉","c":"伍樂城"},{"y":1999,"t":"花多眼亂","s":"何嘉莉","c":"Emily Dawn Philips/Anthony Edward Whiting/王雙駿","r":"混"},{"y":1999,"t":"呼吸我","s":"何嘉莉","c":"張敬軒"},{"y":1999,"t":"真心話","s":"何潤東","c":"潘協慶"},{"y":1999,"t":"理想結婚","s":"吳國敬","c":"吳國敬"},{"y":1999,"t":"帶你看風景","s":"吳國敬","c":"吳國敬"},{"y":1999,"t":"記得不記得","s":"呂方","c":"陳佳明"},{"y":1999,"t":"枉作小人","s":"杜德偉","c":"S.Munk/P.Lange","r":"外"},{"y":1999,"t":"陪我談戀愛","s":"車婉婉","c":"黃尚偉"},{"y":1999,"t":"愛無所不能","s":"周華健","c":"周華健"},{"y":1999,"t":"痛苦過","s":"周華健、莫文蔚","c":"周華健"},{"y":1999,"t":"燃亮我","s":"容祖兒","c":"伍樂城"},{"y":1999,"t":"你著幾號鞋","s":"恭碩良","c":"恭碩良"},{"y":1999,"t":"早安晚安","s":"馬浚偉","c":"辛偉力"},{"y":1999,"t":"神經病","s":"陳小春","c":"黃貫中"},{"y":1999,"t":"快高長大","s":"陳奕迅","c":"蔡一智"},{"y":1999,"t":"幸福摩天輪","s":"陳奕迅","c":"郭偉亮"},{"y":1999,"t":"時光倒流二十年","s":"陳奕迅","c":"伍樂城"},{"y":1999,"t":"對你太在乎","s":"陳慧琳","c":"吳國敬"},{"y":1999,"t":"再見多謝","s":"陳慧琳","c":"雷頌德"},{"y":1999,"t":"快樂情人","s":"陳慧琳","c":"吳國敬"},{"y":1999,"t":"我不愛\"高柏飛\"","s":"陳慧琳","c":"Gary Chan"},{"y":1999,"t":"有沒有這個人","s":"陳慧琳","c":"李漢文"},{"y":1999,"t":"戀愛情色","s":"陳慧琳","c":"雷頌德"},{"y":1999,"t":"假天真","s":"陳慧琳","c":"謝霆鋒"},{"y":1999,"t":"長情","s":"陳慧嫻","c":"吳國敬"},{"y":1999,"t":"想算命","s":"陳慧嫻","c":"方樹樑"},{"y":1999,"t":"來夜方長","s":"陳潔儀、蘇永康","c":"黃丹儀"},{"y":1999,"t":"禮物","s":"陳曉東","c":"張佳添"},{"y":1999,"t":"一枝花","s":"彭羚","c":"郭偉亮"},{"y":1999,"t":"多謝芭比","s":"彭羚","c":"黎允文"},{"y":1999,"t":"賞味期限","s":"彭羚","c":"李迪文"},{"y":1999,"t":"睡到失眠","s":"彭羚","c":"梁翹柏"},{"y":1999,"t":"給我一段仁愛路","s":"彭羚","c":"郭偉亮"},{"y":1999,"t":"你是一首流行曲","s":"彭羚","c":"李迪文"},{"y":1999,"t":"心繼續跳","s":"彭羚","c":"郭偉亮"},{"y":1999,"t":"抬起我的頭來","s":"楊千嬅","c":"陳輝陽"},{"y":1999,"t":"搭正一點","s":"楊千嬅","c":"陳珊妮"},{"y":1999,"t":"幹甚麼","s":"楊千嬅","c":"伍樂城"},{"y":1999,"t":"冰點","s":"楊千嬅","c":"于逸堯"},{"y":1999,"t":"木偶奇遇記","s":"楊千嬅","c":"黃丹儀"},{"y":1999,"t":"私人料理","s":"楊千嬅","c":"郭偉亮"},{"y":1999,"t":"私奔","s":"楊千嬅","c":"陳輝陽"},{"y":1999,"t":"最後的歌","s":"楊千嬅","c":"陳輝陽"},{"y":1999,"t":"天天都是艷陽天","s":"群星","c":"雷頌德"},{"y":1999,"t":"Dreaming I was Dreaming（夢樂園）","s":"葉佩雯","c":"cozy kubo","r":"日"},{"y":1999,"t":"學習","s":"雷頌德","c":"雷頌德"},{"y":1999,"t":"眼福","s":"趙學而","c":"深白色"},{"y":1999,"t":"請你留步","s":"馬浚偉","c":"徐日勤"},{"y":1999,"t":"雨一直下（粵）","s":"張宇","c":"張宇"},{"y":1999,"t":"目的地","s":"張栢芝","c":"倫永亮/辛偉力"},{"y":1999,"t":"男人這東西","s":"張栢芝、高雪嵐","c":"吳國敬"},{"y":1999,"t":"永遠記得","s":"張國榮","c":"盧冠廷"},{"y":1999,"t":"夢死醉生","s":"張國榮","c":"江志仁"},{"y":1999,"t":"左右手","s":"張國榮","c":"葉良俊"},{"y":1999,"t":"寂寞有害","s":"張國榮","c":"張國榮"},{"y":1999,"t":"小明星","s":"張國榮","c":"張國榮"},{"y":1999,"t":"同道中人","s":"張國榮","c":"江志仁"},{"y":1999,"t":"不要愛他","s":"張國榮","c":"陳偉文"},{"y":1999,"t":"陪你倒數","s":"張國榮","c":"江志仁"},{"y":1999,"t":"無味關懷","s":"張智霖","c":"羅尚正"},{"y":1999,"t":"熱氣球","s":"梁漢文","c":"梁漢文"},{"y":1999,"t":"人間失格","s":"梁漢文","c":"柳重言"},{"y":1999,"t":"一夜之間","s":"梁漢文","c":"Chinese"},{"y":1999,"t":"現在就愛我","s":"梁漢文","c":"周博賢"},{"y":1999,"t":"電話謀殺案","s":"梅艷芳","c":"劉祖德"},{"y":1999,"t":"無名氏","s":"梅艷芳","c":"黃丹儀"},{"y":1999,"t":"感情包袱","s":"梅艷芳","c":"林子健"},{"y":1999,"t":"回家","s":"莫文蔚","c":"于逸堯"},{"y":1999,"t":"不想你","s":"許志安","c":"林子揚"},{"y":1999,"t":"如何可以不愛她","s":"許志安","c":"雷頌德"},{"y":1999,"t":"世紀末煙花","s":"許志安","c":"雷頌德"},{"y":1999,"t":"相信愛","s":"許志安","c":"雷頌德"},{"y":1999,"t":"這樣享受戀愛","s":"許志安","c":"顧嘉煇/雷頌德"},{"y":1999,"t":"教我如何不愛他","s":"許志安、葉德嫻","c":"雷頌德"},{"y":1999,"t":"意氣用事","s":"趙學而","c":"林夕"},{"y":1999,"t":"新好情人","s":"劉德華","c":"林子揚"},{"y":1999,"t":"費解","s":"劉德華","c":"李泉"},{"y":1999,"t":"一人一步","s":"劉德華","c":"雷剛"},{"y":1999,"t":"值得等","s":"鄭伊健","c":"陳光榮"},{"y":1999,"t":"天煞孤星","s":"鄭伊健","c":"陳光榮"},{"y":1999,"t":"花正好","s":"鄭伊健","c":"陳光榮"},{"y":1999,"t":"天涯海角","s":"鄭伊健","c":"陳光榮"},{"y":1999,"t":"感動害人","s":"鄭伊健","c":"謝霆鋒"},{"y":1999,"t":"之後","s":"鄭伊健","c":"雷頌德"},{"y":1999,"t":"讓我開心","s":"鄭伊健","c":"陳光榮"},{"y":1999,"t":"寵物","s":"鄭秀文","c":"黃尚偉、吳國敬"},{"y":1999,"t":"兩個只能愛一個","s":"鄭秀文","c":"雷頌德"},{"y":1999,"t":"我愛花香不愛花","s":"黎明","c":"雷頌德"},{"y":1999,"t":"從今開始","s":"黎明","c":"雷頌德"},{"y":1999,"t":"Be My Girl","s":"黎明","c":"雷頌德"},{"y":1999,"t":"酸","s":"黎明","c":"雷頌德"},{"y":1999,"t":"眼睛想旅行","s":"黎明","c":"雷頌德"},{"y":1999,"t":"有空請愛我","s":"黎明","c":"雷頌德"},{"y":1999,"t":"You Are My Friend","s":"黎明","c":"雷頌德"},{"y":1999,"t":"新陳代謝","s":"盧巧音","c":"盧巧音"},{"y":1999,"t":"絲路","s":"盧巧音","c":"徐嘉兒（Daisy Chui）"},{"y":1999,"t":"小強","s":"謝霆鋒","c":"伍樂城"},{"y":1999,"t":"400 GIG","s":"謝霆鋒","c":"伍樂城"},{"y":1999,"t":"I believe","s":"謝霆鋒","c":"伍樂城"},{"y":1999,"t":"非走不可","s":"謝霆鋒","c":"伍樂城"},{"y":1999,"t":"第一眼","s":"謝霆鋒","c":"陳光榮"},{"y":1999,"t":"曝光","s":"謝霆鋒","c":"謝霆鋒"},{"y":1999,"t":"愛後餘生","s":"謝霆鋒","c":"伍樂城"},{"y":1999,"t":"不要說謊","s":"謝霆鋒","c":"HATAKE","r":"日"},{"y":1999,"t":"彈開","s":"謝霆鋒","c":"謝霆鋒"},{"y":1999,"t":"天知道","s":"蘇永康、譚耀文","c":"日本人"},{"y":2000,"t":"問題","s":"兩個女生","c":"楊孝芬"},{"y":2000,"t":"因為我高興","s":"B2","c":"黃尚偉"},{"y":2000,"t":"月亮忘記了","s":"丁菲飛","c":"丁菲飛"},{"y":2000,"t":"甜蜜世界","s":"丁菲飛","c":"丁菲飛"},{"y":2000,"t":"忘記月亮","s":"丁菲飛","c":"丁菲飛"},{"y":2000,"t":"每天愛你廿四小時","s":"王力宏","c":"王力宏"},{"y":2000,"t":"愛我的歌","s":"王力宏","c":"Uku","r":"外"},{"y":2000,"t":"飄流物語","s":"王傑","c":"Ruben Fernandez","r":"外"},{"y":2000,"t":"相見歡","s":"王傑","c":"舒文"},{"y":2000,"t":"給自己的情書","s":"王菲","c":"江志仁"},{"y":2000,"t":"男朋友","s":"古天樂","c":"伍樂城"},{"y":2000,"t":"像我這一種男人","s":"古天樂","c":"黃尚偉"},{"y":2000,"t":"我沒有女友","s":"古天樂","c":"伍樂城"},{"y":2000,"t":"今期流行","s":"古天樂","c":"伍樂城"},{"y":2000,"t":"新手戀愛","s":"古天樂","c":"伍樂城"},{"y":2000,"t":"杯麵","s":"古天樂","c":"伍樂城"},{"y":2000,"t":"放任天堂","s":"古天樂","c":"伍樂城"},{"y":2000,"t":"我是你的天秤","s":"古天樂","c":"藝琛"},{"y":2000,"t":"一眼驚喜","s":"古天樂、李彩樺","c":"林健華"},{"y":2000,"t":"萬語千言","s":"古天樂、楊千嬅","c":"周博賢"},{"y":2000,"t":"You & Me","s":"李玟","c":"Kate Holmes","r":"外"},{"y":2000,"t":"我最愛","s":"李彩樺","c":"王鋼"},{"y":2000,"t":"恨太空","s":"車婉婉","c":"梁基爵@人山人海"},{"y":2000,"t":"愈笑愈勇","s":"車婉婉","c":"車婉婉（Little Car）"},{"y":2000,"t":"星空無限","s":"郭富城、王菲","c":"Anton Morgon","r":"外"},{"y":2000,"t":"天上所有的星","s":"郭富城、王菲","c":"Anton Morgon","r":"外"},{"y":2000,"t":"妳好毒","s":"陳小春","c":"孫偉倫"},{"y":2000,"t":"撲火","s":"陳小春","c":"陳光榮"},{"y":2000,"t":"極愛自己","s":"陳冠希","c":"張國榮"},{"y":2000,"t":"欠了你的愛","s":"陳冠希","c":"張國榮"},{"y":2000,"t":"黑夜不再來","s":"陳奕迅","c":"陳輝陽"},{"y":2000,"t":"和平飯店","s":"陳奕迅","c":"雲超、D.Acconci","r":"混"},{"y":2000,"t":"當這地球沒有花","s":"陳奕迅","c":"郭偉亮"},{"y":2000,"t":"愛上你是我眼睛的錯","s":"陳奕迅","c":"柳重言"},{"y":2000,"t":"K歌之王","s":"陳奕迅","c":"陳輝陽"},{"y":2000,"t":"綿綿","s":"陳奕迅","c":"柳重言"},{"y":2000,"t":"你是誰","s":"陳慧珊","c":"張佑奇、黃永發"},{"y":2000,"t":"壞男人","s":"陳慧珊","c":"黃丹儀"},{"y":2000,"t":"固定伴侶","s":"陳慧珊、蘇永康","c":"黃尚偉"},{"y":2000,"t":"花花宇宙","s":"陳慧琳","c":"雷頌德"},{"y":2000,"t":"失憶周末","s":"陳慧琳","c":"雷頌德"},{"y":2000,"t":"大日子","s":"陳慧琳","c":"雷頌德"},{"y":2000,"t":"我沒有忘記","s":"陳慧琳","c":"吳國敬"},{"y":2000,"t":"一早想愛你","s":"陳慧琳","c":"陳匡榮"},{"y":2000,"t":"不如跳舞","s":"陳慧琳","c":"雷頌德"},{"y":2000,"t":"笑着睡","s":"陳慧琳","c":"黃丹儀"},{"y":2000,"t":"薰衣草","s":"陳慧琳","c":"伍樂城"},{"y":2000,"t":"早去早回","s":"陳潔儀","c":"梁文福"},{"y":2000,"t":"讓我愛下去","s":"陳潔儀","c":"許環良"},{"y":2000,"t":"寂寞便找我","s":"陳潔儀","c":"梁偉豐"},{"y":2000,"t":"激素","s":"陳曉東","c":"潘協慶"},{"y":2000,"t":"借借你肩膊","s":"陳曉東","c":"雷頌德"},{"y":2000,"t":"泡沫","s":"陳曉東","c":"伍樂城"},{"y":2000,"t":"甚麼都會變","s":"陳曉東","c":"伍樂城"},{"y":2000,"t":"花花世界","s":"周華健","c":"周華健"},{"y":2000,"t":"對不起謝謝你","s":"林憶蓮","c":"小柯"},{"y":2000,"t":"這一分鐘像我一樣","s":"胡諾言","c":"Zhong Shi Ying"},{"y":2000,"t":"何苦","s":"容祖兒","c":"伍樂城"},{"y":2000,"t":"誰來愛我","s":"容祖兒","c":"伍樂城"},{"y":2000,"t":"為你萬歲","s":"容祖兒","c":"伍樂城"},{"y":2000,"t":"美麗在望","s":"容祖兒","c":"Thomas Ahlstrand","r":"外"},{"y":2000,"t":"一人同遊","s":"張柏芝","c":"謝霆鋒"},{"y":2000,"t":"救生圈","s":"張柏芝","c":"方樹樑"},{"y":2000,"t":"路過蜻蜓","s":"張國榮","c":"陳曉娟"},{"y":2000,"t":"你這樣恨我","s":"張國榮","c":"陳偉文"},{"y":2000,"t":"我","s":"張國榮","c":"張國榮"},{"y":2000,"t":"大熱","s":"張國榮","c":"張國榮"},{"y":2000,"t":"侯斯頓之戀","s":"張國榮","c":"郭偉亮"},{"y":2000,"t":"身邊有人","s":"張國榮","c":"松本俊明","r":"日"},{"y":2000,"t":"奇蹟","s":"張國榮","c":"徐日勤"},{"y":2000,"t":"午後紅茶","s":"張國榮","c":"小林明子","r":"日"},{"y":2000,"t":"沒有愛","s":"張國榮","c":"Ahlstrand/Bertilsson/Broman","r":"外"},{"y":2000,"t":"沒有煙總有花","s":"張國榮","c":"陳偉文"},{"y":2000,"t":"十指緊扣","s":"張智霖","c":"馬永齡"},{"y":2000,"t":"誰說我哭","s":"張智霖","c":"林潤明"},{"y":2000,"t":"愛情已死","s":"張智霖","c":"伍樂城"},{"y":2000,"t":"愛不是一切","s":"陳曉東","c":"Mike Reid,Allen Shamblin","r":"外"},{"y":2000,"t":"珍惜眼淚","s":"陳曉東","c":"季忠平"},{"y":2000,"t":"情緒男女","s":"陳曉東","c":"品冠"},{"y":2000,"t":"幸福背影","s":"彭海桐","c":"屠穎"},{"y":2000,"t":"完美番梘","s":"彭海桐","c":"鄧建明"},{"y":2000,"t":"我不煩","s":"彭海桐","c":"鄧建明"},{"y":2000,"t":"天天都是禮拜天","s":"彭羚","c":"陳光榮"},{"y":2000,"t":"要多美麗有多美麗","s":"彭羚","c":"彭海桐"},{"y":2000,"t":"兒童樂園","s":"彭羚","c":"于逸堯/人山人海"},{"y":2000,"t":"手提巴黎","s":"彭羚","c":"郭偉亮"},{"y":2000,"t":"隔着枕頭對我說","s":"彭羚","c":"黃丹儀"},{"y":2000,"t":"新鮮人","s":"馮德倫","c":"馮德倫"},{"y":2000,"t":"漂流睡房","s":"黃耀明","c":"顧嘉輝/雷頌德"},{"y":2000,"t":"美麗在心頭","s":"黃耀明","c":"黃耀明/李端嫻"},{"y":2000,"t":"下一站天國","s":"黃耀明","c":"黃耀明、蔡德才"},{"y":2000,"t":"愛的教育","s":"黃耀明","c":"張亞東"},{"y":2000,"t":"光天化日","s":"黃耀明","c":"黃耀明、Minimal"},{"y":2000,"t":"少女的祈禱","s":"楊千嬅","c":"陳輝陽"},{"y":2000,"t":"如果東京不快樂","s":"楊千嬅","c":"陳小霞"},{"y":2000,"t":"放煙花","s":"楊千嬅","c":"四方果"},{"y":2000,"t":"情有可原","s":"葉佩雯","c":"伍樂城"},{"y":2000,"t":"失戀2000","s":"漢洋","c":"郭熾賢"},{"y":2000,"t":"我會愛你吧","s":"趙學而","c":"Toshihiko Takamizawa","r":"日"},{"y":2000,"t":"百分百好戲","s":"劉德華","c":"史丹利"},{"y":2000,"t":"只有你會當我聖誕樹","s":"劉德華","c":"史丹利"},{"y":2000,"t":"缺陷美","s":"劉德華","c":"羅文裕"},{"y":2000,"t":"愛情歲月","s":"鄭伊健","c":"陳光榮"},{"y":2000,"t":"爸爸的汽水","s":"鄭伊健","c":"鍾定一"},{"y":2000,"t":"失意忘形","s":"張智霖","c":"梁基爵"},{"y":2000,"t":"戒掉命運","s":"張智霖","c":"鄧建明/黃仲賢"},{"y":2000,"t":"我最後一個離開","s":"張智霖","c":"鄧建明/黃仲賢"},{"y":2000,"t":"你愛我像誰","s":"張衛健","c":"陳德建"},{"y":2000,"t":"這是我的愛","s":"張衛健","c":"陳德建"},{"y":2000,"t":"一生一火花","s":"張學友","c":"伍樂城"},{"y":2000,"t":"捉迷藏","s":"張學友","c":"張學友"},{"y":2000,"t":"好不好","s":"梁詠琪","c":"黃丹儀"},{"y":2000,"t":"世界萬歲","s":"梁詠琪","c":"Yamaha Music Entertainment (Far East) Ltd.","r":"日"},{"y":2000,"t":"至死不遇","s":"梁詠琪","c":"雷頌德"},{"y":2000,"t":"神仙魚","s":"梁詠琪","c":"黃丹儀"},{"y":2000,"t":"最後晚餐","s":"梁詠琪","c":"伍樂城"},{"y":2000,"t":"瀛寰搜奇","s":"梁漢文","c":"謝霆鋒"},{"y":2000,"t":"童夢失魂夜","s":"梅艷芳","c":"吳國敬"},{"y":2000,"t":"同聲一哭","s":"梅艷芳、陳奕迅","c":"陳奕迅"},{"y":2000,"t":"吸煙不吸煙","s":"莫文蔚","c":"吳通明"},{"y":2000,"t":"寂寞成雙","s":"許志安","c":"雷頌德"},{"y":2000,"t":"沒有戀愛的日子","s":"許志安","c":"陳小霞/姚若龍"},{"y":2000,"t":"一千次日落","s":"許志安","c":"黃丹儀"},{"y":2000,"t":"上次","s":"許志安","c":"林潤明"},{"y":2000,"t":"如果你是我","s":"許志安","c":"伍樂城"},{"y":2000,"t":"爵士搖擺","s":"許志安","c":"鄧建明"},{"y":2000,"t":"只會深愛你","s":"許志安","c":"雷頌德"},{"y":2000,"t":"借你耳朵說愛你","s":"許志安","c":"吳國敬"},{"y":2000,"t":"玫瑰不會忘記","s":"鄭伊健","c":"Ken Chan"},{"y":2000,"t":"感情線上","s":"鄭秀文","c":"黃嘉倩"},{"y":2000,"t":"不傷心","s":"鄭秀文","c":"張燕清"},{"y":2000,"t":"禁果花","s":"鄭秀文","c":"陳珊妮"},{"y":2000,"t":"蕭邦寫過的歌","s":"鄭秀文","c":"陳奕迅"},{"y":2000,"t":"Can't Take My Eyes Off U","s":"黎明","c":"Bob Crewe/Bob Gaudio","r":"外"},{"y":2000,"t":"全日愛","s":"黎明","c":"雷頌德"},{"y":2000,"t":"Mi-II","s":"黎明","c":"雷頌德"},{"y":2000,"t":"及時擁抱","s":"黎明","c":"雷頌德"},{"y":2000,"t":"一秒鐘兩個世界","s":"黎明","c":"雷頌德"},{"y":2000,"t":"愛天愛地","s":"黎明","c":"雷頌德"},{"y":2000,"t":"提提我","s":"黎明","c":"黎明"},{"y":2000,"t":"聽身體唱歌","s":"黎明","c":"雷頌德"},{"y":2000,"t":"呼吸不說謊","s":"黎明","c":"雷頌德"},{"y":2000,"t":"愛比我重要","s":"黎明","c":"Cho Kyu Man","r":"韓"},{"y":2000,"t":"白光","s":"盧巧音","c":"盧巧音"},{"y":2000,"t":"黃月亮","s":"盧巧音","c":"黃韻玲"},{"y":2000,"t":"日有所思","s":"盧巧音","c":"謝霆鋒"},{"y":2000,"t":"一了百了","s":"謝霆鋒","c":"伍樂城"},{"y":2000,"t":"一廂情願","s":"謝霆鋒","c":"伍樂城"},{"y":2000,"t":"活着Viva","s":"謝霆鋒","c":"謝霆鋒"},{"y":2000,"t":"活着","s":"謝霆鋒","c":"謝霆鋒"},{"y":2000,"t":"遊樂場","s":"謝霆鋒","c":"謝霆鋒"},{"y":2000,"t":"讓我待你好","s":"羅嘉良","c":"李伯健"},{"y":2000,"t":"相安無事","s":"蘇永康","c":"楊劍威"},{"y":2000,"t":"愛我多一天","s":"蘇永康","c":"吳國敬"},{"y":2000,"t":"純","s":"蘇永康","c":"黃尚偉"},{"y":2000,"t":"兩個人一個世界","s":"蘇永康","c":"黃大煒"},{"y":2001,"t":"女校男生","s":"Twins","c":"伍樂城"},{"y":2001,"t":"戀愛大過天","s":"Twins","c":"伍樂城"},{"y":2001,"t":"和平日","s":"Twins","c":"伍樂城"},{"y":2001,"t":"購物天堂","s":"丁菲飛","c":"丁菲飛/張亞東"},{"y":2001,"t":"紅眼症","s":"丁菲飛","c":"蔡德才"},{"y":2001,"t":"隨傳隨到","s":"方力申","c":"雷頌德"},{"y":2001,"t":"一周年","s":"方力申","c":"于逸堯、人山人海"},{"y":2001,"t":"比你更好","s":"王力宏","c":"王力宏"},{"y":2001,"t":"有種愛","s":"王秀琳","c":"陳歷恆"},{"y":2001,"t":"有種愛（劇場版）","s":"王秀琳","c":"陳歷恆"},{"y":2001,"t":"迷魂記","s":"王菲","c":"謝霆鋒"},{"y":2001,"t":"不眠飛行","s":"王菲","c":"郭偉亮（Ric Kwow）"},{"y":2001,"t":"隨便你點","s":"古天樂","c":"柳重言"},{"y":2001,"t":"天命最高","s":"古天樂","c":"趙增熹"},{"y":2001,"t":"幽媾之往生","s":"有耳非文","c":"梁基爵"},{"y":2001,"t":"我有沒有問題","s":"何韻詩","c":"英師傅"},{"y":2001,"t":"理想年代","s":"吳國敬","c":"神童/孫偉明/吳國敬"},{"y":2001,"t":"分手勿語","s":"李彩樺","c":"伍樂城"},{"y":2001,"t":"男生的短髮","s":"李彩樺","c":"K.L.Wong/Freddie N.T.Cheng"},{"y":2001,"t":"慾望之城","s":"李蕙敏","c":"呂紹淳"},{"y":2001,"t":"發言人","s":"杜德偉","c":"林一峯/林二汶"},{"y":2001,"t":"我的心在跳舞","s":"林憶蓮","c":"Ravn Ebbe","r":"外"},{"y":2001,"t":"精神戀愛","s":"容祖兒","c":"江志仁"},{"y":2001,"t":"我們都寂寞","s":"容祖兒","c":"伍樂城"},{"y":2001,"t":"告解","s":"容祖兒","c":"謝霆鋒"},{"y":2001,"t":"三個人的舞會","s":"陳冠希、Twins","c":"Jun-young Choi","r":"韓"},{"y":2001,"t":"Shall We Talk","s":"陳奕迅","c":"陳輝陽"},{"y":2001,"t":"失戀太少","s":"陳奕迅","c":"陳輝陽"},{"y":2001,"t":"天使的禮物","s":"陳奕迅","c":"陳輝陽"},{"y":2001,"t":"怪物","s":"陳奕迅","c":"陳奕迅"},{"y":2001,"t":"孤獨探戈","s":"陳奕迅","c":"陳輝陽"},{"y":2001,"t":"信心花舍","s":"陳奕迅","c":"鍾定一"},{"y":2001,"t":"黑暗中漫舞","s":"陳奕迅","c":"陳小霞"},{"y":2001,"t":"放過你","s":"陳奕迅、容祖兒","c":"陳奕迅"},{"y":2001,"t":"我還記得我是誰","s":"陳慧珊","c":"中崎英也","r":"日"},{"y":2001,"t":"模範生","s":"陳慧珊","c":"伍樂城"},{"y":2001,"t":"充滿你","s":"陳慧琳","c":"雷頌德"},{"y":2001,"t":"個人指數","s":"陳慧琳","c":"伍樂城"},{"y":2001,"t":"最愛演唱會","s":"陳慧琳","c":"伍樂城"},{"y":2001,"t":"笑着說再會","s":"陳曉東","c":"董修銘"},{"y":2001,"t":"我要的只是愛","s":"陳曉東","c":"Yoon","r":"韓"},{"y":2001,"t":"快門","s":"陳曉東","c":"張亞東"},{"y":2001,"t":"愛要怎麼說","s":"陳曉東","c":"Nick Vincet/Bob Mair","r":"外"},{"y":2001,"t":"不必說感謝","s":"陳曉東","c":"F. Morettini","r":"外"},{"y":2001,"t":"病人","s":"陳曉東","c":"伍樂城,陳曉東"},{"y":2001,"t":"一對人","s":"傅珮嘉","c":"林一峯"},{"y":2001,"t":"歌舞技樂園","s":"彭海桐","c":"柳重言"},{"y":2001,"t":"暗戀無罪","s":"彭羚","c":"陳光榮"},{"y":2001,"t":"縱裏尋他","s":"彭羚","c":"于逸堯"},{"y":2001,"t":"熱血青年","s":"楊千嬅","c":"雷頌德"},{"y":2001,"t":"姊妹","s":"楊千嬅","c":"江志仁"},{"y":2001,"t":"假如讓我說下去","s":"楊千嬅","c":"于逸堯"},{"y":2001,"t":"河童","s":"楊千嬅","c":"黃丹儀"},{"y":2001,"t":"瘦身大法","s":"容祖兒","c":"伍樂城"},{"y":2001,"t":"全身暑假","s":"容祖兒","c":"伍樂城"},{"y":2001,"t":"一個人砌圖","s":"容祖兒","c":"周博賢|陳哲廬"},{"y":2001,"t":"寂寞大道","s":"容祖兒","c":"陳輝陽"},{"y":2001,"t":"阿門","s":"容祖兒","c":"伍樂城"},{"y":2001,"t":"他狠過你","s":"容祖兒","c":"Shin Jae Hong、Yoon SaRah","r":"韓"},{"y":2001,"t":"What's Up","s":"容祖兒","c":"陳輝陽"},{"y":2001,"t":"命苦","s":"容祖兒","c":"陳輝陽/吳國恩"},{"y":2001,"t":"怯","s":"容祖兒","c":"陳輝陽"},{"y":2001,"t":"再見我的初戀","s":"容祖兒","c":"陳輝陽"},{"y":2001,"t":"走着睡","s":"容祖兒","c":"舒文"},{"y":2001,"t":"Sailing","s":"恭碩良","c":"恭碩良"},{"y":2001,"t":"好去處（總有些用處）","s":"恭碩良","c":"恭碩良"},{"y":2001,"t":"寂寞惹的禍","s":"張栢芝","c":"Terry Chan"},{"y":2001,"t":"夢到內河","s":"張國榮","c":"江志仁"},{"y":2001,"t":"潔身自愛","s":"張國榮","c":"陳曉娟"},{"y":2001,"t":"樓上來的聲音","s":"張學友","c":"藍奕邦"},{"y":2001,"t":"有病呻吟","s":"張學友","c":"林健華"},{"y":2001,"t":"天下第一流","s":"張學友","c":"Hyun Woo Choi/Jong Sin Yoon","r":"韓"},{"y":2001,"t":"聊天","s":"梁詠琪","c":"金城武"},{"y":2001,"t":"空中小姐","s":"梁詠琪","c":"林一峯"},{"y":2001,"t":"荷花","s":"梁詠琪","c":"郭偉亮"},{"y":2001,"t":"重新做人","s":"梁漢文","c":"梁漢文"},{"y":2001,"t":"咳出來","s":"梁漢文","c":"謝霆鋒"},{"y":2001,"t":"飛天吻","s":"梁漢文","c":"柳重言"},{"y":2001,"t":"特別鳴謝","s":"梁漢文","c":"梁漢文"},{"y":2001,"t":"散光","s":"莫文蔚","c":"伍佰"},{"y":2001,"t":"扇子舞","s":"莫文蔚","c":"伍佰"},{"y":2001,"t":"童年末日","s":"莫文蔚","c":"伍佰"},{"y":2001,"t":"幻聽","s":"莫文蔚","c":"伍佰"},{"y":2001,"t":"冬至","s":"莫文蔚","c":"伍佰"},{"y":2001,"t":"一朵金花","s":"莫文蔚","c":"伍佰"},{"y":2001,"t":"單手擁抱","s":"許志安","c":"陳輝陽@好好笑"},{"y":2001,"t":"時差","s":"許志安","c":"許志安"},{"y":2001,"t":"忘了你是誰","s":"許志安","c":"蔡德才@人山人海"},{"y":2001,"t":"拾荒蛋糕","s":"葉佩雯、謝霆鋒","c":"葉佩雯、郭偉亮"},{"y":2001,"t":"大團圓","s":"劉德華","c":"陳德建"},{"y":2001,"t":"愛君如夢","s":"劉德華、吳君如","c":"金培達"},{"y":2001,"t":"彈彈琴跳跳舞","s":"劉德華、梅艷芳","c":"陳德建/溫浩傑"},{"y":2001,"t":"太陽出來了","s":"鄭伊健","c":"陳光榮"},{"y":2001,"t":"要愛一個人","s":"鄭伊健","c":"增田武史","r":"日"},{"y":2001,"t":"永遠失去","s":"鄭伊健","c":"舒文"},{"y":2001,"t":"別說戀愛","s":"鄭伊健","c":"Peter Malmrup","r":"外"},{"y":2001,"t":"我明白","s":"鄭伊健","c":"潘協慶"},{"y":2001,"t":"夏桑菊","s":"鄭伊健","c":"林一峯"},{"y":2001,"t":"夜叉山上收狐狸","s":"鄭秀文","c":"黃英華"},{"y":2001,"t":"情無獨鍾","s":"鄭秀文","c":"黃英華"},{"y":2001,"t":"浩瀚沙場蒼生細","s":"鄭秀文","c":"黃英華"},{"y":2001,"t":"胡天胡帝狐狸精","s":"鄭秀文","c":"黃英華"},{"y":2001,"t":"如果一個女人","s":"鄭秀文","c":"黃英華"},{"y":2001,"t":"沙場生死兩茫茫","s":"鄭秀文","c":"黃英華"},{"y":2001,"t":"三個人一個約會","s":"鄭秀文","c":"陳珊妮"},{"y":2001,"t":"終身美麗","s":"鄭秀文","c":"陳輝陽"},{"y":2001,"t":"守望相愛","s":"鄭秀文","c":"陳輝陽"},{"y":2001,"t":"交換溫柔","s":"鄭秀文","c":"陳輝陽"},{"y":2001,"t":"你愛我愛不起","s":"鄭秀文","c":"柳重言"},{"y":2001,"t":"同年同月同日生","s":"鄭秀文","c":"陳珊妮"},{"y":2001,"t":"衛斯理之戀","s":"鄧健泓","c":"伍樂城"},{"y":2001,"t":"與你同行","s":"黎明","c":"雷頌德"},{"y":2001,"t":"指日可待","s":"黎明","c":"John Philips/Michelle Philips","r":"外"},{"y":2001,"t":"刀槍不入","s":"盧巧音","c":"石嘉欣"},{"y":2001,"t":"去你的婚禮","s":"盧巧音","c":"雷頌德"},{"y":2001,"t":"喜歡戀愛","s":"盧巧音","c":"陳輝陽"},{"y":2001,"t":"潛龍勿用","s":"謝霆鋒","c":"謝霆鋒"},{"y":2001,"t":"今天你生日","s":"謝霆鋒","c":"Sugizo","r":"日"},{"y":2001,"t":"玉蝴蝶","s":"謝霆鋒","c":"謝霆鋒"},{"y":2001,"t":"後遺","s":"謝霆鋒","c":"Sugizo","r":"日"},{"y":2001,"t":"讓愛","s":"許志安","c":"舒文"},{"y":2001,"t":"我怕我會愛上你","s":"許志安","c":"梁漢文"},{"y":2001,"t":"順路","s":"陳文媛","c":"江志仁"},{"y":2001,"t":"愛到底","s":"陳文媛","c":"張佳添"},{"y":2001,"t":"愛情最強","s":"陳司翰","c":"伍樂城"},{"y":2001,"t":"隱形人","s":"陳司翰","c":"李偉安"},{"y":2001,"t":"擺花街一號","s":"陳司翰","c":"柳重言"},{"y":2001,"t":"越來越愛你","s":"陳冠希","c":"柳重言"},{"y":2001,"t":"戀人勿近","s":"陳冠希","c":"伍樂城"},{"y":2001,"t":"啟示錄","s":"謝霆鋒","c":"謝霆鋒"},{"y":2001,"t":"你想要甚麼","s":"鍾兆康等","c":"吳國恩"},{"y":2001,"t":"背對背面對面","s":"鍾鎮濤","c":"鍾鎮濤"},{"y":2001,"t":"小城無眼淚","s":"蘇永康","c":"黃尚偉"},{"y":2001,"t":"忘記呼吸","s":"蘇永康","c":"黃丹儀"},{"y":2001,"t":"地球村","s":"蘇永康","c":"黃尚偉"},{"y":2002,"t":"青春變魔術","s":"E-kids","c":"EliaVitale","r":"外"},{"y":2002,"t":"魅力移動","s":"EO2、E-kids、張詠詩","c":"陳光榮"},{"y":2002,"t":"迷幻彩虹","s":"Shine","c":"丁偉斌（James Ting）"},{"y":2002,"t":"著睡衣跳舞","s":"Twins","c":"R. Malmberg/T. Johansson","r":"外"},{"y":2002,"t":"神奇兩女俠","s":"Twins","c":"伍樂城"},{"y":2002,"t":"我們的紀念冊","s":"Twins","c":"伍樂城"},{"y":2002,"t":"哥哥","s":"Twins","c":"伍樂城"},{"y":2002,"t":"眼紅紅","s":"Twins","c":"伍樂城"},{"y":2002,"t":"友誼第一","s":"Twins","c":"黃丹儀"},{"y":2002,"t":"沒法做足一百分","s":"Twins","c":"舒文"},{"y":2002,"t":"分飛燕","s":"Twins","c":"黃偉文"},{"y":2002,"t":"朋友仔","s":"Twins","c":"陳輝陽"},{"y":2002,"t":"Ichiban興奮","s":"Twins","c":"丁偉斌（James Ting）"},{"y":2002,"t":"魔法王國","s":"Twins","c":"伍樂城"},{"y":2002,"t":"大紅大紫","s":"Twins","c":"伍樂城"},{"y":2002,"t":"風箏與風","s":"Twins","c":"伍樂城"},{"y":2002,"t":"No.1","s":"Twins","c":"伍樂城"},{"y":2002,"t":"星星月亮太陽","s":"Twins","c":"伍樂城"},{"y":2002,"t":"How I Miss U","s":"方力申","c":"舒文"},{"y":2002,"t":"娛樂妳朋友","s":"方力申","c":"雷頌德"},{"y":2002,"t":"兩男一女","s":"方力申、陳曉東、李彩樺","c":"雷頌德"},{"y":2002,"t":"英雄","s":"王菲","c":"張亞東"},{"y":2002,"t":"天下無雙天啦地啦","s":"王菲、梁朝偉","c":"陳勳奇"},{"y":2002,"t":"不眠皇后","s":"何韻詩","c":"郭偉亮"},{"y":2002,"t":"愛情花","s":"何韻詩","c":"何韻詩"},{"y":2002,"t":"一家之主","s":"何韻詩","c":"翁厚樑"},{"y":2002,"t":"還你門匙","s":"余文樂","c":"伍樂城"},{"y":2002,"t":"我哋","s":"余文樂","c":"舒文"},{"y":2002,"t":"愛不釋手","s":"李克勤","c":"陳輝陽"},{"y":2002,"t":"夜遊杜拜","s":"李蘢怡","c":"柳重言"},{"y":2002,"t":"我有權投","s":"谷祖琳","c":"金培達"},{"y":2002,"t":"同機蜜友","s":"谷祖琳","c":"金培達"},{"y":2002,"t":"小菊","s":"谷祖琳","c":"盧凱彤（rose）"},{"y":2002,"t":"抱抱","s":"容祖兒","c":"陳輝陽"},{"y":2002,"t":"啜泣","s":"容祖兒","c":"舒文"},{"y":2002,"t":"戀愛神經","s":"陳慧琳","c":"雷頌德"},{"y":2002,"t":"夏天的緋聞","s":"陳慧琳","c":"雷頌德"},{"y":2002,"t":"無賴","s":"陳慧琳","c":"張佳添"},{"y":2002,"t":"好時光","s":"陳慧琳","c":"伍樂城"},{"y":2002,"t":"再生花","s":"陳慧琳","c":"Gary Chan"},{"y":2002,"t":"躲貓貓","s":"陳慧琳","c":"金亨錫","r":"韓"},{"y":2002,"t":"千手千尋","s":"陳慧琳","c":"雷頌德"},{"y":2002,"t":"巨人","s":"陳慧琳","c":"雷頌德"},{"y":2002,"t":"娛樂無窮","s":"陳曉東","c":"張亞東"},{"y":2002,"t":"去街","s":"陳曉東","c":"張亞東"},{"y":2002,"t":"迷你","s":"陳曉東","c":"張亞東"},{"y":2002,"t":"武林中人","s":"陳曉東","c":"謝傑/呂為光"},{"y":2002,"t":"I Want To Be","s":"陳曉東","c":"陳曉東"},{"y":2002,"t":"大風吹","s":"麥浚龍","c":"伍樂城"},{"y":2002,"t":"習慣孤獨","s":"麥浚龍","c":""},{"y":2002,"t":"鬧劇","s":"黃伊汶","c":"伍樂城"},{"y":2002,"t":"夜有所夢","s":"黃耀明、張國榮","c":"黃耀明/李端嫻@人山人海"},{"y":2002,"t":"楊千嬅","s":"楊千嬅","c":"郭偉亮"},{"y":2002,"t":"香港小姐","s":"楊千嬅","c":"于逸堯"},{"y":2002,"t":"閃靈","s":"楊千嬅","c":"伍樂城"},{"y":2002,"t":"友誼小姐","s":"楊千嬅","c":"蔡德才"},{"y":2002,"t":"塔羅迷","s":"楊千嬅","c":"雷頌德"},{"y":2002,"t":"滿漢全席","s":"楊千嬅","c":"伍樂城"},{"y":2002,"t":"慳D","s":"楊千嬅","c":"伍樂城"},{"y":2002,"t":"向左走","s":"楊千嬅","c":"雷頌德"},{"y":2002,"t":"向左走向右走","s":"楊千嬅","c":"雷頌德"},{"y":2002,"t":"向右走","s":"楊千嬅","c":"雷頌德"},{"y":2002,"t":"一千零一個","s":"楊千嬅","c":"陳韻如"},{"y":2002,"t":"拍拖","s":"容祖兒","c":"伍樂城"},{"y":2002,"t":"爭氣","s":"容祖兒","c":"陳輝陽"},{"y":2002,"t":"特別嘉賓","s":"容祖兒","c":"鍾定一"},{"y":2002,"t":"信徒","s":"張衛健","c":"陳德健"},{"y":2002,"t":"至情至聖","s":"張衛健","c":"陳德健"},{"y":2002,"t":"禮物","s":"張學友","c":"Kim Ki Bum、Shim Hynn Bo","r":"韓"},{"y":2002,"t":"我得你","s":"張學友","c":"郭偉亮"},{"y":2002,"t":"無間道","s":"梁朝偉、劉德華","c":"伍樂城"},{"y":2002,"t":"蕩失","s":"梁詠琪","c":"謝傑"},{"y":2002,"t":"人間之最","s":"梁詠琪","c":"伍仲衡"},{"y":2002,"t":"花生騷","s":"梅艷芳、王菲","c":"Terry Chan"},{"y":2002,"t":"相愛很難","s":"梅艷芳、張學友","c":"陳輝陽"},{"y":2002,"t":"兩粒糖","s":"梅艷芳、蘇永康","c":"林毅心/羅健明"},{"y":2002,"t":"孤家寡人","s":"許志安","c":"張佳添"},{"y":2002,"t":"罪人","s":"許志安","c":"郭偉亮"},{"y":2002,"t":"女人之苦","s":"許志安","c":"陳輝陽"},{"y":2002,"t":"天下之大","s":"許志安","c":"郭偉亮"},{"y":2002,"t":"活在當下","s":"許志安","c":"舒文"},{"y":2002,"t":"搖籃","s":"許志安","c":"吳國敬"},{"y":2002,"t":"天橋","s":"陳文媛","c":"柳重言"},{"y":2002,"t":"放過我","s":"陳文媛","c":"伍樂城"},{"y":2002,"t":"一流","s":"陳文媛","c":"伍樂城"},{"y":2002,"t":"不用結婚","s":"陳文媛","c":"郭偉亮"},{"y":2002,"t":"時光中飛舞","s":"陳文媛、李蘢怡","c":"唐奕聰"},{"y":2002,"t":"脫胎換骨","s":"陳司翰","c":"Hiro"},{"y":2002,"t":"愛在他們的天空","s":"陳司翰","c":"李偲菘"},{"y":2002,"t":"教堂","s":"陳司翰","c":"陳偉"},{"y":2002,"t":"你快樂嗎","s":"陳冠希","c":"伍樂城"},{"y":2002,"t":"有幾壞","s":"陳冠希Feat.鍾欣桐、陳奐仁","c":"陳奐仁"},{"y":2002,"t":"笑中有淚","s":"楊千嬅","c":"于逸堯"},{"y":2002,"t":"音樂盒","s":"楊千嬅","c":"梁翹柏"},{"y":2002,"t":"傷逝","s":"葉蒨文","c":"郭偉亮"},{"y":2002,"t":"堅強","s":"葉蒨文","c":"雲超"},{"y":2002,"t":"渡假","s":"葉蒨文","c":"梁基爵"},{"y":2002,"t":"天生天養","s":"劉德華","c":"陳忠義"},{"y":2002,"t":"人生捕手","s":"劉德華","c":"黃嘉倩"},{"y":2002,"t":"大勝無限番","s":"劉德華","c":"黃霑"},{"y":2002,"t":"活得精彩","s":"劉德華","c":"黃貫中"},{"y":2002,"t":"寵物男孩","s":"蔣雅文","c":"徐嘉儀"},{"y":2002,"t":"淘浪","s":"鄭中基","c":"翁昌新"},{"y":2002,"t":"準情人的關懷","s":"鄭希怡","c":"舒文"},{"y":2002,"t":"愛上一個人","s":"鄭秀文","c":"黃嘉倩"},{"y":2002,"t":"過山車","s":"鄭秀文","c":"黃嘉倩"},{"y":2002,"t":"回來我身邊","s":"鄭秀文","c":"陳輝陽"},{"y":2002,"t":"忘記不起","s":"鄭秀文","c":"陳輝虹（Keith Chan）"},{"y":2002,"t":"心肝命掟","s":"鄭秀文","c":"陳輝陽@好好笑"},{"y":2002,"t":"上一次流淚","s":"鄭秀文","c":"陳輝陽@好好笑"},{"y":2002,"t":"第二次分手","s":"鄭秀文","c":"范曉萱/陳輝陽"},{"y":2002,"t":"謝謝王子","s":"鄭秀文","c":"陳輝虹（Keith Chan）@Hao Hao Xiao"},{"y":2002,"t":"更加愛你","s":"鄭秀文","c":"柳重言"},{"y":2002,"t":"你的前半生","s":"鄭秀文","c":"陳小霞"},{"y":2002,"t":"輸得漂亮","s":"鄭秀文","c":"金培達"},{"y":2002,"t":"大男孩","s":"鄧健泓","c":"馮翰銘"},{"y":2002,"t":"心寒","s":"鄧健泓","c":"伍樂城"},{"y":2002,"t":"風高勿燥","s":"鄧健泓","c":"鄧建明/雷有輝"},{"y":2002,"t":"戇男","s":"鄧健泓","c":"伍樂城"},{"y":2002,"t":"豬骨湯麵","s":"鄧健泓","c":"郭偉亮"},{"y":2002,"t":"好","s":"鄧健泓","c":"林潤明"},{"y":2002,"t":"心寒","s":"鄧健泓、鄭中基","c":"伍樂城"},{"y":2002,"t":"你要懂得欺騙自己","s":"黎明","c":"雷頌德"},{"y":2002,"t":"Ba Ba","s":"黎明","c":"雷頌德"},{"y":2002,"t":"一巴香水印","s":"黎明","c":"雷頌德"},{"y":2002,"t":"咪亂諗","s":"黎明","c":"雷頌德"},{"y":2002,"t":"最好你走","s":"黎明","c":"雷頌德"},{"y":2002,"t":"別怕生疏","s":"黎明","c":"雷頌德"},{"y":2002,"t":"我從一個人","s":"黎瑞恩","c":"Shin In Soo、Yoo Yoo Jin","r":"韓"},{"y":2002,"t":"Special Thanks To 1","s":"陳奕迅","c":"符致逸（Foo Hsien Yang）"},{"y":2002,"t":"Special Thanks To 2","s":"陳奕迅","c":"符致逸（Foo Hsien Yang）"},{"y":2002,"t":"人造衛星","s":"陳奕迅","c":"Hugesen D、Christensen B","r":"外"},{"y":2002,"t":"Special Thanks To 3","s":"陳奕迅","c":"符致逸（Foo Hsien Yang）"},{"y":2002,"t":"給愛麗斯","s":"陳奕迅","c":"陳輝陽/貝多芬"},{"y":2002,"t":"心裏有鬼","s":"陳奕迅","c":"陳輝陽"},{"y":2002,"t":"我有我愛你","s":"陳奕迅","c":"陳輝陽"},{"y":2002,"t":"明年今日","s":"陳奕迅","c":"陳小霞"},{"y":2002,"t":"人來人往","s":"陳奕迅","c":"陳輝陽"},{"y":2002,"t":"季軍","s":"陳奕迅","c":"張佳添"},{"y":2002,"t":"好心害了你","s":"陳慧琳","c":"吳國敬"},{"y":2002,"t":"疾走羅拉","s":"陳慧琳","c":"舒文"},{"y":2002,"t":"天蠍號","s":"盧巧音","c":"盧巧音"},{"y":2002,"t":"心領","s":"戴辛尉","c":"吳國敬"},{"y":2002,"t":"荒原","s":"戴辛尉","c":"馬永齡"},{"y":2002,"t":"一毫子","s":"謝霆鋒","c":"蔡健雅"},{"y":2002,"t":"白衣天使","s":"謝霆鋒","c":"謝霆鋒"},{"y":2002,"t":"完美啟示錄","s":"謝霆鋒","c":"謝霆鋒"},{"y":2002,"t":"冥想","s":"謝霆鋒","c":"謝霆鋒"},{"y":2002,"t":"從前、以後","s":"謝霆鋒","c":"謝霆鋒"},{"y":2002,"t":"浮生花園","s":"關心妍","c":"杜自持"},{"y":2002,"t":"你有心","s":"關心妍","c":"陳輝陽"},{"y":2002,"t":"怎麼會愛上這個人","s":"關心妍","c":"Shin Jae Hong","r":"韓"},{"y":2002,"t":"住家甜品","s":"蘇永康","c":"Where To Find Love","r":"外"},{"y":2002,"t":"我發誓以後","s":"蘇永康","c":"林潤明"},{"y":2002,"t":"搏擊會","s":"蘇永康","c":"吳國敬"},{"y":2002,"t":"問你怕未","s":"蘇永康","c":"馮翰銘"},{"y":2002,"t":"眾望所歸","s":"蘇永康","c":"黃尚偉"},{"y":2003,"t":"好勝","s":"2R","c":"伍樂城"},{"y":2003,"t":"雙打","s":"Boy'z","c":"伍樂城"},{"y":2003,"t":"La La世界","s":"Boy'z","c":"郭偉亮/Sam Koki/Lee~io~Hoku","r":"混"},{"y":2003,"t":"兩個滑板的少年","s":"Boy'z","c":"鍾橋韜"},{"y":2003,"t":"總有一站愛上你","s":"Boy'z","c":"伍樂城"},{"y":2003,"t":"口袋情人","s":"Sky","c":"伍樂城"},{"y":2003,"t":"未捱過","s":"Sky","c":"謝國維"},{"y":2003,"t":"我們要睡覺","s":"Twins","c":"伍樂城"},{"y":2003,"t":"講玩","s":"Twins","c":"伍樂城"},{"y":2003,"t":"童子軍","s":"Twins","c":"伍樂城"},{"y":2003,"t":"亂世佳人","s":"Twins","c":"伍樂城"},{"y":2003,"t":"慌心假期","s":"Twins","c":"伍樂城"},{"y":2003,"t":"夏日狂嘩","s":"Twins","c":"伍樂城"},{"y":2003,"t":"香港紐約","s":"Twins","c":"馮翰銘"},{"y":2003,"t":"三角圓舞","s":"Twins","c":"黃丹儀"},{"y":2003,"t":"變變變","s":"Twins、成龍","c":"陳光榮"},{"y":2003,"t":"MV","s":"王菲","c":"謝霆鋒"},{"y":2003,"t":"假愛之名","s":"王菲","c":"王菲"},{"y":2003,"t":"花事了","s":"王菲","c":"Sophine Zelmani/Lars Halapi","r":"外"},{"y":2003,"t":"寬恕","s":"王菲","c":"趙季平"},{"y":2003,"t":"吻得到愛不到","s":"古天樂","c":"伍樂城"},{"y":2003,"t":"必殺技","s":"古巨基","c":"林健華"},{"y":2003,"t":"愛神","s":"古巨基","c":"雷頌德"},{"y":2003,"t":"悟空","s":"古巨基","c":"陶喆"},{"y":2003,"t":"決戰十一","s":"古巨基","c":"側田"},{"y":2003,"t":"任天堂流淚","s":"古巨基","c":"李漢文"},{"y":2003,"t":"美少女夢工場之真三國無雙","s":"古巨基","c":"雷頌德"},{"y":2003,"t":"Forward Your Love","s":"古巨基","c":"張繼聰,林健華"},{"y":2003,"t":"心跳回憶","s":"古巨基","c":"陳輝陽"},{"y":2003,"t":"赤川次郎夜想曲","s":"古巨基","c":"陳輝陽"},{"y":2003,"t":"談情做愛","s":"朱茵","c":"陳輝陽"},{"y":2003,"t":"忘","s":"何韻詩","c":"雷頌德"},{"y":2003,"t":"錯愛的呼喚","s":"郭富城","c":"丁偉斌（James Ting）"},{"y":2003,"t":"誓不再會","s":"郭富城","c":"金培達"},{"y":2003,"t":"獻世","s":"陳小春","c":"周杰倫"},{"y":2003,"t":"之前、之後","s":"陳文媛","c":"黎澤發"},{"y":2003,"t":"快樂完","s":"陳文媛","c":"陳光榮"},{"y":2003,"t":"要你的","s":"陳奕迅","c":"林一峯、李騰機"},{"y":2003,"t":"猜情尋","s":"陳奕迅","c":"吳國敬、孫偉明"},{"y":2003,"t":"New Order","s":"陳奕迅","c":"郭偉亮"},{"y":2003,"t":"Shake Shake","s":"陳慧琳","c":"雷頌德"},{"y":2003,"t":"心服口服","s":"陳慧琳","c":"周傳雄"},{"y":2003,"t":"臨走前吻我","s":"陳慧琳","c":"雷頌德"},{"y":2003,"t":"伶仃","s":"陳慧琳","c":"JOON YOUNG CHOI|GI HUN LIM|JK LEE","r":"韓"},{"y":2003,"t":"明日有明天","s":"陳慧嫻","c":"陳輝陽@好好笑"},{"y":2003,"t":"柯德莉夏萍穿過的鞋","s":"陳慧嫻","c":"金培達"},{"y":2003,"t":"情意結","s":"陳慧嫻","c":"陳輝陽"},{"y":2003,"t":"蕭邦與我","s":"陳慧嫻","c":"陳輝陽"},{"y":2003,"t":"Gloomy Sunday","s":"陳慧嫻","c":"Sam M Lewis/Rezso Seress/Laszlo Javor","r":"外"},{"y":2003,"t":"把悲傷看透時","s":"陳慧嫻","c":"陳輝陽"},{"y":2003,"t":"傻女的新衣","s":"陳慧嫻","c":"M.T.Diego/M.L.Diego","r":"外"},{"y":2003,"t":"拈花惹草","s":"陳慧嫻、關心妍","c":"陳輝陽/陳錦鏢"},{"y":2003,"t":"珠光寶氣","s":"陳寶珠","c":"倫永亮"},{"y":2003,"t":"萬勿流淚","s":"黃伊汶","c":"伍樂城"},{"y":2003,"t":"易愛難收","s":"黃凱芹","c":"伍樂城"},{"y":2003,"t":"窮風流","s":"黃耀明","c":"黃耀明、李端嫻"},{"y":2003,"t":"兩位一體","s":"何韻詩","c":"馮翰銘"},{"y":2003,"t":"元神出竅","s":"何韻詩","c":"蔡一智"},{"y":2003,"t":"出生入死","s":"何韻詩","c":"張藝松"},{"y":2003,"t":"合久必婚？","s":"李克勤","c":"伍樂城"},{"y":2003,"t":"今天最愛","s":"李克勤","c":"陳輝陽@好好笑"},{"y":2003,"t":"合久必婚？","s":"李克勤、陳苑淇","c":"伍樂城"},{"y":2003,"t":"愛一個人","s":"李克勤、陳慧琳","c":"陳輝陽"},{"y":2003,"t":"老友記","s":"李克勤、譚詠麟","c":"伍樂城"},{"y":2003,"t":"假如愛有天意","s":"谷祖琳","c":"劉泳碩"},{"y":2003,"t":"戀之風景","s":"林嘉欣","c":"伍樂城"},{"y":2003,"t":"忘記傷害","s":"林峯","c":"馮翰銘"},{"y":2003,"t":"第幾次愛你","s":"柳重言","c":"金培達"},{"y":2003,"t":"世代無肝炎","s":"英皇群星","c":"世代無肝炎 英皇群星"},{"y":2003,"t":"習慣失戀","s":"容祖兒","c":"舒文"},{"y":2003,"t":"與貓共舞","s":"容祖兒","c":"黃丹儀"},{"y":2003,"t":"最後一課","s":"容祖兒","c":"王雙駿"},{"y":2003,"t":"想得太遠","s":"容祖兒","c":"陳輝陽"},{"y":2003,"t":"出賣","s":"容祖兒","c":"徐繼宗"},{"y":2003,"t":"歌姬","s":"容祖兒","c":"許創基"},{"y":2003,"t":"心甘命抵","s":"容祖兒","c":"黃丹儀"},{"y":2003,"t":"勉強幸福","s":"容祖兒","c":"舒文"},{"y":2003,"t":"我也不想這樣","s":"容祖兒","c":"陳輝陽"},{"y":2003,"t":"他都不愛我","s":"容祖兒、吳浩康","c":"周初晨/彭海桐"},{"y":2003,"t":"千嬌百美","s":"張國榮","c":"江志仁"},{"y":2003,"t":"玻璃之情","s":"張國榮","c":"張國榮"},{"y":2003,"t":"隨心","s":"張國榮","c":"陳匡榮"},{"y":2003,"t":"蝶變","s":"張國榮","c":"唐奕聰"},{"y":2003,"t":"冤家","s":"張國榮","c":"柳重言"},{"y":2003,"t":"好情人","s":"張智霖","c":"歐陽業俊"},{"y":2003,"t":"兩個人的幸運","s":"梁詠琪","c":"金培達"},{"y":2003,"t":"迴旋木馬的終端","s":"梁詠琪","c":"林一峯"},{"y":2003,"t":"向左走向右走","s":"梁詠琪","c":"金培達"},{"y":2003,"t":"攞命舞","s":"黃耀明","c":"梁基爵"},{"y":2003,"t":"明日天涯","s":"黃耀明","c":"梁基爵"},{"y":2003,"t":"身外情","s":"黃耀明","c":"梁基爵"},{"y":2003,"t":"帶不走","s":"黃耀明","c":"梁基爵@人山人海"},{"y":2003,"t":"忘不了","s":"黃耀明","c":""},{"y":2003,"t":"賣花女神","s":"黃馨","c":"Sarah ,Tere","r":"外"},{"y":2003,"t":"Wendy, Sandy and Judi","s":"黃馨","c":"劉以達"},{"y":2003,"t":"我一個人睡","s":"黃馨","c":"唐奕聰"},{"y":2003,"t":"飛女正傳","s":"楊千嬅","c":"蔡德才"},{"y":2003,"t":"民間傳奇","s":"楊千嬅","c":"郭偉亮"},{"y":2003,"t":"藍與黑","s":"楊千嬅","c":"陳綺貞"},{"y":2003,"t":"滿場飛","s":"楊千嬅","c":"Shin Dong-Woo","r":"韓"},{"y":2003,"t":"小星星","s":"楊千嬅","c":"陳輝陽@好好笑"},{"y":2003,"t":"星之碎片","s":"楊千嬅、梁朝偉","c":"伍樂城"},{"y":2003,"t":"迷宮","s":"楊千嬅、梁朝偉","c":"伍樂城"},{"y":2003,"t":"愛在陽光下","s":"群星","c":"金培達"},{"y":2003,"t":"只有一次","s":"葉蒨文","c":"楊君亮"},{"y":2003,"t":"高雅而憂傷的圓舞曲","s":"綠咖啡","c":"陳輝陽"},{"y":2003,"t":"大小孩","s":"劉德華","c":"張簡君偉"},{"y":2003,"t":"有種","s":"鄭中基","c":"陳輝陽"},{"y":2003,"t":"超人","s":"鄭中基","c":"陳輝陽"},{"y":2003,"t":"救救我","s":"鄭中基","c":"鄭中基"},{"y":2003,"t":"學神","s":"鄭中基","c":"鄭中基"},{"y":2003,"t":"受寵若驚","s":"鄭中基","c":"鄭中基"},{"y":2003,"t":"我代你哭","s":"鄭中基","c":"鄭中基"},{"y":2003,"t":"傻大哥","s":"鄭中基","c":"雷頌德/鄭中基"},{"y":2003,"t":"火紅火熱","s":"鄭中基、何韻詩、梁漢文、楊千嬅","c":"雷頌德"},{"y":2003,"t":"為愛而愛","s":"鄭希怡","c":"李峻一"},{"y":2003,"t":"我情願不跳舞","s":"鄭希怡","c":"黃丹儀"},{"y":2003,"t":"每天愛你少一些","s":"鄭秀文","c":"徐偉賢"},{"y":2003,"t":"天祐我們","s":"盧巧音","c":"雷頌德"},{"y":2003,"t":"花奴","s":"盧巧音","c":"盧巧音"},{"y":2003,"t":"你想我點","s":"蕭正楠","c":"舒文/鄧建明"},{"y":2003,"t":"四月生日","s":"梁詠琪","c":"梁詠琪/Johannes Brahms","r":"混"},{"y":2003,"t":"彩虹交匯處","s":"梁詠琪","c":"郭偉亮"},{"y":2003,"t":"零比零","s":"梁漢文","c":"王雙駿"},{"y":2003,"t":"一小時沖印","s":"梁漢文","c":"梁漢文"},{"y":2003,"t":"二見鍾情","s":"梁漢文","c":"陳輝陽"},{"y":2003,"t":"三宅一生","s":"梁漢文","c":"梁漢文"},{"y":2003,"t":"披頭四","s":"梁漢文","c":"雷頌德"},{"y":2003,"t":"501","s":"梁漢文","c":"伍樂城"},{"y":2003,"t":"666","s":"梁漢文","c":"伍樂城"},{"y":2003,"t":"七友","s":"梁漢文","c":"雷頌德"},{"y":2003,"t":"八","s":"梁漢文","c":"陳輝陽"},{"y":2003,"t":"九九九","s":"梁漢文","c":"王雙駿"},{"y":2003,"t":"信望愛","s":"梁漢文","c":"Tonci Huljic","r":"外"},{"y":2003,"t":"大男人","s":"許志安","c":"雷頌德"},{"y":2003,"t":"一步一生","s":"許志安","c":"伍樂城"},{"y":2003,"t":"窮爸爸","s":"許志安","c":"曾奕文"},{"y":2003,"t":"苦中作樂","s":"許志安","c":"陳輝陽@好好笑"},{"y":2003,"t":"十個分手的理由","s":"蕭正楠","c":"伍樂城"},{"y":2003,"t":"第二世","s":"謝霆鋒","c":"謝霆鋒"},{"y":2003,"t":"邊走邊愛","s":"謝霆鋒","c":"謝霆鋒、孫偉明"},{"y":2003,"t":"苦海孤雛","s":"謝霆鋒","c":"伍樂城"},{"y":2003,"t":"我甚麼都不是","s":"謝霆鋒","c":"Joseph Hwang"},{"y":2003,"t":"我的爸爸媽媽","s":"鍾欣桐","c":"歐陽業俊"},{"y":2003,"t":"門外門內","s":"譚詠麟","c":"陳曉東"},{"y":2003,"t":"甜美謊言","s":"關心妍","c":"彭海桐"},{"y":2003,"t":"愛與被愛","s":"關心妍","c":"林健華"},{"y":2003,"t":"假使我漂亮","s":"關心妍","c":"陳輝陽"},{"y":2003,"t":"戀愛最初回","s":"關智斌","c":"Keevin Lai"},{"y":2003,"t":"老死","s":"蘇永康","c":"吳國敬"},{"y":2003,"t":"笑下去","s":"蘇永康","c":"Ken Chan"},{"y":2003,"t":"七老八十","s":"蘇永康","c":"范曉宣"},{"y":2003,"t":"我是誰","s":"蘇永康","c":"Ken Chan"},{"y":2004,"t":"赤鱲角之戀","s":"2R","c":"伍樂城＠Rnls"},{"y":2004,"t":"皇室堡主","s":"Boy'z","c":"陳子敏"},{"y":2004,"t":"四喜臨門喜迎春","s":"Boy'z、Twins","c":"伍樂城"},{"y":2004,"t":"這麼好","s":"Eric Kwok","c":"郭偉亮"},{"y":2004,"t":"藍色飛揚Dare for More","s":"F4等","c":"杜自持"},{"y":2004,"t":"大頭貼","s":"Kary＠Cookies","c":"矢井田瞳","r":"日"},{"y":2004,"t":"高高地","s":"Sky","c":"伍樂城"},{"y":2004,"t":"情投意合","s":"Sky","c":"謝國維"},{"y":2004,"t":"士多啤梨蘋果橙","s":"Twins","c":"伍樂城"},{"y":2004,"t":"飲歌","s":"Twins","c":"伍樂城"},{"y":2004,"t":"輕功","s":"Twins","c":"傅勁聰（Ronald Fu）"},{"y":2004,"t":"陳永仁","s":"Twins","c":"伍樂城"},{"y":2004,"t":"蜜月","s":"Twins","c":"馮翰銘"},{"y":2004,"t":"女人味","s":"Twins","c":"伍樂城"},{"y":2004,"t":"受之有愧","s":"Twins","c":"伍樂城"},{"y":2004,"t":"愛無敵","s":"Twins","c":"伍樂城"},{"y":2004,"t":"丟架","s":"Twins","c":"伍樂城"},{"y":2004,"t":"美麗無比","s":"Twins","c":"伍樂城"},{"y":2004,"t":"烈女","s":"Twins","c":"伍樂城"},{"y":2004,"t":"拍住上","s":"Twins","c":"陳輝陽"},{"y":2004,"t":"天地驕陽","s":"Twins","c":"黃丹儀"},{"y":2004,"t":"愛全能","s":"Twins","c":"伍樂城"},{"y":2004,"t":"追女仔","s":"Twins","c":"陳輝陽"},{"y":2004,"t":"大方","s":"方力申","c":"雷頌德"},{"y":2004,"t":"大雄","s":"古巨基","c":"側田"},{"y":2004,"t":"愛與誠","s":"古巨基","c":"曹雪芬"},{"y":2004,"t":"美雪美雪","s":"古巨基","c":"張繼聰"},{"y":2004,"t":"傷追人","s":"古巨基","c":"側田"},{"y":2004,"t":"Touch","s":"古巨基","c":"雷頌德"},{"y":2004,"t":"史上最強漫畫王大亂鬥","s":"古巨基","c":"張佳添"},{"y":2004,"t":"小流氓","s":"古巨基","c":"張子堅（BC）"},{"y":2004,"t":"飄流教室","s":"古巨基","c":"張佳添"},{"y":2004,"t":"我是貓","s":"古巨基","c":"雷頌德"},{"y":2004,"t":"鐵男","s":"古巨基","c":"古巨基"},{"y":2004,"t":"Monica","s":"古巨基","c":"陳熙"},{"y":2004,"t":"堅強","s":"余文樂","c":"金培達"},{"y":2004,"t":"孩子王","s":"吳浩康","c":"伍卓賢"},{"y":2004,"t":"與神對話","s":"許志安","c":"陶山"},{"y":2004,"t":"折磨","s":"許志安","c":"陳輝陽"},{"y":2004,"t":"愛我所愛","s":"許志安","c":"沈志煒"},{"y":2004,"t":"苦水","s":"許志安","c":"沈志煒"},{"y":2004,"t":"要愛便愛","s":"許志安、張柏芝","c":"Nicholas Ong"},{"y":2004,"t":"野草","s":"郭富城","c":"伍樂城"},{"y":2004,"t":"左擁右抱","s":"陳小春","c":"包小松"},{"y":2004,"t":"一切還好","s":"陳奕迅","c":"符致逸"},{"y":2004,"t":"萬佛朝宗","s":"陳奕迅","c":"倪子岡（Alex Ni）"},{"y":2004,"t":"冤氣","s":"陳奕迅","c":"廖偉鵬"},{"y":2004,"t":"八里公路","s":"陳奕迅","c":"Siegfried Walch、Manuela Eder","r":"外"},{"y":2004,"t":"放下來","s":"陳奕迅","c":"馬念先"},{"y":2004,"t":"開不了心","s":"陳奕迅","c":"伍卓賢"},{"y":2004,"t":"24","s":"陳奕迅","c":"陳思捷"},{"y":2004,"t":"不求人","s":"陳奕迅","c":"藍奕邦"},{"y":2004,"t":"最後今晚","s":"陳奕迅","c":"郭偉亮"},{"y":2004,"t":"愛你入骨","s":"陳奕迅","c":"Dan Hougesen/Tom Lindby/Bo Christensen/Sune Thor","r":"外"},{"y":2004,"t":"無限","s":"陳慧琳","c":"雷頌德"},{"y":2004,"t":"潔身自愛","s":"陳慧琳","c":"伍樂城"},{"y":2004,"t":"前世","s":"陳慧琳","c":"伍樂城"},{"y":2004,"t":"柴門文的女人","s":"陳慧琳","c":"王菀之"},{"y":2004,"t":"完美關係","s":"陳慧琳","c":"雷頌德"},{"y":2004,"t":"等到你","s":"陳潔儀","c":"古倩敏/李迪文"},{"y":2004,"t":"愛無常","s":"陳曉東","c":"張亞東"},{"y":2004,"t":"怪物小王子","s":"麥浚龍","c":"王雙駿"},{"y":2004,"t":"衰邊個","s":"黃子華","c":"陳浩然（Tommy Chan）"},{"y":2004,"t":"翡翠劇場","s":"黃耀明","c":"顧嘉煇"},{"y":2004,"t":"放過自己","s":"吳浩康","c":"陳輝陽"},{"y":2004,"t":"別舞","s":"李克勤","c":"金培達"},{"y":2004,"t":"柏林穹蒼下","s":"谷祖琳","c":"林一峯"},{"y":2004,"t":"得人驚","s":"林嘉欣","c":"陳光榮"},{"y":2004,"t":"謀殺白痴","s":"林嘉欣","c":"陳光榮"},{"y":2004,"t":"為所欲為","s":"林嘉欣、潘迪華","c":"金培達"},{"y":2004,"t":"一拍兩散","s":"容祖兒","c":"方樹樑"},{"y":2004,"t":"朱古力萬歲","s":"容祖兒","c":"Gang Hyun Min","r":"韓"},{"y":2004,"t":"候鳥樹","s":"容祖兒","c":"陳輝陽"},{"y":2004,"t":"煙霞","s":"容祖兒","c":"曾家瑋"},{"y":2004,"t":"身驕肉貴","s":"容祖兒","c":"伍樂城"},{"y":2004,"t":"貪慕虛榮","s":"容祖兒","c":"周初晨@U's Music"},{"y":2004,"t":"Life Is Like A Dream","s":"張學友","c":"張學友"},{"y":2004,"t":"慢條斯理","s":"張學友","c":"張學友"},{"y":2004,"t":"大舞會","s":"張學友等","c":"李迪文"},{"y":2004,"t":"情人佳節","s":"張學友等","c":"陳少琪/李迪文"},{"y":2004,"t":"鸞鳳和鳴","s":"楊千嬅","c":"伍樂城＠Baron"},{"y":2004,"t":"處處吻","s":"楊千嬅","c":"雷頌德"},{"y":2004,"t":"小城大事","s":"楊千嬅","c":"雷頌德"},{"y":2004,"t":"的士司機","s":"楊千嬅","c":"蔡德才/人山人海"},{"y":2004,"t":"電光幻影","s":"楊千嬅","c":"于逸堯"},{"y":2004,"t":"柳媚花嬌","s":"楊千嬅","c":"林二汶@At17"},{"y":2004,"t":"大城大事","s":"楊千嬅","c":"雷頌德"},{"y":2004,"t":"花好月圓夜","s":"楊千嬅、任賢齊","c":"任賢齊"},{"y":2004,"t":"排名不分先後左右忠奸","s":"達明一派","c":"劉以達"},{"y":2004,"t":"常言道","s":"劉德華","c":"藍奕邦"},{"y":2004,"t":"按摩女郎","s":"劉德華","c":"馮翰銘"},{"y":2004,"t":"如果我有事","s":"劉德華","c":"劉祖達"},{"y":2004,"t":"我唔識字","s":"劉德華","c":"吳品醇"},{"y":2004,"t":"馬龍白蘭度","s":"劉德華","c":"黃貫中"},{"y":2004,"t":"辛苦你","s":"鄭伊健","c":"褚鎮東"},{"y":2004,"t":"內傷","s":"鄭伊健","c":"陳光榮"},{"y":2004,"t":"花多眼亂","s":"鄭希怡","c":"Emily Dawn Philips/Anthony Edward Whiting/王雙駿","r":"混"},{"y":2004,"t":"所謂愛","s":"鄭希怡","c":"Emily Dawn Philips/Anthony Edward Whitin","r":"外"},{"y":2004,"t":"世界之最（你願意）","s":"鄭秀文","c":"馮家能"},{"y":2004,"t":"來到這裏","s":"鄭秀文","c":"陳小霞"},{"y":2004,"t":"我愛你，再見！","s":"鄭秀文","c":"樸樹"},{"y":2004,"t":"傷","s":"鄭秀文","c":"歐陽業俊"},{"y":2004,"t":"Try Again","s":"鄭秀文","c":"張繼聰"},{"y":2004,"t":"美味關係","s":"鄭秀文","c":"林一峯"},{"y":2004,"t":"起飛","s":"鄭欣宜","c":"雷頌德"},{"y":2004,"t":"妳等我","s":"黎明","c":"雷頌德"},{"y":2004,"t":"不可一世","s":"黎明","c":"側田"},{"y":2004,"t":"別舔傷口","s":"黎明","c":"雷頌德"},{"y":2004,"t":"一比一","s":"黎明","c":"雷頌德"},{"y":2004,"t":"我是否還愛你","s":"黎明","c":"側田"},{"y":2004,"t":"心癮","s":"梁洛施","c":"陳輝陽"},{"y":2004,"t":"愛到底","s":"梁洛施","c":"陳輝陽"},{"y":2004,"t":"先苦後甜","s":"梁洛施","c":"陳輝陽/艾爾加"},{"y":2004,"t":"錫自己","s":"梁洛施","c":"陳輝陽"},{"y":2004,"t":"聽話","s":"梁洛施","c":"伍樂城"},{"y":2004,"t":"散心","s":"梁詠琪","c":"陶喆"},{"y":2004,"t":"廢城故事","s":"梁漢文","c":"伍樂城"},{"y":2004,"t":"使徒行傳","s":"梁漢文","c":"雷頌德"},{"y":2004,"t":"新聞女郎","s":"梁漢文","c":"王雙駿"},{"y":2004,"t":"步步高","s":"梁漢文","c":"郭偉亮"},{"y":2004,"t":"情常在","s":"梁漢文","c":"黃霑"},{"y":2004,"t":"DJ","s":"梁漢文","c":"柳重言"},{"y":2004,"t":"影迷","s":"謝霆鋒","c":"謝霆鋒/孫偉明"},{"y":2004,"t":"慘得過我","s":"關心妍","c":"方樹樑"},{"y":2004,"t":"好得過我","s":"關心妍","c":"方樹樑"},{"y":2005,"t":"玩暗戀","s":"Sky","c":"伍樂城"},{"y":2005,"t":"啞忍","s":"Sky","c":"伍樂城"},{"y":2005,"t":"快樂紅白藍","s":"Twins","c":"伍樂城"},{"y":2005,"t":"咖啡迷","s":"Twins","c":"伍樂城"},{"y":2005,"t":"黑色喜劇","s":"Twins","c":"伍樂城"},{"y":2005,"t":"熱粉紅","s":"Twins","c":"伍樂城"},{"y":2005,"t":"森巴皇后","s":"Twins","c":"陳浩健（Edward Chan）/Charles Lee"},{"y":2005,"t":"海底深","s":"Twins","c":"陳韻如"},{"y":2005,"t":"程咬金","s":"Twins","c":"謝國維"},{"y":2005,"t":"尋找莫札特","s":"Twins","c":"伍樂城"},{"y":2005,"t":"佳偶天成","s":"Twins","c":"陳浩健（Edward Chan）/Charles Lee"},{"y":2005,"t":"天對地","s":"Twins","c":"伍樂城"},{"y":2005,"t":"好走","s":"方力申","c":"Gary Chan"},{"y":2005,"t":"冷靜熱情之間","s":"方力申、鄧麗欣、傅穎","c":"雷頌德"},{"y":2005,"t":"南音","s":"方大同","c":"方大同"},{"y":2005,"t":"天才與白痴","s":"古巨基","c":"張佳添/鄭汝森@宇宙大爆炸"},{"y":2005,"t":"一生何求","s":"古巨基","c":"陳志豪"},{"y":2005,"t":"純真傳說","s":"古巨基","c":"曹雪芬, 韋懋騰"},{"y":2005,"t":"輪流轉","s":"古巨基","c":"馮穎琪"},{"y":2005,"t":"夢中人","s":"古巨基","c":"古巨基/雷頌德/側田"},{"y":2005,"t":"明星","s":"古巨基","c":"雷頌德/側田"},{"y":2005,"t":"還是覺得你最好","s":"古巨基","c":"伍卓賢"},{"y":2005,"t":"當年情","s":"古巨基","c":"陳臺證"},{"y":2005,"t":"甜蜜蜜","s":"古巨基","c":"雷頌德"},{"y":2005,"t":"星戰","s":"古巨基","c":"張佳添,龔煥榮"},{"y":2005,"t":"直到愛上你","s":"古巨基、張栢芝","c":"雷頌德"},{"y":2005,"t":"晴天行雷","s":"余文樂","c":"Yudi,Caffeine","r":"外"},{"y":2005,"t":"戀愛天才","s":"吳雨霏","c":"伍樂城"},{"y":2005,"t":"又到聖誕","s":"吳浩康","c":"周初晨"},{"y":2005,"t":"不快樂王子","s":"吳浩康","c":"吳浩康、關禮琛、周初晨"},{"y":2005,"t":"開心到震","s":"杜汶澤feat.黎明","c":"陳志恆"},{"y":2005,"t":"阿尖","s":"杜汶澤","c":""},{"y":2005,"t":"合氣道","s":"杜汶澤等","c":"雷頌德"},{"y":2005,"t":"自由女神","s":"汪明荃、陳慧琳","c":"伍樂城"},{"y":2005,"t":"工作狂","s":"張衛健","c":"潘雲峯"},{"y":2005,"t":"愛上你開始","s":"梁詠琪","c":"王菀之"},{"y":2005,"t":"吻下留人","s":"許志安","c":"舒文"},{"y":2005,"t":"你女友","s":"陳文媛","c":"伍仲衡"},{"y":2005,"t":"爛","s":"陳奕迅","c":"江志仁"},{"y":2005,"t":"阿牛","s":"陳奕迅","c":"雷頌德"},{"y":2005,"t":"夕陽無限好","s":"陳奕迅","c":"郭偉亮"},{"y":2005,"t":"大個女","s":"陳奕迅","c":"江志仁"},{"y":2005,"t":"時代","s":"陳苑淇","c":"張敬軒"},{"y":2005,"t":"別錯過（這世界）","s":"陳苑淇","c":"陳光榮"},{"y":2005,"t":"和平日","s":"黃馨","c":"伍樂城"},{"y":2005,"t":"詭異","s":"楊千嬅","c":"江志仁"},{"y":2005,"t":"長信不如短訊","s":"楊千嬅","c":"錢文璟"},{"y":2005,"t":"烈女","s":"楊千嬅","c":"雷頌德"},{"y":2005,"t":"Single","s":"楊千嬅","c":"雷頌德"},{"y":2005,"t":"花與愛麗斯","s":"楊千嬅","c":"于逸堯@人山人海"},{"y":2005,"t":"郎來了","s":"楊千嬅","c":"王菀之"},{"y":2005,"t":"霑叔","s":"溫拿樂隊","c":"顧嘉煇"},{"y":2005,"t":"8858","s":"群星","c":"黎明、雷頌德"},{"y":2005,"t":"同床異夢","s":"達明一派","c":"劉以達"},{"y":2005,"t":"O女郎","s":"達明一派","c":"劉以達"},{"y":2005,"t":"假大空","s":"達明一派","c":"阿燻"},{"y":2005,"t":"二等天使","s":"劉浩龍","c":"側田"},{"y":2005,"t":"天比高","s":"劉德華","c":"徐繼宗"},{"y":2005,"t":"情聖","s":"蔡卓妍、謝霆鋒","c":"久石讓","r":"日"},{"y":2005,"t":"Lonely","s":"衛詩","c":"Buelent Aris/Nana Abrokwa/Toni Cottura","r":"外"},{"y":2005,"t":"大哥","s":"衛蘭","c":"雷頌德"},{"y":2005,"t":"十個他不如你一個","s":"衛蘭","c":"伍樂城"},{"y":2005,"t":"今夜你不會來","s":"衛蘭","c":"陳志恆|謝明訓"},{"y":2005,"t":"口花花","s":"衛蘭","c":"陳志恆/陳鎮川"},{"y":2005,"t":"心亂如麻","s":"衛蘭","c":"雷頌德"},{"y":2005,"t":"My Love My Fate","s":"衛蘭","c":"簡尚仁（June）"},{"y":2005,"t":"我想愛就愛","s":"衛蘭","c":"雷頌德"},{"y":2005,"t":"我真的哭過","s":"鄭中基","c":"陳輝陽"},{"y":2005,"t":"精英","s":"鄭中基","c":"Silent Witness"},{"y":2005,"t":"收到","s":"鄭希怡","c":"郭偉亮"},{"y":2005,"t":"好人難做","s":"周麗淇","c":"方樹樑"},{"y":2005,"t":"甚麼甚麼","s":"官恩娜","c":"郭偉亮"},{"y":2005,"t":"還是我還是你","s":"林憶蓮","c":"雷頌德"},{"y":2005,"t":"為何他會離開你","s":"林憶蓮","c":"雷頌德"},{"y":2005,"t":"本色","s":"林憶蓮","c":"曙露"},{"y":2005,"t":"夜有所夢","s":"林憶蓮","c":"Geraldine/K.Kumar/S.Kumar","r":"外"},{"y":2005,"t":"再見悲哀","s":"林憶蓮","c":"郭偉亮"},{"y":2005,"t":"天之驕女","s":"容祖兒","c":"曾奕文"},{"y":2005,"t":"罪魁","s":"容祖兒","c":"伍樂城"},{"y":2005,"t":"我們","s":"草蜢","c":"王雙駿"},{"y":2005,"t":"好人","s":"側田","c":"雷頌德"},{"y":2005,"t":"Erica","s":"側田","c":"側田"},{"y":2005,"t":"我有今日","s":"側田","c":"側田"},{"y":2005,"t":"氹氹轉","s":"張栢芝","c":"伍仲衡"},{"y":2005,"t":"桃花轉","s":"張栢芝","c":"伍仲衡"},{"y":2005,"t":"人人","s":"張學友","c":"陳輝陽"},{"y":2005,"t":"風雷電","s":"鄭希怡","c":"王雙駿"},{"y":2005,"t":"長恨歌","s":"鄭秀文","c":"梁基爵"},{"y":2005,"t":"長情","s":"黎明","c":"伍冠諺/陳志恆"},{"y":2005,"t":"心頭高","s":"黎明","c":"伍樂城"},{"y":2005,"t":"大城小事","s":"黎明","c":"雷頌德"},{"y":2005,"t":"Everything Must Go","s":"黎明","c":"陳輝陽"},{"y":2005,"t":"別來無恙","s":"黎明","c":"陳志恆"},{"y":2005,"t":"天外飛仙","s":"盧巧音","c":"梁翹柏"},{"y":2005,"t":"隔岸觀音","s":"盧巧音","c":"盧巧音"},{"y":2005,"t":"一念天堂","s":"盧巧音","c":"盧巧音"},{"y":2005,"t":"小黑與我","s":"薛凱琪","c":"王菀之"},{"y":2005,"t":"快樂到天亮","s":"薛凱琪","c":"方樹樑/George Michael","r":"混"},{"y":2005,"t":"未約定","s":"薛凱琪","c":"伍仲衡"},{"y":2005,"t":"愛","s":"薛凱琪","c":"丁偉斌（James Ting）"},{"y":2005,"t":"怕黑","s":"謝霆鋒","c":"張佳添"},{"y":2005,"t":"多得你少","s":"謝霆鋒","c":"謝霆鋒"},{"y":2005,"t":"同門","s":"謝霆鋒","c":"謝霆鋒,孫偉明"},{"y":2005,"t":"靈犀","s":"關智斌","c":"謝浩文"},{"y":2006,"t":"應承","s":"Eric Kwok","c":"郭偉亮"},{"y":2006,"t":"晏","s":"Eric Kwok","c":"郭偉亮"},{"y":2006,"t":"好得閒","s":"Eric Kwok","c":"郭偉亮"},{"y":2006,"t":"而家","s":"Eric Kwok","c":"郭偉亮"},{"y":2006,"t":"情人與狗","s":"Shine","c":"齊樂平/張子堅（BC）"},{"y":2006,"t":"晴天霹靂","s":"Shine","c":"曾家瑋"},{"y":2006,"t":"夢想黃金屋","s":"Twins","c":"伍樂城"},{"y":2006,"t":"你不是好情人","s":"Twins","c":"蔡卓妍"},{"y":2006,"t":"自以為是","s":"Twins","c":"伍樂城"},{"y":2006,"t":"眼看心勿動","s":"Twins","c":"伍樂城"},{"y":2006,"t":"天下有雙","s":"Twins","c":"謝國維"},{"y":2006,"t":"無雙譜","s":"方力申","c":"陳輝陽"},{"y":2006,"t":"在你遙遠的附近","s":"方力申","c":"雷頌德"},{"y":2006,"t":"大細心","s":"方力申","c":"雷頌德"},{"y":2006,"t":"歌手與模特兒","s":"方大同","c":"方大同"},{"y":2006,"t":"詩人的情人","s":"方大同","c":"方大同"},{"y":2006,"t":"四人遊","s":"方大同、薛凱琪","c":"方大同"},{"y":2006,"t":"愛笑的天使","s":"王菲","c":"王菲"},{"y":2006,"t":"詩情","s":"王菀之","c":"王菀之"},{"y":2006,"t":"畫意","s":"王菀之","c":"王菀之"},{"y":2006,"t":"（巴黎沒有）摩天輪","s":"王菀之","c":"王菀之"},{"y":2006,"t":"融了鐘的時間","s":"王菀之","c":"王菀之"},{"y":2006,"t":"幸福","s":"王菀之","c":"王菀之"},{"y":2006,"t":"恨也講資格","s":"王菀之","c":"王菀之"},{"y":2006,"t":"藍色的緣份","s":"古天樂","c":"陳輝陽"},{"y":2006,"t":"我生","s":"古巨基","c":"王菀之"},{"y":2006,"t":"愛美麗","s":"古巨基","c":"陶喆"},{"y":2006,"t":"不如留低我","s":"古巨基","c":"謝布暐"},{"y":2006,"t":"重複犯錯","s":"古巨基","c":"陳輝陽"},{"y":2006,"t":"黑仔","s":"古巨基","c":"陳臺證/符傳義"},{"y":2006,"t":"花灑","s":"古巨基","c":"王菀之"},{"y":2006,"t":"愛恨交纏","s":"古巨基","c":"陳臺證"},{"y":2006,"t":"愛得太遲","s":"古巨基","c":"楊鎮邦"},{"y":2006,"t":"滾","s":"梁漢文、楊千嬅","c":"雷頌德"},{"y":2006,"t":"24 hrs","s":"莫文蔚","c":"Jem Griffiths","r":"外"},{"y":2006,"t":"榮幸","s":"許志安","c":"劉家昌"},{"y":2006,"t":"大愛","s":"許志安","c":"方大同"},{"y":2006,"t":"任白","s":"許志安","c":"蔡德才"},{"y":2006,"t":"何慧愛","s":"許志安","c":"馮家能,林健華"},{"y":2006,"t":"陳大文","s":"許志安","c":"黃維一"},{"y":2006,"t":"你是我的銀河","s":"許志安","c":"郭偉亮"},{"y":2006,"t":"鬥苦","s":"許志安、鄧健泓","c":"伍樂城"},{"y":2006,"t":"交換生","s":"郭芯其、林苑","c":"伍樂城"},{"y":2006,"t":"有鬼","s":"陳小春","c":"何禮賢"},{"y":2006,"t":"劫數難逃","s":"陳小春","c":"朱敬然"},{"y":2006,"t":"羞家","s":"陳小春","c":"鍾定一"},{"y":2006,"t":"鬥殘酷","s":"陳小春","c":"伍樂城"},{"y":2006,"t":"你是最好的","s":"陳小春、夏曉晴","c":"伍樂城"},{"y":2006,"t":"黑擇明","s":"陳奕迅","c":"江志仁"},{"y":2006,"t":"富士山下","s":"陳奕迅","c":"澤日生"},{"y":2006,"t":"不如不見","s":"陳奕迅","c":"陳小霞"},{"y":2006,"t":"忍無可忍","s":"陳苑淇","c":"伍樂城"},{"y":2006,"t":"海豚","s":"陳慧琳","c":"雷頌德"},{"y":2006,"t":"得天獨厚","s":"陳慧琳","c":"雷頌德"},{"y":2006,"t":"兒女私情","s":"陳慧琳","c":"伍樂城"},{"y":2006,"t":"一刀兩斷","s":"陳慧琳","c":"馮穎琪"},{"y":2006,"t":"有血有淚","s":"陳慧琳","c":"陳韻琪"},{"y":2006,"t":"因為有你","s":"陳慧琳","c":"雷頌德"},{"y":2006,"t":"沙塵滾滾","s":"陳慧琳、陳小春","c":"雷頌德"},{"y":2006,"t":"只談風月","s":"黃貫中、雷有暉、鄧建明","c":"伍樂城"},{"y":2006,"t":"Rock Me Amadeus","s":"黃耀明","c":"Falco/Rob Bolland/Ferdi Bolland","r":"外"},{"y":2006,"t":"詠嘆調","s":"黃耀明","c":"何山"},{"y":2006,"t":"永恆","s":"黃耀明","c":"梁基爵"},{"y":2006,"t":"四大皆空","s":"黃耀明","c":"梁基爵"},{"y":2006,"t":"如歌的行板","s":"黃耀明","c":"梁基爵"},{"y":2006,"t":"吻所有女孩","s":"楊千嬅","c":"周國賢"},{"y":2006,"t":"她成功了他沒有","s":"楊千嬅","c":"錢文璟"},{"y":2006,"t":"毅行","s":"楊千嬅","c":"江志仁"},{"y":2006,"t":"水月鏡花","s":"楊千嬅","c":"于逸堯@人山人海"},{"y":2006,"t":"大傻","s":"楊千嬅","c":"郭偉亮"},{"y":2006,"t":"約定你","s":"古巨基","c":"側田"},{"y":2006,"t":"往生","s":"古巨基","c":"謝布暐"},{"y":2006,"t":"愛得太遲","s":"古巨基、周慧敏","c":"楊鎮邦"},{"y":2006,"t":"爸媽的話","s":"成龍、古天樂、許冠文","c":"陳輝陽"},{"y":2006,"t":"愛你變成恨你","s":"吳雨霏","c":"劉祖德"},{"y":2006,"t":"罪人","s":"吳浩康","c":"彭海桐、橋 韜"},{"y":2006,"t":"大人的遊戲","s":"吳浩康","c":"陳思捷"},{"y":2006,"t":"忽然分手","s":"吳浩康","c":"周初晨"},{"y":2006,"t":"天水、圍城","s":"李克勤","c":"曾奕文"},{"y":2006,"t":"情比紙薄","s":"李克勤","c":"王菀之"},{"y":2006,"t":"我有心晴","s":"杜麗莎","c":"陳輝陽"},{"y":2006,"t":"迎接失戀","s":"周麗淇","c":"金培達"},{"y":2006,"t":"陪你哭的不是我","s":"泳兒","c":"蔡志浩"},{"y":2006,"t":"花無雪","s":"泳兒","c":"Matsumoto Ryoki/Satomi","r":"日"},{"y":2006,"t":"再見亦是戀人","s":"孫耀威、車婉婉","c":"伍樂城"},{"y":2006,"t":"堂堂男人","s":"容祖兒","c":"鄭汝森/歐天勇"},{"y":2006,"t":"上次坐飛機","s":"容祖兒","c":"徐繼宗"},{"y":2006,"t":"冬眠","s":"容祖兒","c":"蔡志浩、周博賢"},{"y":2006,"t":"愛一個上一課","s":"容祖兒","c":"藍奕邦"},{"y":2006,"t":"卸妝","s":"容祖兒","c":"郭偉亮"},{"y":2006,"t":"決戰二世祖","s":"側田","c":"側田、雷頌德"},{"y":2006,"t":"Kong","s":"側田","c":"側田/雷頌德"},{"y":2006,"t":"Volar","s":"側田","c":"側田/雷頌德"},{"y":2006,"t":"情永落","s":"側田","c":"陳臺證"},{"y":2006,"t":"情歌","s":"側田","c":"雷頌德"},{"y":2006,"t":"老了十歲","s":"張敬軒","c":"伍仲衡"},{"y":2006,"t":"天下太平","s":"張學友、陳奕迅","c":"伍樂城"},{"y":2006,"t":"I Say U Say","s":"張衛健","c":"郭偉亮"},{"y":2006,"t":"成長的短髮","s":"梁詠琪","c":"陳綺貞"},{"y":2006,"t":"一人幾票","s":"梁詠琪","c":"蔡健雅"},{"y":2006,"t":"請我吃餅乾","s":"梁詠琪","c":"梁詠琪"},{"y":2006,"t":"戀愛盲","s":"梁漢文","c":"梁漢文|陳奕迅"},{"y":2006,"t":"電梯男","s":"梁漢文","c":"梁漢文"},{"y":2006,"t":"我的生存之道","s":"楊千嬅","c":"陳輝陽"},{"y":2006,"t":"亦舒說","s":"楊千嬅","c":"側田"},{"y":2006,"t":"芬梨道上","s":"楊千嬅","c":"藍奕邦"},{"y":2006,"t":"我只能跳舞","s":"楊千嬅","c":"江志仁"},{"y":2006,"t":"如果可以不停相愛","s":"楊千嬅","c":"郭偉亮"},{"y":2006,"t":"我要你認錯","s":"葉佩雯","c":"郭偉亮"},{"y":2006,"t":"好假的你","s":"葉佩雯","c":"郭偉亮"},{"y":2006,"t":"放監","s":"葉佩雯","c":"郭偉亮"},{"y":2006,"t":"恢復自由","s":"劉浩龍","c":"江志仁"},{"y":2006,"t":"九週半","s":"劉浩龍、胡蓓蔚","c":"伍樂城"},{"y":2006,"t":"教你如何不愛他","s":"劉德華","c":"伍仲衡"},{"y":2006,"t":"多愁善感","s":"劉德華","c":"王菀之"},{"y":2006,"t":"模範生","s":"劉德華","c":"陳輝陽"},{"y":2006,"t":"紅顏自閉","s":"劉德華","c":"Toshiko Ezaki","r":"日"},{"y":2006,"t":"觀世音","s":"劉德華","c":"方大同"},{"y":2006,"t":"Heartbreaker","s":"衛詩","c":"雷頌德"},{"y":2006,"t":"Mon Saturday","s":"衛詩","c":"雷頌德"},{"y":2006,"t":"Misbehave","s":"衛詩","c":"雷頌德"},{"y":2006,"t":"Get Out","s":"衛詩","c":"雷頌德"},{"y":2006,"t":"Funny Jealousy","s":"衛詩","c":"雷頌德"},{"y":2006,"t":"Be a Man","s":"衛詩","c":"雷頌德"},{"y":2006,"t":"Lost in Paradise","s":"衛詩","c":"雷頌德"},{"y":2006,"t":"離家出走","s":"衛蘭","c":"雷頌德"},{"y":2006,"t":"愛你還愛你","s":"衛蘭","c":"申升勳","r":"韓"},{"y":2006,"t":"霎眼嬌","s":"衛蘭","c":"雷頌德"},{"y":2006,"t":"越幫越忙","s":"衛蘭","c":"雷頌德"},{"y":2006,"t":"愛才","s":"衛蘭","c":"伍樂城"},{"y":2006,"t":"深愛","s":"衛蘭","c":"雷頌德"},{"y":2006,"t":"拍錯拖","s":"衛蘭","c":"陳輝陽"},{"y":2006,"t":"等","s":"衛蘭","c":"雷頌德"},{"y":2006,"t":"這正是我","s":"衛蘭","c":"伍樂城"},{"y":2006,"t":"大件事","s":"鄧健泓","c":"伍樂城"},{"y":2006,"t":"信者得救","s":"鄧健泓","c":"蔡志浩、周博賢"},{"y":2006,"t":"戒不掉妳","s":"鄧健泓","c":"梁偉文,張繼聰"},{"y":2006,"t":"男人有話說","s":"鄧健泓","c":"伍樂城"},{"y":2006,"t":"愛是傻得起","s":"黎明","c":"雷頌德"},{"y":2006,"t":"無事常相見","s":"黎明","c":"雷頌德"},{"y":2006,"t":"你有本事","s":"黎明","c":"葉進賢"},{"y":2006,"t":"電殛","s":"黎明","c":"雷頌德"},{"y":2006,"t":"多謝地球","s":"薛凱琪","c":"嘉琳"},{"y":2006,"t":"Hey June","s":"梁漢文","c":"梁漢文|文慧林"},{"y":2006,"t":"失魂落魄","s":"梁漢文","c":"梁漢文/郭偉亮"},{"y":2006,"t":"白日夢","s":"梁漢文","c":"梁漢文、蔡德才"},{"y":2006,"t":"羅曼蒂克","s":"梁漢文","c":"梁漢文、於逸堯"},{"y":2006,"t":"Y3","s":"梁漢文","c":"梁漢文/謝霆鋒"},{"y":2006,"t":"戰後餘生","s":"梁漢文","c":"梁漢文"},{"y":2006,"t":"路漫漫","s":"梁漢文","c":"梁漢文|林一峯"},{"y":2006,"t":"毋忘我","s":"謝霆鋒","c":"Yutaka Ozaki","r":"日"},{"y":2006,"t":"小宇宙","s":"謝霆鋒","c":"謝霆鋒"},{"y":2006,"t":"我的小宇宙","s":"謝霆鋒","c":"謝霆鋒"},{"y":2006,"t":"非君不嫁","s":"鍾欣桐","c":"黃丹儀"},{"y":2006,"t":"大大時代","s":"譚詠麟","c":"王雙駿"},{"y":2006,"t":"讚","s":"關心妍","c":"關心妍"},{"y":2006,"t":"蟬","s":"關心妍","c":"蔡一智"},{"y":2006,"t":"吐氣揚眉","s":"關楚耀","c":"雷頌德"},{"y":2007,"t":"相愛6年","s":"Twins","c":"伍樂城"},{"y":2007,"t":"金句","s":"Twins","c":"伍樂城"},{"y":2007,"t":"世界變","s":"Twins","c":"黃思彥"},{"y":2007,"t":"士氣","s":"Twins","c":"朱儁傑"},{"y":2007,"t":"出人頭地","s":"小肥","c":"陳輝陽"},{"y":2007,"t":"親近對．親熱錯","s":"方力申","c":"雷頌德"},{"y":2007,"t":"你甚麼都可以","s":"方力申","c":"雷頌德"},{"y":2007,"t":"真心話","s":"王菀之","c":"王菀之"},{"y":2007,"t":"一刻永恆","s":"古巨基","c":"側田"},{"y":2007,"t":"錢錢錢錢","s":"古巨基","c":"雷頌德"},{"y":2007,"t":"愛回家","s":"古巨基","c":"李迪文"},{"y":2007,"t":"你生","s":"古巨基","c":"雷頌德"},{"y":2007,"t":"蠻不講理","s":"古巨基","c":"曾家瑋"},{"y":2007,"t":"自我安慰","s":"古巨基","c":"陳臺證"},{"y":2007,"t":"我自問","s":"古巨基","c":"雷頌德"},{"y":2007,"t":"為何","s":"古巨基","c":"王菀之"},{"y":2007,"t":"賞心樂事","s":"古巨基","c":"王菀之"},{"y":2007,"t":"十蚊雞流浪記","s":"古巨基","c":"雷頌德"},{"y":2007,"t":"護身符","s":"古巨基","c":"黃偉年"},{"y":2007,"t":"童夢","s":"光良、衛蘭","c":"歐陽業鴻"},{"y":2007,"t":"逼得太緊","s":"吳雨霏","c":"黃丹儀"},{"y":2007,"t":"想這樣得那樣","s":"吳雨霏","c":"陳輝陽"},{"y":2007,"t":"晚安","s":"李克勤","c":"伍仲衡"},{"y":2007,"t":"三千年前","s":"李香琴、關淑怡","c":"陳輝陽"},{"y":2007,"t":"我是明星","s":"周華健","c":"周華健"},{"y":2007,"t":"星星月亮太陽","s":"林二汶","c":"陳輝陽"},{"y":2007,"t":"你並不孤單","s":"林峯","c":"胡文"},{"y":2007,"t":"小小世界","s":"迪士尼","c":"Sherman Brothers","r":"外"},{"y":2007,"t":"博大的愛","s":"香港兒童合唱團","c":"伍樂城"},{"y":2007,"t":"思前戀後","s":"孫耀威","c":"謝國維"},{"y":2007,"t":"戀愛宣言","s":"孫耀威","c":"伍樂城"},{"y":2007,"t":"愛她因為愛你","s":"孫耀威","c":"孫耀威"},{"y":2007,"t":"迷失表參道","s":"張敬軒","c":"常石磊"},{"y":2007,"t":"我的天","s":"張敬軒","c":"周博賢"},{"y":2007,"t":"悲劇人物","s":"張敬軒","c":"楊芷君"},{"y":2007,"t":"遙吻","s":"張敬軒","c":"常石磊"},{"y":2007,"t":"未來的未來","s":"梁詠琪","c":"戴麗津"},{"y":2007,"t":"零時十幾分","s":"梁漢文","c":"雷頌德"},{"y":2007,"t":"空前絕後","s":"許志安","c":"楊鎮邦"},{"y":2007,"t":"誰還敢愛這個人","s":"許志安","c":"藝琛＠Zoo Music"},{"y":2007,"t":"你哪裏有錯","s":"許志安","c":"雷頌德"},{"y":2007,"t":"感情何價","s":"許志安","c":"徐繼宗"},{"y":2007,"t":"未夠多","s":"許志安","c":"伍樂城"},{"y":2007,"t":"熱島小夜曲","s":"陳奕迅","c":"肖光偉"},{"y":2007,"t":"十方一念","s":"陳浩峰","c":"于逸堯"},{"y":2007,"t":"流芳怨","s":"馮穎琪","c":"馮穎琪"},{"y":2007,"t":"化","s":"楊千嬅","c":"阿滾"},{"y":2007,"t":"陌路","s":"楊千嬅","c":"雷頌德"},{"y":2007,"t":"集體回憶","s":"楊千嬅","c":"陳臺證"},{"y":2007,"t":"不認不認還需認","s":"楊千嬅","c":"雷頌德"},{"y":2007,"t":"別阻我開心","s":"楊千嬅","c":"黃思彥"},{"y":2007,"t":"同病相愛","s":"楊千嬅","c":"歐陽業鴻"},{"y":2007,"t":"知情識趣","s":"楊千嬅","c":"雷頌德"},{"y":2007,"t":"傑出青年","s":"楊千嬅","c":"伍樂城"},{"y":2007,"t":"黑馬","s":"蔡卓妍","c":"伍樂城"},{"y":2007,"t":"雜技","s":"衛蘭","c":"雷頌德"},{"y":2007,"t":"無所謂","s":"衛蘭","c":"Hocine Hallaf/Nicolas Neidhart/Benjamin Manuel Raffaelli","r":"外"},{"y":2007,"t":"受夠","s":"鄭融","c":"周博賢@Sense"},{"y":2007,"t":"七夕","s":"鄧麗欣","c":"歐陽業俊"},{"y":2007,"t":"永遠保護你","s":"孫耀威","c":"陳孟奇、鄧敏賤"},{"y":2007,"t":"魔高一丈","s":"孫耀威","c":"謝國維"},{"y":2007,"t":"一個人的好處","s":"孫耀威","c":"蔡志浩"},{"y":2007,"t":"無一倖免","s":"孫耀威","c":"伍樂城"},{"y":2007,"t":"我教你分手","s":"孫耀威","c":"謝國維"},{"y":2007,"t":"答謝信","s":"孫耀威","c":"陳光榮"},{"y":2007,"t":"幸福的再會","s":"孫耀威","c":"唐奕聰"},{"y":2007,"t":"Here I Go","s":"孫耀威","c":"孫耀威/Jason Edmonds","r":"混"},{"y":2007,"t":"別貪名牌","s":"孫耀威","c":"Victor Lau"},{"y":2007,"t":"拖多一年得一年","s":"孫耀威","c":"黃思彥"},{"y":2007,"t":"彈珠玩具","s":"孫耀威","c":"楊淽"},{"y":2007,"t":"告別散拖","s":"孫耀威","c":"謝國維"},{"y":2007,"t":"走出生天","s":"孫耀威、陳詩慧","c":"鍾達茵/江志仁"},{"y":2007,"t":"陪我長大","s":"容祖兒","c":"陳光榮"},{"y":2007,"t":"Forever","s":"草蜢","c":"蔡一智"},{"y":2007,"t":"酷愛","s":"張敬軒","c":"周博賢"},{"y":2007,"t":"不速之約","s":"鄧麗欣","c":"徐繼宗"},{"y":2007,"t":"酒渦與燕窩","s":"鄧麗欣","c":"陳輝陽"},{"y":2007,"t":"看透","s":"鄧麗欣","c":"雷頌德"},{"y":2007,"t":"再見不是朋友","s":"鄧麗欣","c":"伍仲衡"},{"y":2007,"t":"活到美麗","s":"鄧麗欣","c":"嚴勵行"},{"y":2007,"t":"想你們","s":"黎明","c":"Lee Sang Jun","r":"韓"},{"y":2007,"t":"鍾無艷","s":"謝安琪","c":"澤日生"},{"y":2007,"t":"雙重打擊","s":"鍾欣桐","c":"黃丹儀"},{"y":2007,"t":"我自跳我舞","s":"顆粒＠卡奇社","c":"陳輝陽"},{"y":2007,"t":"如何離開你","s":"關心妍","c":"伍樂城"},{"y":2007,"t":"甚麼都不愛","s":"關心妍","c":"黃思彥"},{"y":2007,"t":"任君選擇","s":"關心妍","c":"黃丹儀"},{"y":2007,"t":"身為女人","s":"關心妍","c":"伍樂城"},{"y":2007,"t":"送舊迎新","s":"關心妍","c":"謝國維"},{"y":2007,"t":"地球兄弟","s":"關心妍","c":"河口恭吾","r":"日"},{"y":2007,"t":"愛你很難","s":"關心妍","c":"伍樂城"},{"y":2007,"t":"誰叫我喜歡你","s":"關心妍","c":"陳輝陽"},{"y":2007,"t":"眾生花","s":"關淑怡","c":"陳輝陽"},{"y":2007,"t":"三千年前","s":"關淑怡","c":"陳輝陽"},{"y":2008,"t":"101727","s":"at17","c":"盧凱彤"},{"y":2008,"t":"為愛而愛","s":"Square","c":"黃思彥"},{"y":2008,"t":"同床異枕","s":"文恩澄","c":"文恩澄"},{"y":2008,"t":"離別曲","s":"文恩澄","c":"文恩澄"},{"y":2008,"t":"如果世上沒傻瓜","s":"方力申","c":"Ben Tsang"},{"y":2008,"t":"每個人都會","s":"方大同","c":"方大同"},{"y":2008,"t":"我來自火星","s":"王菀之","c":"王菀之"},{"y":2008,"t":"永遠幾遠","s":"王菀之","c":"王菀之"},{"y":2008,"t":"年年有今日","s":"古巨基","c":"雷頌德"},{"y":2008,"t":"我們的彩虹","s":"古巨基","c":"林邁可"},{"y":2008,"t":"下次再見","s":"古巨基","c":"楊鎮邦@宇宙大爆炸"},{"y":2008,"t":"眼睛不能沒眼淚","s":"古巨基","c":"林健華"},{"y":2008,"t":"花不痛","s":"古巨基","c":"蔡健雅"},{"y":2008,"t":"啦啦","s":"古巨基","c":"張佳添"},{"y":2008,"t":"你恨到","s":"古巨基","c":"余奕駿"},{"y":2008,"t":"給幸福一個機會","s":"古巨基","c":"林健華"},{"y":2008,"t":"中間人","s":"古巨基、側田","c":"側田"},{"y":2008,"t":"變走他","s":"江若琳","c":"Jamie Wong"},{"y":2008,"t":"愛你還是愛美","s":"江若琳","c":"黃思彥"},{"y":2008,"t":"大步喊過","s":"江若琳","c":"伍樂城"},{"y":2008,"t":"大學問","s":"汕頭大學","c":"Beyond"},{"y":2008,"t":"不如不愛","s":"吳雨霏","c":"黃丹儀"},{"y":2008,"t":"戀愛疲勞","s":"吳雨霏","c":"Walter Wong"},{"y":2008,"t":"天天都是情人節","s":"李克勤","c":"陳輝陽"},{"y":2008,"t":"她慈我悲","s":"李克勤","c":"周博賢"},{"y":2008,"t":"看我的溫柔","s":"杜雨恩","c":"梁鉑文"},{"y":2008,"t":"家教","s":"周吉佩","c":"郭偉亮"},{"y":2008,"t":"宏願","s":"周柏豪","c":"Kay Chan x Click Music"},{"y":2008,"t":"大城之光","s":"周華健","c":"周華健"},{"y":2008,"t":"越愛越怕追","s":"周麗淇","c":"陳輝陽"},{"y":2008,"t":"相戀兩個字","s":"林保怡、黎姿","c":"趙增熹"},{"y":2008,"t":"憑良心說再見","s":"林峯","c":"周初晨"},{"y":2008,"t":"浮生若水","s":"林峯","c":"鄧智偉"},{"y":2008,"t":"夏雪","s":"林峯","c":"Josh Lee"},{"y":2008,"t":"你傷風我感冒","s":"許志安","c":"陳鈞元"},{"y":2008,"t":"我不是偉人","s":"陳小春","c":"陶昌廷"},{"y":2008,"t":"先走為敬","s":"陳小春","c":"陳科妤"},{"y":2008,"t":"歌．頌","s":"陳奕迅","c":"王雙駿"},{"y":2008,"t":"理智與感情","s":"陳柏宇、楊丞琳","c":"Abe","r":"日"},{"y":2008,"t":"無仇無怨","s":"陳曉東","c":"伍仲衡"},{"y":2008,"t":"自白書","s":"陳曉東","c":"雷頌德"},{"y":2008,"t":"殺死我的溫柔","s":"麥家瑜","c":"楊淽"},{"y":2008,"t":"吃不消","s":"麥家瑜","c":"江志仁"},{"y":2008,"t":"多謝試用","s":"黃宗澤","c":"伍仲衡"},{"y":2008,"t":"金粉世家","s":"黃耀明","c":"于逸堯"},{"y":2008,"t":"你頭上的光環","s":"黃耀明","c":"黃耀明、梁基爵"},{"y":2008,"t":"一葉舟","s":"楊千嬅","c":"龍世梁"},{"y":2008,"t":"塗鴉","s":"楊千嬅","c":"龍世梁"},{"y":2008,"t":"大慈善家","s":"楊千嬅","c":"陳浩健（Edward Chan）/Charles Lee"},{"y":2008,"t":"浮花","s":"劉美君","c":"中村中","r":"日"},{"y":2008,"t":"火花不等人","s":"劉浩龍","c":"伍仲衡"},{"y":2008,"t":"未到傷心處","s":"劉德華","c":"曾奕文"},{"y":2008,"t":"轉機(粵語版)","s":"潘瑋柏","c":"潘瑋柏"},{"y":2008,"t":"心跳如歌","s":"蔡卓妍","c":"趙增熹"},{"y":2008,"t":"心如蝶舞","s":"蔡卓妍","c":"趙增熹"},{"y":2008,"t":"就算世界無童話","s":"衛蘭","c":"雷頌德"},{"y":2008,"t":"My Cookie Can","s":"衛蘭","c":"雷頌德"},{"y":2008,"t":"你知道我在等你們分手嗎？","s":"衛蘭","c":"雷頌德"},{"y":2008,"t":"如水","s":"衛蘭","c":"伍仲衡"},{"y":2008,"t":"愛深過做人","s":"衛蘭","c":"雷頌德"},{"y":2008,"t":"我愛呼吸","s":"衛蘭","c":"雷頌德"},{"y":2008,"t":"比我想像中愛你","s":"衛蘭","c":"Kim Wang Jin,Lee So Ra","r":"韓"},{"y":2008,"t":"寒命","s":"衛蘭","c":"伍仲衡"},{"y":2008,"t":"主角愛我","s":"衛蘭","c":"雷頌德"},{"y":2008,"t":"天跌下來","s":"鄭中基、梁漢文","c":"Handel/改編古典（Tchaikovsky）","r":"外"},{"y":2008,"t":"有一種快樂","s":"鄭秀文","c":"嘉琳、蔡志豪"},{"y":2008,"t":"現實的情歌","s":"鄧健泓","c":"蔡志浩"},{"y":2008,"t":"女兒紅","s":"鄧麗欣","c":"曹桂源"},{"y":2008,"t":"大家好過","s":"唐素琪","c":"雷頌德"},{"y":2008,"t":"眾傷","s":"孫耀威","c":"Ben Tsang"},{"y":2008,"t":"貪嗔癡","s":"容祖兒","c":"張家誠"},{"y":2008,"t":"與蝶同眠","s":"容祖兒","c":"王雙駿"},{"y":2008,"t":"夢非夢","s":"容祖兒","c":"馮穎琪"},{"y":2008,"t":"可歌可泣","s":"容祖兒","c":"江志仁"},{"y":2008,"t":"自身","s":"側田","c":"側田"},{"y":2008,"t":"夜宴","s":"張敬軒","c":"馮翰銘"},{"y":2008,"t":"不吐不快","s":"張敬軒","c":"澤日生"},{"y":2008,"t":"Hate That I Love You","s":"張敬軒、Rihanna","c":"Shaffer Smith/Tor Erik Hermansen/Mikkel S Eriksen","r":"外"},{"y":2008,"t":"苦浪漫","s":"鄧麗欣","c":"歐陽業俊"},{"y":2008,"t":"你不會孤單","s":"黎明","c":"雷頌德"},{"y":2008,"t":"心連心在跳","s":"黎明","c":"Choi Sun Wo","r":"韓"},{"y":2008,"t":"隨夢而飛","s":"黎明、陳慧琳","c":"雷頌德"},{"y":2008,"t":"難道你不怕凍","s":"薛凱琪","c":"張家誠"},{"y":2008,"t":"無情有愛","s":"鍾嘉欣","c":"趙增熹"},{"y":2008,"t":"他不愛我亦不愛你","s":"關心妍","c":"周初晨"},{"y":2008,"t":"天規","s":"關淑怡","c":"莊冬昕"},{"y":2008,"t":"鑽禧","s":"關淑怡","c":"趙增熹"},{"y":2008,"t":"四面楚歌","s":"關楚耀、謝安琪","c":"溫應鴻"},{"y":2008,"t":"天大地大","s":"蘇永康","c":"倫永亮"},{"y":2008,"t":"婚誡","s":"蘇永康","c":"陳臺證,齊樂平"},{"y":2008,"t":"紅顏知己","s":"蘇永康","c":"李偲菘"},{"y":2008,"t":"汗香","s":"蘇永康","c":"雷頌德"},{"y":2008,"t":"普洱茶","s":"蘇永康","c":"倫永亮"},{"y":2009,"t":"魚蝦蟹","s":"Swing","c":"郭偉亮,陳哲廬"},{"y":2009,"t":"廣東話","s":"方力申","c":"伍樂城"},{"y":2009,"t":"煩得可愛","s":"方力申","c":"雷頌德"},{"y":2009,"t":"怎麼着","s":"王梓軒","c":"王梓軒"},{"y":2009,"t":"幾米的距離","s":"王梓軒","c":"王梓軒,唐達"},{"y":2009,"t":"大笨鐘","s":"王菀之","c":"王菀之"},{"y":2009,"t":"改變明天","s":"群星","c":"羅大佑"},{"y":2009,"t":"大師作品","s":"古巨基","c":"雷頌德"},{"y":2009,"t":"以你為榮","s":"古巨基","c":"雷頌德"},{"y":2009,"t":"亂","s":"古巨基","c":"楊鎮邦"},{"y":2009,"t":"另一雙手","s":"古巨基","c":"阿正"},{"y":2009,"t":"地球很危險","s":"古巨基","c":"劉諾生"},{"y":2009,"t":"沒有腳的小鳥","s":"古巨基","c":"朱儁傑"},{"y":2009,"t":"周星呢","s":"古巨基","c":"梁至音"},{"y":2009,"t":"因為了解，所以分手？","s":"古巨基","c":"林健華"},{"y":2009,"t":"我讀得書少","s":"古巨基","c":"張佳添,張子堅（BC）@宇宙大爆炸,撈文"},{"y":2009,"t":"Gone Too Soon","s":"古巨基","c":"劉諾生"},{"y":2009,"t":"男左女右","s":"古巨基、關淑怡","c":"雷頌德"},{"y":2009,"t":"旁觀者傷","s":"江若琳","c":"伍樂城"},{"y":2009,"t":"廉價哀傷","s":"李克勤","c":"范曉萱"},{"y":2009,"t":"潑墨","s":"李克勤","c":"周博賢"},{"y":2009,"t":"服","s":"李克勤","c":"金享錫"},{"y":2009,"t":"嫲嫲","s":"李克勤","c":"周博賢"},{"y":2009,"t":"樹懶","s":"李克勤","c":"周博賢"},{"y":2009,"t":"最後的早餐","s":"李克勤","c":"歐建星"},{"y":2009,"t":"寂寞嘍囉","s":"李克勤","c":"周博賢"},{"y":2009,"t":"有為青年","s":"李克勤","c":"唐奕聰"},{"y":2009,"t":"獨行俠","s":"李治廷","c":"李治廷"},{"y":2009,"t":"一天一粒糖","s":"狄易達","c":"陳浩健（Edward Chan）/Charles Lee@novasonic"},{"y":2009,"t":"無愧於心","s":"周海媚","c":"伍樂城"},{"y":2009,"t":"搜神記","s":"容祖兒","c":"澤日生"},{"y":2009,"t":"心賊難防","s":"容祖兒","c":"江志仁"},{"y":2009,"t":"圓謊","s":"容祖兒","c":"郭偉亮"},{"y":2009,"t":"由他人","s":"張智霖","c":"郭偉亮"},{"y":2009,"t":"披星戴月","s":"張敬軒","c":"澤日生"},{"y":2009,"t":"單打獨鬥","s":"張敬軒","c":"徐日勤"},{"y":2009,"t":"躁","s":"梁漢文","c":"吳國敬"},{"y":2009,"t":"於心有愧","s":"陳奕迅","c":"鍾達茵"},{"y":2009,"t":"太陽照常升起","s":"陳奕迅","c":"黃仲賢"},{"y":2009,"t":"不來也不去","s":"陳奕迅","c":"江志仁"},{"y":2009,"t":"你瞞我瞞","s":"陳柏宇","c":"陳光榮"},{"y":2009,"t":"拍一半拖","s":"陳柏宇","c":"陳曼琪"},{"y":2009,"t":"人外有人","s":"陳柏宇","c":"陳匡榮/江志仁"},{"y":2009,"t":"無可厚非","s":"陳柏宇","c":"Leona Chan"},{"y":2009,"t":"分手的情書","s":"陳偉聯","c":"陳偉聯"},{"y":2009,"t":"不方便的真相","s":"麥家瑜","c":"澤日生"},{"y":2009,"t":"生死疲勞","s":"麥浚龍","c":"徐繼宗"},{"y":2009,"t":"顛倒夢想","s":"麥浚龍","c":"馮穎琪"},{"y":2009,"t":"弱水三千","s":"麥浚龍","c":"馮穎琪"},{"y":2009,"t":"真命天子","s":"楊千嬅","c":"雷頌德"},{"y":2009,"t":"原來過得很快樂","s":"楊千嬅","c":"伍仲衡"},{"y":2009,"t":"佛誕吉祥","s":"群星","c":"顧嘉煇"},{"y":2009,"t":"過去的明天","s":"群星","c":"羅大佑"},{"y":2009,"t":"雪泥","s":"劉美君","c":"張慈龍"},{"y":2009,"t":"也好","s":"劉美君","c":"魏文浩"},{"y":2009,"t":"寧願怎樣","s":"劉美君","c":"馮家俊（Cousin Fung）"},{"y":2009,"t":"我喝香水大","s":"劉美君","c":"陳永良"},{"y":2009,"t":"長途伴侶","s":"劉德華","c":"伍樂城"},{"y":2009,"t":"幸福空氣","s":"蔡卓妍","c":"陳光榮"},{"y":2009,"t":"心有不甘","s":"衛蘭","c":"李宗盛"},{"y":2009,"t":"殘酷遊戲","s":"衛蘭","c":"蔡伯南"},{"y":2009,"t":"風雲義","s":"鄭伊健、郭富城","c":"陳光榮"},{"y":2009,"t":"人愛世人","s":"草蜢","c":"Burt Bacharach","r":"美"},{"y":2009,"t":"無言無語","s":"側田","c":"側田"},{"y":2009,"t":"吃苦的力量","s":"鄭欣宜","c":"Diane Warren","r":"外"},{"y":2009,"t":"縱貫線兄弟姐妹","s":"縱貫線","c":"縱貫線"},{"y":2009,"t":"Tonight","s":"謝霆鋒","c":"Yoo Gun Hyung","r":"韓"},{"y":2009,"t":"地盡頭","s":"關淑怡","c":"謝傑"},{"y":2009,"t":"男人信什麼","s":"JW、衛蘭","c":"陳奐仁"},{"y":2009,"t":"一生一世","s":"方力申、鍾欣桐","c":"伍樂城"},{"y":2009,"t":"你們好","s":"王梓軒feat.MC Jin & INK","c":"王梓軒"},{"y":2010,"t":"時代","s":"古巨基","c":"謝國維"},{"y":2010,"t":"獨男","s":"古巨基","c":"劉諾生"},{"y":2010,"t":"公主病了","s":"古巨基","c":"楊鎮邦"},{"y":2010,"t":"惡搞","s":"古巨基","c":"楊鎮邦@宇宙大爆炸"},{"y":2010,"t":"我傻女","s":"吳雨霏","c":"伍樂城"},{"y":2010,"t":"可多不可少","s":"狄易達","c":"方大同"},{"y":2010,"t":"走狗","s":"周柏豪","c":"張佩瑩"},{"y":2010,"t":"我不要被你記住","s":"周柏豪","c":"周柏豪"},{"y":2010,"t":"還有一生的時間","s":"泳兒","c":"歐陽業俊"},{"y":2010,"t":"愛的習慣","s":"側田","c":"雷頌德"},{"y":2010,"t":"三歲或八十","s":"側田","c":"側田"},{"y":2010,"t":"春秋","s":"張敬軒","c":"曾奕文"},{"y":2010,"t":"隔夜茶","s":"張敬軒","c":"歐建星@Sense"},{"y":2010,"t":"無人認領","s":"洪卓立","c":"舒文"},{"y":2010,"t":"夏花秋葉","s":"梁詠琪","c":"于逸堯"},{"y":2010,"t":"中鋒","s":"梁漢文","c":"覃嘉健"},{"y":2010,"t":"一絲不掛","s":"陳奕迅","c":"澤日生"},{"y":2010,"t":"多此一愛","s":"陳柏宇","c":"陳光榮"},{"y":2010,"t":"關注我","s":"陳柏宇","c":"陳孟奇"},{"y":2010,"t":"永遠的福氣","s":"陳慧琳","c":"雷頌德"},{"y":2010,"t":"超生培慾","s":"麥浚龍","c":"方大同"},{"y":2010,"t":"櫻吹雪","s":"麥浚龍","c":"于逸堯"},{"y":2010,"t":"遠視","s":"馮曦妤","c":"陳光榮"},{"y":2010,"t":"絕色","s":"黃耀明","c":"盧凱彤"},{"y":2010,"t":"飲酒思源","s":"楊千嬅","c":"陳輝陽"},{"y":2010,"t":"我係我","s":"楊千嬅","c":"于逸堯"},{"y":2010,"t":"另一個舞台","s":"關心妍","c":"陳輝陽"},{"y":2010,"t":"以身試愛","s":"關心妍","c":"伍樂城"},{"y":2011,"t":"兩大無猜","s":"Mr.","c":"Tom/MJ"},{"y":2011,"t":"換畫","s":"Mr.","c":"Tom/MJ"},{"y":2011,"t":"你是哪種人","s":"王梓軒","c":"王梓軒/唐達"},{"y":2011,"t":"人啊人","s":"王梓軒","c":"王梓軒/唐達"},{"y":2011,"t":"柳暗花明","s":"王菀之","c":"王菀之"},{"y":2011,"t":"水百合","s":"王菀之","c":"王菀之"},{"y":2011,"t":"下次愛你","s":"王菀之","c":"王菀之"},{"y":2011,"t":"Once Upon A Time","s":"古巨基","c":"側田"},{"y":2011,"t":"明天","s":"古巨基","c":"Matthew Miller/Bruno Mars/Ari Levine/Phillip Martin II Lawrence","r":"外"},{"y":2011,"t":"圓缺","s":"朱紫嬈、蘇永康","c":"王雙駿"},{"y":2011,"t":"Carry On","s":"吳雨霏","c":"雷頌德"},{"y":2011,"t":"我本人","s":"吳雨霏","c":"楊淽"},{"y":2011,"t":"飛躍奇妙","s":"李克勤、陳慧琳","c":"Rony Fortich","r":"外"},{"y":2011,"t":"無雙譜","s":"周慧敏","c":"伍仲衡"},{"y":2011,"t":"放下的力量","s":"周慧敏","c":"伍仲衡"},{"y":2011,"t":"非凡","s":"林欣彤","c":"倫永亮"},{"y":2011,"t":"非同兒戲","s":"林欣彤","c":"伍樂城"},{"y":2011,"t":"人一個","s":"林峯","c":"伍樂城"},{"y":2011,"t":"還淚","s":"林鵬","c":"伍樂城"},{"y":2011,"t":"就手","s":"泳兒","c":"朱儁傑"},{"y":2011,"t":"為你唱Demo","s":"泳兒","c":"伍樂城"},{"y":2011,"t":"冧爆你","s":"張智霖","c":"雷頌德"},{"y":2011,"t":"一直相愛","s":"許志安","c":"雷頌德"},{"y":2011,"t":"明我以德","s":"許冠傑、謝安琪等","c":"許冠傑"},{"y":2011,"t":"六月飛霜","s":"陳奕迅","c":"舒文/Kool G"},{"y":2011,"t":"神奇化妝師","s":"陳奕迅","c":"藍又時"},{"y":2011,"t":"讚讚自己","s":"陳柏宇","c":"陳光榮"},{"y":2011,"t":"驚蟄","s":"麥浚龍","c":"陳偉文"},{"y":2011,"t":"秋分","s":"麥浚龍","c":"周博賢"},{"y":2011,"t":"金剛圈","s":"麥浚龍","c":"雷頌德"},{"y":2011,"t":"無念","s":"麥浚龍","c":"陳珊妮"},{"y":2011,"t":"第二次青春","s":"黃耀明","c":"黃耀明、李端嫻"},{"y":2011,"t":"紅眼症","s":"黃耀明","c":"黃耀明、蔡德才"},{"y":2011,"t":"火鳥","s":"楊千嬅","c":"陳輝陽"},{"y":2011,"t":"無心快意","s":"劉德華","c":"趙欽"},{"y":2011,"t":"愛沒有假如","s":"衛蘭","c":"KOKIA","r":"日"},{"y":2011,"t":"Do Re Mi","s":"鄭秀文","c":"羅大佑"},{"y":2011,"t":"喉嚨沙啞","s":"鄧穎芝","c":"符傳義/陳玉能"},{"y":2011,"t":"情","s":"黎明","c":"雷頌德"},{"y":2011,"t":"你們的幸福","s":"謝安琪","c":"澤日生"},{"y":2011,"t":"囉唆","s":"鍾嘉欣","c":"藍又時"},{"y":2011,"t":"在你名下","s":"關心妍","c":"伍樂城/朱儁傑"},{"y":2011,"t":"似風如水","s":"關菊英","c":"戴樂民"},{"y":2012,"t":"大過天","s":"Twins","c":"側田"},{"y":2012,"t":"留白","s":"王菀之","c":"常石磊"},{"y":2012,"t":"這裏沒有陌生人","s":"付辛博等","c":"小柯"},{"y":2012,"t":"公告天下我愛你","s":"古巨基","c":"古巨基"},{"y":2012,"t":"告別我的戀人們","s":"古巨基","c":"陳輝陽"},{"y":2012,"t":"戀無可戀","s":"古巨基","c":"方皓玟"},{"y":2012,"t":"直到銀婚","s":"古巨基","c":"蔡德才"},{"y":2012,"t":"逆時光","s":"古巨基","c":"BennettPan"},{"y":2012,"t":"人非草木","s":"吳雨霏","c":"楊淽"},{"y":2012,"t":"若要人不知","s":"吳若希","c":"陳輝陽"},{"y":2012,"t":"我是個地球人","s":"周國賢","c":"周國賢"},{"y":2012,"t":"頑石","s":"林峯","c":"澤日生"},{"y":2012,"t":"一刀切","s":"林峯","c":"江志仁/鍾達茵"},{"y":2012,"t":"頑石點頭","s":"林峯","c":"澤日生"},{"y":2012,"t":"很想很想說再見","s":"側田","c":"側田"},{"y":2012,"t":"追風箏的風箏","s":"容祖兒、林欣彤","c":"陳匡榮/江志仁"},{"y":2012,"t":"睡火山","s":"許志安","c":"許志安"},{"y":2012,"t":"愛到透明","s":"許廷鏗","c":"陳輝陽"},{"y":2012,"t":"負藉口","s":"許廷鏗","c":"陳輝陽"},{"y":2012,"t":"夢想天空分外藍","s":"陳奕迅","c":"郭偉亮"},{"y":2012,"t":"精挑細選","s":"葉蒨文","c":"鄭嘉嘉"},{"y":2012,"t":"知更","s":"楊千嬅","c":"朱儁傑"},{"y":2012,"t":"親","s":"楊千嬅","c":"徐繼宗"},{"y":2012,"t":"街燈晚餐","s":"衛蘭","c":"雷頌德"},{"y":2012,"t":"他不慣被愛","s":"衛蘭","c":"楊鎮邦"},{"y":2012,"t":"我懷念的你","s":"衛蘭","c":"雷頌德"},{"y":2012,"t":"難為自己","s":"衛蘭","c":"楊鎮邦"},{"y":2012,"t":"只要我們還有心","s":"衛蘭","c":"畢成功"},{"y":2012,"t":"雙子情歌","s":"羅力威","c":"羅力威"},{"y":2012,"t":"獨行俠侶","s":"蘇永康、謝安琪","c":"馮家俊（Cousin Fung） goldEN"},{"y":2013,"t":"鹽花","s":"Fabel","c":"Fabel"},{"y":2013,"t":"風吹草動","s":"Fabel","c":"馮翰銘"},{"y":2013,"t":"星空","s":"王菀之","c":"王菀之"},{"y":2013,"t":"探花","s":"李克勤","c":"周博賢"},{"y":2013,"t":"談笑風生","s":"車婉婉","c":"楊淽"},{"y":2013,"t":"雙人床的空位","s":"周柏豪","c":"蔣嘉瑩（Kenix Cheang）@Zoo Music"},{"y":2013,"t":"花樽與花","s":"周筆暢","c":"郭頂"},{"y":2013,"t":"也無風雨也無月","s":"林峯","c":"鄧智偉"},{"y":2013,"t":"不負如來不負卿","s":"林峯","c":"鄧智偉"},{"y":2013,"t":"深閨","s":"容祖兒","c":"馮穎琪"},{"y":2013,"t":"Good Morning, Hard City","s":"符致逸","c":"符致逸"},{"y":2013,"t":"用力一抱","s":"梁漢文","c":"楊鎮邦"},{"y":2013,"t":"半邊生命","s":"梁漢文","c":"伍樂城"},{"y":2013,"t":"溫馨提示","s":"張敬軒","c":"廖卓瑩"},{"y":2013,"t":"塵埃落定","s":"張敬軒","c":"澤日生"},{"y":2013,"t":"繭","s":"陳柏宇","c":"陳柏宇"},{"y":2013,"t":"斯德哥爾摩情人","s":"陳奕迅","c":"江志仁"},{"y":2013,"t":"任我行","s":"陳奕迅","c":"澤日生"},{"y":2013,"t":"失憶蝴蝶","s":"陳奕迅","c":"陳曉娟"},{"y":2013,"t":"阿貓阿狗","s":"陳奕迅","c":"馮翰銘"},{"y":2013,"t":"斷。捨。離","s":"陳慧琳","c":"彭海桐"},{"y":2013,"t":"我國","s":"麥家瑜","c":"楊淽"},{"y":2013,"t":"好得很","s":"麥家瑜","c":"澤日生"},{"y":2013,"t":"不要教壞我","s":"麥家瑜","c":"鍾達茵/江志仁"},{"y":2013,"t":"輪到你失眠時","s":"麥家瑜","c":"Ivan Leung"},{"y":2013,"t":"鶴頂紅","s":"麥浚龍","c":"陳珊妮"},{"y":2013,"t":"逆蒼生","s":"麥浚龍、林二汶","c":"甯浩基"},{"y":2013,"t":"太平山下","s":"黃耀明","c":"黃耀明/梁基爵"},{"y":2013,"t":"Thank You","s":"雷頌德","c":"雷頌德"},{"y":2013,"t":"一追再追","s":"鄭秀文","c":"李迪文"},{"y":2013,"t":"盲愛","s":"劉德華、鄭秀文","c":"Hal Beckett，Marc Baril","r":"外"},{"y":2013,"t":"不盲不愛","s":"劉德華、鄭秀文","c":"Hal Beckett/Marc Baril","r":"外"},{"y":2013,"t":"燈下黑","s":"盧凱彤","c":"盧凱彤"},{"y":2013,"t":"圓滑","s":"盧凱彤","c":"盧凱彤"},{"y":2013,"t":"在雨中不能說雨","s":"謝安琪","c":"澤日生"},{"y":2013,"t":"舊好","s":"關楚耀","c":"澤日生"},{"y":2014,"t":"性情中人","s":"JW、蘇永康","c":"雷頌德"},{"y":2014,"t":"生於憂患","s":"KOLOR","c":"Michael Chu/Sammy So"},{"y":2014,"t":"我們他們","s":"王菀之","c":"王菀之"},{"y":2014,"t":"致少年時代","s":"古巨基","c":"方皓玟"},{"y":2014,"t":"沒有花收的日子","s":"吳雨霏","c":"楊淽"},{"y":2014,"t":"一加一","s":"車婉婉","c":"盧廣仲"},{"y":2014,"t":"鬥戰神","s":"陳奕迅","c":"許鏡清"},{"y":2014,"t":"你給我聽好","s":"陳奕迅","c":"林俊杰"},{"y":2014,"t":"最痛無聲","s":"孫耀威","c":"伍樂城"},{"y":2014,"t":"不愛不散","s":"許志安","c":"雷頌德"},{"y":2014,"t":"恃愛行凶","s":"符致逸","c":"符致逸"},{"y":2014,"t":"孤獨天使","s":"符致逸","c":"符致逸"},{"y":2014,"t":"不要怕","s":"符致逸","c":"符致逸"},{"y":2014,"t":"心藥","s":"張德蘭","c":"顧嘉煇"},{"y":2014,"t":"好不容易遇見愛","s":"楊千嬅","c":"郭偉亮/張子堅"},{"y":2014,"t":"撐起雨傘","s":"群星","c":"羅曉彬"},{"y":2014,"t":"兩杯茶","s":"劉美君","c":"楊淽"},{"y":2014,"t":"錯過你","s":"衛蘭","c":"雷頌德"},{"y":2014,"t":"You're Always Everything To Me","s":"衛蘭","c":"Cho Young Soo","r":"韓"},{"y":2014,"t":"長痛短痛","s":"衛蘭","c":"雷頌德"},{"y":2014,"t":"總有一個人","s":"鄭秀文","c":"麥旋璧、歐建星"},{"y":2014,"t":"獨家村","s":"謝安琪","c":"澤日生"},{"y":2014,"t":"孔雀開屏","s":"藍奕邦","c":"藍奕邦"},{"y":2014,"t":"藍田金婚","s":"藍奕邦","c":"藍奕邦"},{"y":2015,"t":"若","s":"AGA","c":"江海迦"},{"y":2015,"t":"生於斯","s":"C AllStar","c":"倫永亮"},{"y":2015,"t":"東西南北","s":"KOLOR","c":"羅灝斌/Sammy So"},{"y":2015,"t":"emoji","s":"Twins","c":"李志源/週週"},{"y":2015,"t":"多情自年少","s":"彭彪","c":"張力"},{"y":2015,"t":"煙花非花","s":"CF@C AllStar、鍾鎮濤","c":"李榮浩"},{"y":2015,"t":"北西南風","s":"太平洋兒童合唱團","c":"羅大佑"},{"y":2015,"t":"我與你","s":"古巨基","c":"古巨基,側田"},{"y":2015,"t":"是有種人","s":"何韻詩","c":"李拾壹"},{"y":2015,"t":"何必呢","s":"陳奕迅","c":"羅大佑"},{"y":2015,"t":"為何要我愛上你","s":"連詩雅","c":"楊鎮邦"},{"y":2015,"t":"過客別墅","s":"張敬軒","c":"周博賢"},{"y":2015,"t":"愛在旁若無人的太空","s":"楊千嬅","c":"郭偉亮"},{"y":2015,"t":"剛剛好","s":"楊千嬅","c":"陳奕迅"},{"y":2015,"t":"風起了","s":"楊千嬅","c":"Anna Lo@Public Zoo"},{"y":2015,"t":"我們是團隊尖兵","s":"群星","c":"羅大佑"},{"y":2015,"t":"炒風吹","s":"群星","c":"羅大佑"},{"y":2015,"t":"誰是張威","s":"群星","c":"羅大佑（Da You Luo）"},{"y":2015,"t":"讓小道消息唱起來","s":"群星","c":"羅大佑"},{"y":2015,"t":"最初的快樂","s":"謝安琪","c":"顧嘉煇"},{"y":2015,"t":"有夢要想－Happily Ever After","s":"謝安琪","c":"Andy Dodd/Adam Watts","r":"外"},{"y":2015,"t":"我要你Happy","s":"麒麟baby","c":"張江"},{"y":2016,"t":"夢","s":"王菲","c":"張亞東"},{"y":2016,"t":"童殿","s":"王菲","c":"Heather Porcaro/竇靖童","r":"混"},{"y":2016,"t":"假面舞會","s":"彭彪","c":"張力"},{"y":2016,"t":"之乎者也","s":"王菀之","c":"羅大佑"},{"y":2016,"t":"四不像","s":"泳兒","c":"周博賢"},{"y":2016,"t":"浮沙之路","s":"泳兒","c":"澤日生"},{"y":2016,"t":"蝙蝠","s":"慶慶","c":"慶慶、G.Z.光澤"},{"y":2016,"t":"新貴","s":"容祖兒","c":"鄺尚開"},{"y":2016,"t":"玩家","s":"容祖兒","c":"陳建樂"},{"y":2016,"t":"大作","s":"草蜢","c":"蔡一傑"},{"y":2016,"t":"兵兵","s":"張智霖、吳業坤","c":"蔣嘉瑩（Kenix Cheang）/舒文"},{"y":2016,"t":"無非一聲掰拜","s":"符致逸","c":"符致逸"},{"y":2016,"t":"我的志願","s":"許廷鏗","c":"陳光榮"},{"y":2016,"t":"劊子手最後一夜","s":"麥浚龍","c":"馮穎琪"},{"y":2016,"t":"髮落無聲","s":"麥浚龍","c":"許哲珮"},{"y":2016,"t":"如來像去","s":"麥浚龍","c":"許哲珮"},{"y":2016,"t":"你前來‧我過去","s":"麥浚龍","c":"周博賢"},{"y":2016,"t":"孽","s":"麥浚龍","c":"周博賢"},{"y":2016,"t":"結","s":"麥浚龍、薛凱琪","c":"王雙駿"},{"y":2016,"t":"尋找消失的過去","s":"黃劍文","c":"周慧敏"},{"y":2016,"t":"其實怕選擇","s":"趙學而","c":"曾奕文/許創基"},{"y":2016,"t":"法西斯情人","s":"潘伯仲","c":"陳輝陽"},{"y":2016,"t":"衝過去","s":"鄭秀文","c":"盧凱彤/鄭秀文"},{"y":2016,"t":"實驗青春","s":"糖妹","c":"糖妹"},{"y":2017,"t":"吃定我","s":"AGA","c":"江海迦"},{"y":2017,"t":"加油","s":"Twins","c":"伍樂城"},{"y":2017,"t":"突然一生人","s":"王菀之","c":"王菀之"},{"y":2017,"t":"忘記有時","s":"王菀之","c":"王菀之"},{"y":2017,"t":"初心","s":"古巨基","c":"林獻凱"},{"y":2017,"t":"和每天講再見","s":"李幸倪","c":"李幸倪"},{"y":2017,"t":"囂","s":"周柏豪","c":"舒文、周俊傑"},{"y":2017,"t":"愛與罪","s":"周殷廷","c":"江海迦"},{"y":2017,"t":"拜託，我不寂寞","s":"側田","c":"鄺梓喬"},{"y":2017,"t":"終身贊助","s":"梁漢文","c":"羅曉彬"},{"y":2017,"t":"纏綿朋友","s":"梁漢文","c":"何秉舜"},{"y":2017,"t":"你哪位","s":"梁漢文","c":"王雙駿"},{"y":2017,"t":"原來我可以哭","s":"許廷鏗","c":"伍樂城"},{"y":2017,"t":"禽獸","s":"麥浚龍","c":"伍樂城"},{"y":2017,"t":"一二三，三二一","s":"楊千嬅","c":"Supper Moment"},{"y":2017,"t":"恨上癮","s":"趙學而","c":"謝浩文、崔雅晴"},{"y":2017,"t":"千色","s":"劉美君","c":"高世章"},{"y":2017,"t":"遺忘","s":"慶慶","c":"慶慶、光澤"},{"y":2017,"t":"驗傷","s":"衛蘭","c":"周錫漢"},{"y":2017,"t":"細細個","s":"衛蘭 Feat.衛詩","c":"徐繼宗"},{"y":2017,"t":"心靈作家","s":"鄧小巧","c":"林家謙"},{"y":2017,"t":"翻牆","s":"盧凱彤","c":"盧凱彤"},{"y":2017,"t":"之所以是你我","s":"盧凱彤","c":"盧凱彤"},{"y":2018,"t":"自我感覺還好","s":"Gin Lee","c":"馮翰銘"},{"y":2018,"t":"天地一沙鷗","s":"Gin Lee","c":"周博賢"},{"y":2018,"t":"侘寂","s":"Gin Lee","c":"江志仁"},{"y":2018,"t":"太空艙","s":"古巨基","c":"方皓玟"},{"y":2018,"t":"亂世情侶","s":"古巨基","c":"陳輝陽"},{"y":2018,"t":"#香港勁揪","s":"古巨基","c":"雷頌德"},{"y":2018,"t":"子華說","s":"古巨基 Feat.黃子華","c":"雷頌德"},{"y":2018,"t":"窮我一生","s":"李晧軒","c":"黃良昇（Larry Wong）"},{"y":2018,"t":"忍","s":"林欣彤","c":"黃良昇（Larry Wong）"},{"y":2018,"t":"問題青年","s":"梁釗峰","c":"陳輝陽"},{"y":2018,"t":"愛比海還深","s":"黃耀明","c":"三木たかし","r":"日"},{"y":2018,"t":"恐怖情人","s":"許廷鏗","c":"雷頌德"},{"y":2018,"t":"白紙","s":"許廷鏗","c":"于逸堯"},{"y":2018,"t":"愛他怕他","s":"陳柏宇","c":"陳柏宇/Michael Fatkin/Gavin Jones","r":"混"},{"y":2018,"t":"終生女友","s":"麥家瑜","c":"蔣嘉瑩（Kenix Cheang）"},{"y":2018,"t":"勇悍．17","s":"麥浚龍","c":"澤日生"},{"y":2018,"t":"困獸．28","s":"麥浚龍","c":"澤日生"},{"y":2018,"t":"暴烈．34","s":"麥浚龍","c":"澤日生"},{"y":2018,"t":"荒原","s":"盧凱彤","c":"盧凱彤"},{"y":2018,"t":"人妻的偽術","s":"謝安琪","c":"雷頌德"},{"y":2019,"t":"波點女皇","s":"王菀之","c":"王菀之"},{"y":2019,"t":"講感情 傷感情","s":"李晧軒","c":"黃良昇（Larry Wong）"},{"y":2019,"t":"最後的信仰","s":"林二汶","c":"藍奕邦"},{"y":2019,"t":"下一位前度","s":"林家謙","c":"澤日生/林家謙"},{"y":2019,"t":"求","s":"徐天佑","c":"徐天佑"},{"y":2019,"t":"值得放棄","s":"符致逸","c":"T-MA/蔣卓嘉/馮允謙"},{"y":2019,"t":"愛放閃","s":"符致逸","c":"符致逸"},{"y":2019,"t":"將心比己","s":"許廷鏗","c":"雷頌德"},{"y":2019,"t":"我們與愛的距離","s":"許廷鏗","c":"馮家俊（Cousin Fung）/黃兆銘"},{"y":2019,"t":"你可能未必不喜歡我","s":"許廷鏗","c":"澤日生"},{"y":2019,"t":"寂寞就如","s":"麥浚龍","c":"徐繼宗"},{"y":2019,"t":"黑盒","s":"麥浚龍、韋羅莎","c":"Coey Young"},{"y":2019,"t":"廢話","s":"麥浚龍、謝安琪","c":"梁柏堅（BERT）"},{"y":2019,"t":"回憶有罪","s":"達明一派","c":"劉以達"},{"y":2019,"t":"其實寂寞","s":"謝安琪","c":"徐繼宗"},{"y":2019,"t":"我們的基因","s":"謝安琪","c":"伍樂城"},{"y":2019,"t":"我在陽台上看你","s":"謝安琪","c":"馮穎琪"},{"y":2020,"t":"碧玉","s":"王菀之","c":"王菀之"},{"y":2020,"t":"無名指的勇氣","s":"林欣彤","c":"齊樂平"},{"y":2020,"t":"拼命無恙","s":"林家謙","c":"林家謙"},{"y":2020,"t":"恨","s":"許廷鏗","c":"溫翰文"},{"y":2020,"t":"謊","s":"許廷鏗","c":"澤日生"},{"y":2020,"t":"賤","s":"許廷鏗","c":"陳考威/JNYBeatz"},{"y":2020,"t":"慌","s":"許廷鏗","c":"梁柏堅（ah bert）"},{"y":2020,"t":"自由之夏","s":"黃耀明","c":"Moon Seung-hyeon","r":"韓"},{"y":2020,"t":"親密距離","s":"劉美君","c":"周博賢"},{"y":2020,"t":"只想死於你身邊","s":"謝安琪","c":"梁柏堅（Bert）"},{"y":2020,"t":"廢柴","s":"小肥","c":"陳輝陽"},{"y":2020,"t":"你好嗎","s":"方皓玟","c":"徐繼宗"},{"y":2021,"t":"自白的勇氣","s":"林二汶","c":"林二汶"},{"y":2021,"t":"最好好好講再見","s":"陳天翺","c":"陳天翺（Eagle Chan）"},{"y":2021,"t":"佛系人生","s":"許廷鏗","c":"黃兆銘"},{"y":2021,"t":"一個人的地球","s":"張敬軒","c":"Walter Kwan"},{"y":2021,"t":"別放棄治療","s":"連詩雅","c":"海悅/易子竣/朱琳"},{"y":2021,"t":"我的男朋友","s":"達明一派","c":"黃耀明/劉以達/蔡德才"},{"y":2021,"t":"你為何還未睡","s":"鄧思朗","c":"溫翰文"},{"y":2021,"t":"海底隧道","s":"KOLOR","c":"Sammy So"},{"y":2021,"t":"推理的愛","s":"YUTA","c":"WE5"},{"y":2022,"t":"某種老朋友","s":"林家謙","c":"澤日生"},{"y":2022,"t":"有今生沒來世","s":"許廷鏗","c":"朱敏希"},{"y":2022,"t":"沒有人可以為你的幸福負責","s":"許廷鏗","c":"朱敏希"},{"y":2022,"t":"煽風點火","s":"許廷鏗","c":"朱儁傑"},{"y":2022,"t":"修羅場","s":"許廷鏗","c":"陳慧敏"},{"y":2022,"t":"旁聽他人的秘密","s":"許廷鏗","c":"徐偉賢"},{"y":2022,"t":"都是別人的","s":"許廷鏗","c":"吳林峯"},{"y":2022,"t":"小奇蹟日","s":"許廷鏗","c":"陳考威（JNYBeatz）"},{"y":2022,"t":"52赫茲","s":"KOLOR","c":"羅建彬（Robin Law）"},{"y":2022,"t":"未生","s":"吳林峰","c":"吳林峯"},{"y":2023,"t":"怪我只敢做好人","s":"林家謙","c":"林家謙"},{"y":2023,"t":"有色眼鏡","s":"林家謙","c":"林家謙"},{"y":2023,"t":"第幾位前任","s":"林家謙","c":"澤日生/林家謙"},{"y":2023,"t":"百妖夜行的修行","s":"陳凱詠","c":"陳凱詠（JACE）"},{"y":2023,"t":"拯救我自己","s":"陳慧敏","c":"陳考威"},{"y":2024,"t":"普通人","s":"劉威煌","c":"澤日生"},{"y":2024,"t":"善良之歌","s":"Pandora","c":"Pandora"},{"y":2024,"t":"請尊重你身體","s":"RU","c":"林夕"},{"y":2024,"t":"莊敬自強（之無路可逃）","s":"杜汶澤","c":"李宜蒼"},{"y":2024,"t":"夏日之子","s":"林家謙","c":"林家謙"},{"y":2024,"t":"清白之身","s":"陳凱詠","c":"謝芊彤"},{"y":2024,"t":"只得一半","s":"鄭杞瑤","c":"于逸堯"},{"y":2024,"t":"我們都（可以）是天使","s":"謝雅兒","c":"林家謙"},{"y":2025,"t":"十年如一日","s":"陳慧敏","c":"澤日生"},{"y":2020,"t":"開錯燈","s":"Gin Lee 李幸倪","c":"李幸倪"},{"y":2020,"t":"敢","s":"Gin Lee 李幸倪","c":"李幸倪/周博賢"},{"y":2020,"t":"開燈．熄燈（開燈版）","s":"Gin Lee 李幸倪","c":"李幸倪"},{"y":2020,"t":"開燈．熄燈（熄燈版）","s":"Gin Lee 李幸倪","c":"李幸倪"},{"y":2020,"t":"美男子與香煙","s":"Gin Lee 李幸倪","c":"周博賢"},{"y":2020,"t":"別人的家","s":"Gin Lee 李幸倪","c":"周博賢/澤日生/李幸倪"},{"y":2021,"t":"何日不再來","s":"Stephy Tang 鄧麗欣","c":"陳輝陽"},{"y":2020,"t":"搬","s":"Gin Lee 李幸倪","c":"澤日生"},{"y":2020,"t":"成家","s":"Gin Lee 李幸倪","c":"周博賢/澤日生"},{"y":2024,"t":"成長的錯","s":"古巨基及告五人","c":"告五人雲安"},{"y":2025,"t":"我呢","s":"馬天佑","c":"Chelsea Rodgers"},{"y":2024,"t":"沒完沒了的完美","s":"何超與海膽仔","c":"陳匡榮"},{"y":2026,"t":"梨子 Father's touch","s":"陳健安 On Chan","c":"陳健安"},{"y":2025,"t":"下次不如相信自己一次","s":"COLLAR","c":"徐繼宗"},{"y":2025,"t":"相紙","s":"AGA 江海迦","c":"江海迦"},{"y":2025,"t":"不要逼我有關係","s":"AGA 江海迦","c":"江海迦"},{"y":2025,"t":"鐵石人生","s":"AGA 江海迦","c":"江海迦"},{"y":2025,"t":"一樓","s":"AGA 江海迦","c":"江海迦"},{"y":2025,"t":"Crying in 7-11","s":"AGA 江海迦","c":"江海迦"},{"y":2025,"t":"You don't have to be so...","s":"AGA 江海迦","c":"江海迦"},{"y":2025,"t":"星期六，不見不散","s":"AGA 江海迦","c":"江海迦"},{"y":2025,"t":"Where am I?","s":"AGA 江海迦","c":"江海迦"},{"y":2025,"t":"喝完了，再見","s":"AGA 江海迦","c":"江海迦"},{"y":2025,"t":"Gas Station Diner","s":"AGA 江海迦","c":"江海迦"},{"y":2025,"t":"沒有咖啡的喫茶店","s":"AGA 江海迦","c":"江海迦"},{"y":2025,"t":"Unfamiliar City","s":"AGA 江海迦","c":"江海迦"},{"y":2025,"t":"DRUNK DIAL","s":"AGA 江海迦","c":"江海迦"},{"y":2023,"t":"以為只是沒送花","s":"Denis Kwok 193","c":"黃良昇（Larry Wong）"},{"y":2021,"t":"辛苦你了","s":"容祖兒","c":"徐繼宗"},{"y":2021,"t":"煙花紀","s":"容祖兒","c":"蔣嘉瑩（Kenix Cheang）/舒文@Zoo Music"},{"y":2021,"t":"遲了悔改 Regret","s":"周殷廷","c":"徐浩"}];
const T2S={"禍":"祸","鮮":"鲜","榮":"荣","腳":"脚","術":"术","協":"协","豐":"丰","鴦":"鸯","驗":"验","鳴":"鸣","喫":"吃","猶":"犹","選":"选","競":"竞","蘭":"兰","倖":"幸","峯":"峰","嬌":"娇","釋":"释","寶":"宝","麼":"么","動":"动","紐":"纽","則":"则","盧":"卢","終":"终","偽":"伪","墮":"堕","艙":"舱","倫":"伦","貓":"猫","無":"无","險":"险","樸":"朴","蟻":"蚁","學":"学","隸":"隶","軍":"军","鱲":"𫚭","捨":"舍","鋒":"锋","懷":"怀","諺":"谚","慶":"庆","佔":"占","澤":"泽","擺":"摆","劊":"刽","說":"说","濃":"浓","換":"换","達":"达","籃":"篮","頌":"颂","塵":"尘","遲":"迟","專":"专","實":"实","黨":"党","騷":"骚","鋼":"钢","昇":"升","隨":"随","掛":"挂","點":"点","慄":"栗","貪":"贪","問":"问","還":"还","麵":"面","島":"岛","蓮":"莲","軟":"软","梘":"枧","編":"编","畢":"毕","聶":"聂","軒":"轩","隊":"队","鍾":"钟","傳":"传","寬":"宽","責":"责","楊":"杨","煩":"烦","沖":"冲","賓":"宾","戀":"恋","禱":"祷","燈":"灯","關":"关","輔":"辅","鵬":"鹏","係":"系","記":"记","賢":"贤","錦":"锦","堯":"尧","髮":"发","議":"议","經":"经","顧":"顾","詠":"咏","彥":"彦","寵":"宠","獻":"献","紀":"纪","媽":"妈","擁":"拥","雛":"雏","黃":"黄","聲":"声","娛":"娱","諾":"诺","嘍":"喽","別":"别","潔":"洁","純":"纯","吳":"吴","潤":"润","準":"准","兩":"两","殺":"杀","湧":"涌","歐":"欧","虛":"虚","惱":"恼","縫":"缝","視":"视","紅":"红","鄭":"郑","濕":"湿","勁":"劲","衛":"卫","罷":"罢","雲":"云","遙":"遥","纏":"缠","窮":"穷","燭":"烛","聰":"聪","邁":"迈","嬈":"娆","贊":"赞","眾":"众","誼":"谊","討":"讨","團":"团","蘢":"茏","訊":"讯","隱":"隐","償":"偿","聞":"闻","頂":"顶","誡":"诫","厭":"厌","楓":"枫","見":"见","飛":"飞","認":"认","傾":"倾","憑":"凭","鉑":"铂","臉":"脸","錫":"锡","時":"时","資":"资","蹟":"迹","電":"电","頭":"头","裏":"里","諒":"谅","謂":"谓","誠":"诚","談":"谈","葉":"叶","凱":"凯","岡":"冈","續":"续","齡":"龄","繭":"茧","盡":"尽","傑":"杰","鑑":"鉴","悶":"闷","鏢":"镖","慘":"惨","於":"于","藝":"艺","譽":"誉","癲":"癫","廬":"庐","螞":"蚂","嚴":"严","飯":"饭","環":"环","煒":"炜","羅":"罗","勝":"胜","訓":"训","譜":"谱","鶴":"鹤","啟":"启","戇":"戆","鴻":"鸿","雙":"双","餅":"饼","節":"节","郵":"邮","癢":"痒","養":"养","龔":"龚","啞":"哑","蒼":"苍","話":"话","觸":"触","趙":"赵","鮑":"鲍","線":"线","亂":"乱","蕩":"荡","馳":"驰","貼":"贴","匯":"汇","調":"调","瓊":"琼","韻":"韵","護":"护","詳":"详","潑":"泼","暐":"𬀩","寧":"宁","鳳":"凤","夠":"够","奐":"奂","賽":"赛","誕":"诞","靜":"静","綺":"绮","義":"义","離":"离","靈":"灵","轉":"转","種":"种","債":"债","聽":"听","釀":"酿","暫":"暂","創":"创","雞":"鸡","謠":"谣","揚":"扬","蠻":"蛮","喬":"乔","詩":"诗","兒":"儿","軸":"轴","過":"过","簡":"简","許":"许","燻":"熏","觀":"观","竇":"窦","歷":"历","霑":"沾","託":"托","齣":"出","茲":"兹","請":"请","莊":"庄","輕":"轻","勳":"勋","蘊":"蕴","將":"将","牆":"墙","週":"周","嗎":"吗","欽":"钦","顏":"颜","異":"异","鬱":"郁","鬧":"闹","識":"识","灑":"洒","麗":"丽","題":"题","頓":"顿","誰":"谁","膽":"胆","憶":"忆","盪":"荡","瘋":"疯","計":"计","躍":"跃","鑽":"钻","廣":"广","負":"负","癡":"痴","櫻":"樱","歲":"岁","洩":"泄","統":"统","緋":"绯","凍":"冻","樂":"乐","煥":"焕","駿":"骏","飄":"飘","療":"疗","蟄":"蛰","筆":"笔","樹":"树","瑤":"瑶","漢":"汉","孫":"孙","擊":"击","價":"价","會":"会","並":"并","槍":"枪","撲":"扑","鏡":"镜","購":"购","喚":"唤","領":"领","剛":"刚","開":"开","啓":"启","劃":"划","場":"场","謊":"谎","沒":"没","樑":"梁","騙":"骗","賊":"贼","鹽":"盐","後":"后","恆":"恒","閃":"闪","燦":"灿","監":"监","謝":"谢","憂":"忧","預":"预","細":"细","給":"给","東":"东","證":"证","懶":"懒","繼":"继","劇":"剧","遺":"遗","屬":"属","講":"讲","潛":"潜","誘":"诱","為":"为","曉":"晓","姍":"姗","費":"费","灣":"湾","艷":"艳","尋":"寻","鏗":"铿","壓":"压","撐":"撑","裝":"装","蹤":"踪","氣":"气","撈":"捞","緩":"缓","雜":"杂","處":"处","從":"从","園":"园","號":"号","臺":"台","舊":"旧","紹":"绍","璉":"琏","師":"师","蕭":"萧","邊":"边","權":"权","脫":"脱","爺":"爷","貫":"贯","範":"范","碩":"硕","愛":"爱","曖":"暧","韜":"韬","貞":"贞","維":"维","塗":"涂","闢":"辟","圖":"图","帶":"带","銀":"银","龍":"龙","瑩":"莹","禿":"秃","賴":"赖","箏":"筝","謀":"谋","儀":"仪","獨":"独","搖":"摇","讓":"让","蘇":"苏","決":"决","風":"风","糾":"纠","囂":"嚣","豬":"猪","複":"复","興":"兴","發":"发","聖":"圣","渦":"涡","鷹":"鹰","側":"侧","極":"极","鴉":"鸦","壞":"坏","閒":"闲","溫":"温","據":"据","畫":"画","車":"车","悅":"悦","頑":"顽","與":"与","買":"买","驃":"骠","讀":"读","冊":"册","窩":"窝","應":"应","嘩":"哗","類":"类","機":"机","慾":"欲","暢":"畅","罰":"罚","鳥":"鸟","樣":"样","鄒":"邹","殘":"残","圓":"圆","捱":"挨","藥":"药","區":"区","唸":"念","絲":"丝","牽":"牵","嘆":"叹","爭":"争","總":"总","譚":"谭","紙":"纸","呂":"吕","鈞":"钧","慣":"惯","灝":"灏","級":"级","規":"规","韋":"韦","鴛":"鸳","顆":"颗","靂":"雳","戰":"战","堅":"坚","麥":"麦","儁":"俊","變":"变","萬":"万","圍":"围","嚨":"咙","亞":"亚","丟":"丢","諗":"谂","湯":"汤","淺":"浅","復":"复","這":"这","奮":"奋","現":"现","樓":"楼","蟬":"蝉","甯":"宁","難":"难","勞":"劳","廢":"废","馮":"冯","聯":"联","熾":"炽","賤":"贱","遠":"远","對":"对","語":"语","綠":"绿","輪":"轮","輝":"辉","個":"个","廂":"厢","當":"当","內":"内","顛":"颠","爛":"烂","斷":"断","寫":"写","粵":"粤","幹":"干","國":"国","連":"连","貴":"贵","錢":"钱","迴":"回","侶":"侣","齊":"齐","備":"备","煙":"烟","驚":"惊","親":"亲","體":"体","擾":"扰","淚":"泪","順":"顺","蠍":"蝎","單":"单","詭":"诡","緊":"紧","數":"数","獸":"兽","嫻":"娴","滾":"滚","劍":"剑","擇":"择","夢":"梦","課":"课","敵":"敌","綿":"绵","貝":"贝","賈":"贾","蝦":"虾","彈":"弹","囉":"啰","鎮":"镇","輸":"输","竅":"窍","瑋":"玮","傘":"伞","勵":"励","歸":"归","業":"业","們":"们","俠":"侠","願":"愿","讚":"赞","幫":"帮","參":"参","暉":"晖","蔥":"葱","錯":"错","閏":"闰","歡":"欢","嵐":"岚","陸":"陆","鷗":"鸥","樺":"桦","瞞":"瞒","妝":"妆","絕":"绝","華":"华","覺":"觉","書":"书","衝":"冲","驕":"骄","慳":"悭","傷":"伤","蟲":"虫","張":"张","飲":"饮","鸞":"鸾","縱":"纵","穎":"颖","銘":"铭","懲":"惩","鐘":"钟","賞":"赏","贈":"赠","蘋":"苹","試":"试","爾":"尔","條":"条","煇":"𪸩","釗":"钊","鄺":"邝","馬":"马","緣":"缘","熱":"热","駒":"驹","劉":"刘","濤":"涛","騰":"腾","臨":"临","戲":"戏","餘":"余","鄧":"邓","強":"强","錄":"录","標":"标","緒":"绪","禮":"礼","進":"进","來":"来","蔣":"蒋","辦":"办","燙":"烫","翹":"翘","惡":"恶","幾":"几","評":"评","濟":"济","賣":"卖","嶽":"岳","剎":"刹","鬥":"斗","結":"结","乾":"干","癮":"瘾","宮":"宫","鐵":"铁","門":"门","論":"论","謙":"谦","長":"长","魚":"鱼","閉":"闭","運":"运","軌":"轨","滿":"满","陽":"阳","訴":"诉","間":"间","閨":"闺","偉":"伟","藍":"蓝","遊":"游","習":"习","陳":"陈","橋":"桥","約":"约","棄":"弃"};
const HOT_SINGERS=["楊千嬅","古巨基","陳奕迅","黎明","許志安","Twins","容祖兒","鄭秀文","梁漢文","陳慧琳","張國榮","黃耀明","周華健","謝霆鋒","王菲","劉德華","衛蘭","杜德偉","蘇永康","鄭伊健","彭羚","陳曉東","梁詠琪","李克勤","麥浚龍","郭富城","關心妍","王菀之","許廷鏗"];
const HOT_COMPOSERS=["雷頌德","伍樂城","陳輝陽","徐日勤","江志仁","郭偉亮","陳光榮","周華健","王菀之","澤日生","謝霆鋒","黃丹儀","黃耀光","吳國敬","羅大佑","黃尚偉","于逸堯","周博賢","側田","李迪文","伍仲衡","張國榮","王雙駿","柳重言","江海迦","陳小霞","辛偉力","舒文","花比傲","金培達","杜自持","徐繼宗","劉以達","張佳添","黃嘉倩","李偲菘","梁基爵","馮翰銘","李宗盛","唐奕聰","倫永亮","趙增熹","張亞東","黃國倫","陳偉文","馮穎琪","楊鎮邦","謝國維"];

// --- Morandi Palette ---
const C = {
  bg: "#f0ece4",
  card: "#e8e2d8",
  cardHover: "#dfd8cb",
  border: "#d1c9ba",
  text: "#4a4640",
  textMid: "#7a746b",
  textLight: "#a39d93",
  accent: "#8b7e74",
  accentSoft: "#b5a99b",
  tag: "#c5b9a8",
  tagText: "#6b6158",
  pink: "#c4a6a0",
  green: "#a3b0a0",
  blue: "#9aabb8",
  lavender: "#b0a5b8",
  white: "#faf8f4",
  shadow: "rgba(74,70,64,0.06)",
  pillBg: "#e2dbd0",
  pillActive: "#8b7e74",
  pillActiveText: "#faf8f4",
  link: "#7a6e63",
  linkHover: "#5a4f44",
};

const SOURCE_LABELS = {
  "日": { label: "日本", color: C.pink },
  "韓": { label: "韓國", color: C.lavender },
  "外": { label: "歐美", color: C.blue },
  "混": { label: "中外合作", color: C.green },
  "泰": { label: "泰國", color: C.accentSoft },
  "法": { label: "法國", color: C.blue },
  "美": { label: "美國", color: C.blue },
};

const TABS = [
  { id: "singer", label: "按歌手" },
  { id: "composer", label: "按作曲" },
  { id: "year", label: "按年份" },
  { id: "cross", label: "交叉查詢" },
  { id: "stats", label: "統計" },
];

// ============================================================
// 繁簡互通
// ============================================================
function toSimplified(str) {
  if (!str || typeof T2S === "undefined") return (str || "").toLowerCase();
  return [...str].map(ch => T2S[ch] || ch).join("").toLowerCase();
}
function matchQuery(text, query) {
  if (!query) return true;
  return toSimplified(text).includes(toSimplified(query));
}

// ============================================================
// Utility
// ============================================================
function buildIndex(songs) {
  const singers = {}, composers = {}, years = {};
  songs.forEach((s, i) => {
    if (s.s) { if (!singers[s.s]) singers[s.s] = []; singers[s.s].push(i); }
    if (s.c) { if (!composers[s.c]) composers[s.c] = []; composers[s.c].push(i); }
    if (s.y) { if (!years[s.y]) years[s.y] = []; years[s.y].push(i); }
  });
  return { singers, composers, years };
}
function sortedEntries(obj) {
  return Object.entries(obj).sort((a, b) => b[1].length - a[1].length);
}

// ============================================================
// Shared Components
// ============================================================
function Tag({ label, color }) {
  return (
    <span style={{
      display: "inline-block", fontSize: 11, padding: "1px 6px",
      borderRadius: 3, background: color || C.tag, color: C.tagText,
      marginLeft: 6, verticalAlign: "middle", fontWeight: 500,
    }}>{label}</span>
  );
}

function SearchInput({ value, onChange, placeholder }) {
  return (
    <div style={{ position: "relative", marginBottom: 12 }}>
      <input type="text" value={value} onChange={e => onChange(e.target.value)}
        placeholder={placeholder}
        style={{
          width: "100%", boxSizing: "border-box",
          padding: "10px 14px 10px 36px",
          border: `1px solid ${C.border}`, borderRadius: 8,
          background: C.white, color: C.text, fontSize: 14,
          outline: "none", fontFamily: "inherit",
        }}
      />
      <span style={{
        position: "absolute", left: 12, top: "50%", transform: "translateY(-50%)",
        color: C.textLight, fontSize: 15, pointerEvents: "none",
      }}>⌕</span>
    </div>
  );
}

function NameList({ entries, onSelect, selected, labelSuffix = "首" }) {
  return (
    <div style={{
      maxHeight: 420, overflowY: "auto",
      border: `1px solid ${C.border}`, borderRadius: 8, background: C.white,
    }}>
      {entries.map(([name, indices]) => {
        const isActive = selected === name;
        return (
          <div key={name} onClick={() => onSelect(name)}
            style={{
              padding: "9px 14px", cursor: "pointer",
              background: isActive ? C.card : "transparent",
              borderBottom: `1px solid ${C.border}`,
              display: "flex", justifyContent: "space-between", alignItems: "center",
              transition: "background .15s",
            }}
            onMouseEnter={e => { if (!isActive) e.currentTarget.style.background = C.cardHover; }}
            onMouseLeave={e => { if (!isActive) e.currentTarget.style.background = "transparent"; }}
          >
            <span style={{ color: C.text, fontSize: 14 }}>{name}</span>
            <span style={{ color: C.textLight, fontSize: 12 }}>{indices.length} {labelSuffix}</span>
          </div>
        );
      })}
      {entries.length === 0 && (
        <div style={{ padding: 20, textAlign: "center", color: C.textLight, fontSize: 13 }}>無結果</div>
      )}
    </div>
  );
}

// ============================================================
// Clickable Name (link-style text for drill-down)
// ============================================================
function ClickableName({ name, onClick, color }) {
  if (!name || !onClick) return <span style={{ color: color || C.textMid }}>{name || "—"}</span>;
  return (
    <span
      onClick={(e) => { e.stopPropagation(); onClick(name); }}
      style={{
        color: C.link, cursor: "pointer",
        borderBottom: `1px dashed ${C.border}`,
        transition: "color .15s",
      }}
      onMouseEnter={e => { e.currentTarget.style.color = C.linkHover; e.currentTarget.style.borderBottomColor = C.linkHover; }}
      onMouseLeave={e => { e.currentTarget.style.color = C.link; e.currentTarget.style.borderBottomColor = C.border; }}
    >{name}</span>
  );
}

// ============================================================
// Breadcrumb
// ============================================================
function Breadcrumb({ stack, onNavigate }) {
  if (!stack || stack.length === 0) return null;
  return (
    <div style={{
      display: "flex", alignItems: "center", gap: 4, flexWrap: "wrap",
      marginBottom: 10, fontSize: 13, color: C.textMid,
    }}>
      {stack.map((item, i) => (
        <span key={i} style={{ display: "flex", alignItems: "center", gap: 4 }}>
          {i > 0 && <span style={{ color: C.textLight }}>›</span>}
          {i < stack.length - 1 ? (
            <span
              onClick={() => onNavigate(i)}
              style={{ color: C.link, cursor: "pointer", borderBottom: `1px dashed ${C.border}` }}
            >{item.label}</span>
          ) : (
            <span style={{ color: C.text, fontWeight: 600 }}>{item.label}</span>
          )}
        </span>
      ))}
    </div>
  );
}

// ============================================================
// DrillDown Song Table (with clickable singer & composer)
// ============================================================
const thStyle = {
  padding: "8px 10px", fontWeight: 600, color: C.text, fontSize: 12,
  letterSpacing: 0.5, borderBottom: `2px solid ${C.border}`, textAlign: "center",
};
const tdStyle = { padding: "8px 10px", color: C.text };

function SongTable({ songs, data, showSinger = true, showComposer = true, showYear = true, onClickSinger, onClickComposer, onClickYear }) {
  if (!songs || songs.length === 0) {
    return <div style={{ padding: 20, color: C.textLight, fontSize: 13, textAlign: "center" }}>選擇項目查看作品</div>;
  }
  const sorted = [...songs].sort((a, b) => (data[a].y || 0) - (data[b].y || 0));
  return (
    <div style={{ maxHeight: 480, overflowY: "auto", border: `1px solid ${C.border}`, borderRadius: 8, background: C.white }}>
      <table style={{ width: "100%", borderCollapse: "collapse", fontSize: 13 }}>
        <thead>
          <tr style={{ background: C.card, position: "sticky", top: 0, zIndex: 1 }}>
            {showYear && <th style={thStyle}>年份</th>}
            <th style={{ ...thStyle, textAlign: "left" }}>歌曲</th>
            {showSinger && <th style={{ ...thStyle, textAlign: "left" }}>歌手</th>}
            {showComposer && <th style={{ ...thStyle, textAlign: "left" }}>作曲</th>}
          </tr>
        </thead>
        <tbody>
          {sorted.map((idx, i) => {
            const s = data[idx];
            const src = s.r && SOURCE_LABELS[s.r];
            return (
              <tr key={i} style={{ borderBottom: `1px solid ${C.border}` }}
                onMouseEnter={e => e.currentTarget.style.background = C.cardHover}
                onMouseLeave={e => e.currentTarget.style.background = "transparent"}>
                {showYear && <td style={{ ...tdStyle, width: 50, textAlign: "center" }}>
                  {onClickYear ? <ClickableName name={String(s.y)} onClick={(v) => onClickYear(Number(v))} color={C.textMid} /> : <span style={{ color: C.textMid }}>{s.y}</span>}
                </td>}
                <td style={tdStyle}>{s.t}{src && <Tag label={src.label} color={src.color} />}</td>
                {showSinger && <td style={tdStyle}>
                  <ClickableName name={s.s} onClick={onClickSinger} color={C.textMid} />
                </td>}
                {showComposer && <td style={tdStyle}>
                  {s.c ? <ClickableName name={s.c} onClick={onClickComposer} color={C.textMid} /> : <span style={{ color: C.textLight }}>—</span>}
                </td>}
              </tr>
            );
          })}
        </tbody>
      </table>
    </div>
  );
}

// ============================================================
// DrillDown View (shows a person's songs with full navigation)
// ============================================================
function DrillDownView({ type, name, data, index, onClickSinger, onClickComposer, onClickYear }) {
  const songs = type === "singer" ? (index.singers[name] || [])
    : type === "composer" ? (index.composers[name] || [])
    : type === "year" ? (index.years[Number(name)] || index.years[name] || [])
    : [];
  // singer view: hide singer col, show composer+year; composer view: hide composer col; year view: hide year col
  const showSinger = type !== "singer";
  const showComposer = type !== "composer";
  const showYear = type !== "year";
  return (
    <div>
      <div style={{ marginBottom: 8, color: C.textMid, fontSize: 13 }}>
        {type === "year" ? `${name} 年：林夕該年 ${songs.length} 首作品`
          : type === "singer" ? `${name}：${songs.length} 首粵語作品`
          : `${name}：與林夕合作 ${songs.length} 首`}
      </div>
      <SongTable
        songs={songs} data={data}
        showSinger={showSinger} showComposer={showComposer} showYear={showYear}
        onClickSinger={onClickSinger} onClickComposer={onClickComposer} onClickYear={onClickYear}
      />
    </div>
  );
}

// ============================================================
// Hook: useNavStack (shared drill-down logic)
// ============================================================
function useNavStack() {
  const [stack, setStack] = useState([]);

  const push = useCallback((type, name) => {
    setStack(prev => {
      if (prev.length > 0 && prev[prev.length - 1].type === type && prev[prev.length - 1].name === name) return prev;
      const label = type === "year" ? `${name} 年` : name;
      return [...prev, { type, name, label }];
    });
  }, []);

  const navigateTo = useCallback((idx) => {
    setStack(prev => prev.slice(0, idx + 1));
  }, []);

  const clear = useCallback(() => setStack([]), []);

  const current = stack.length > 0 ? stack[stack.length - 1] : null;

  return { stack, push, navigateTo, clear, current };
}

// ============================================================
// Tab: 按歌手
// ============================================================
function TabSinger({ data, index }) {
  const [search, setSearch] = useState("");
  const [selected, setSelected] = useState(null);
  const nav = useNavStack();

  const filtered = useMemo(() => {
    const all = sortedEntries(index.singers);
    if (!search.trim()) return all;
    return all.filter(([name]) => matchQuery(name, search.trim()));
  }, [index.singers, search]);

  const songs = selected ? index.singers[selected] : null;

  const handleSelect = (name) => {
    setSelected(name);
    nav.clear();
  };

  const handleClickComposer = (name) => {
    if (index.composers[name]) {
      if (nav.stack.length === 0 && selected) {
        // Push the initial singer first, then the composer
        nav.push("singer", selected);
      }
      nav.push("composer", name);
    }
  };

  const handleClickSinger = (name) => {
    if (index.singers[name]) {
      nav.push("singer", name);
    }
  };

  const handleClickYear = (year) => {
    if (index.years[year]) {
      if (nav.stack.length === 0 && selected) {
        nav.push("singer", selected);
      }
      nav.push("year", String(year));
    }
  };

  // If nav stack is active, show drill-down view
  const showDrillDown = nav.current !== null;

  return (
    <div style={{ display: "flex", gap: 16, minHeight: 400, flexWrap: "wrap" }}>
      <div style={{ width: 260, flexShrink: 0 }}>
        <SearchInput value={search} onChange={setSearch} placeholder="搜尋歌手（繁簡皆可）…" />
        <NameList entries={filtered} onSelect={handleSelect} selected={selected} />
      </div>
      <div style={{ flex: 1, minWidth: 0 }}>
        {showDrillDown ? (
          <>
            <Breadcrumb stack={nav.stack} onNavigate={(idx) => nav.navigateTo(idx)} />
            <DrillDownView
              type={nav.current.type} name={nav.current.name}
              data={data} index={index}
              onClickSinger={handleClickSinger} onClickComposer={handleClickComposer} onClickYear={handleClickYear}
            />
          </>
        ) : (
          <>
            {selected && <div style={{ marginBottom: 8, color: C.textMid, fontSize: 13 }}>{selected}：{songs.length} 首粵語作品</div>}
            <SongTable songs={songs} data={data} showSinger={false}
              onClickComposer={handleClickComposer} onClickYear={handleClickYear} />
          </>
        )}
      </div>
    </div>
  );
}

// ============================================================
// Tab: 按作曲
// ============================================================
function TabComposer({ data, index }) {
  const [search, setSearch] = useState("");
  const [selected, setSelected] = useState(null);
  const nav = useNavStack();

  const filtered = useMemo(() => {
    const all = sortedEntries(index.composers);
    if (!search.trim()) return all;
    return all.filter(([name]) => matchQuery(name, search.trim()));
  }, [index.composers, search]);

  const songs = selected ? index.composers[selected] : null;

  const handleSelect = (name) => {
    setSelected(name);
    nav.clear();
  };

  const handleClickSinger = (name) => {
    if (index.singers[name]) {
      if (nav.stack.length === 0 && selected) {
        nav.push("composer", selected);
      }
      nav.push("singer", name);
    }
  };

  const handleClickComposer = (name) => {
    if (index.composers[name]) {
      nav.push("composer", name);
    }
  };

  const handleClickYear = (year) => {
    if (index.years[year]) {
      if (nav.stack.length === 0 && selected) {
        nav.push("composer", selected);
      }
      nav.push("year", String(year));
    }
  };

  const showDrillDown = nav.current !== null;

  return (
    <div style={{ display: "flex", gap: 16, minHeight: 400, flexWrap: "wrap" }}>
      <div style={{ width: 260, flexShrink: 0 }}>
        <SearchInput value={search} onChange={setSearch} placeholder="搜尋作曲人（繁簡皆可）…" />
        <NameList entries={filtered} onSelect={handleSelect} selected={selected} />
      </div>
      <div style={{ flex: 1, minWidth: 0 }}>
        {showDrillDown ? (
          <>
            <Breadcrumb stack={nav.stack} onNavigate={(idx) => nav.navigateTo(idx)} />
            <DrillDownView
              type={nav.current.type} name={nav.current.name}
              data={data} index={index}
              onClickSinger={handleClickSinger} onClickComposer={handleClickComposer} onClickYear={handleClickYear}
            />
          </>
        ) : (
          <>
            {selected && <div style={{ marginBottom: 8, color: C.textMid, fontSize: 13 }}>{selected}：與林夕合作 {songs.length} 首</div>}
            <SongTable songs={songs} data={data} showComposer={false}
              onClickSinger={handleClickSinger} onClickYear={handleClickYear} />
          </>
        )}
      </div>
    </div>
  );
}

// ============================================================
// Tab: 按年份
// ============================================================
function TabYear({ data, index }) {
  const [selected, setSelected] = useState(null);
  const nav = useNavStack();

  const yearList = useMemo(() =>
    Object.entries(index.years).map(([y, ids]) => [Number(y), ids]).sort((a, b) => b[0] - a[0]),
    [index.years]
  );
  const songs = selected !== null ? index.years[selected] : null;

  const handleSelect = (year) => { setSelected(year); nav.clear(); };

  const handleClickSinger = (name) => {
    if (index.singers[name]) {
      if (nav.stack.length === 0 && selected !== null) {
        nav.push("year", String(selected));
      }
      nav.push("singer", name);
    }
  };
  const handleClickComposer = (name) => {
    if (index.composers[name]) {
      if (nav.stack.length === 0 && selected !== null) {
        nav.push("year", String(selected));
      }
      nav.push("composer", name);
    }
  };

  const handleClickYear = (year) => {
    if (index.years[year]) {
      nav.push("year", String(year));
    }
  };

  const showDrillDown = nav.current !== null;

  return (
    <div style={{ display: "flex", gap: 16, minHeight: 400, flexWrap: "wrap" }}>
      <div style={{ width: 200, flexShrink: 0 }}>
        <div style={{ maxHeight: 480, overflowY: "auto", border: `1px solid ${C.border}`, borderRadius: 8, background: C.white }}>
          {yearList.map(([year, ids]) => {
            const isActive = selected === year;
            return (
              <div key={year} onClick={() => handleSelect(year)}
                style={{
                  padding: "9px 14px", cursor: "pointer",
                  background: isActive ? C.card : "transparent",
                  borderBottom: `1px solid ${C.border}`,
                  display: "flex", justifyContent: "space-between", alignItems: "center",
                }}
                onMouseEnter={e => { if (!isActive) e.currentTarget.style.background = C.cardHover; }}
                onMouseLeave={e => { if (!isActive) e.currentTarget.style.background = "transparent"; }}>
                <span style={{ color: C.text, fontSize: 14, fontWeight: 500 }}>{year}</span>
                <span style={{ color: C.textLight, fontSize: 12 }}>{ids.length} 首</span>
              </div>
            );
          })}
        </div>
      </div>
      <div style={{ flex: 1, minWidth: 0 }}>
        {showDrillDown ? (
          <>
            <Breadcrumb stack={nav.stack} onNavigate={(idx) => nav.navigateTo(idx)} />
            <DrillDownView
              type={nav.current.type} name={nav.current.name}
              data={data} index={index}
              onClickSinger={handleClickSinger} onClickComposer={handleClickComposer} onClickYear={handleClickYear}
            />
          </>
        ) : (
          <>
            {selected !== null && <div style={{ marginBottom: 8, color: C.textMid, fontSize: 13 }}>{selected} 年：{songs.length} 首作品</div>}
            <SongTable songs={songs} data={data} showYear={false}
              onClickSinger={handleClickSinger} onClickComposer={handleClickComposer} />
          </>
        )}
      </div>
    </div>
  );
}

// ============================================================
// Pill Selector
// ============================================================
function PillSelector({ items, selected, onSelect, index }) {
  return (
    <div style={{ display: "flex", flexWrap: "wrap", gap: 6, marginBottom: 8 }}>
      {items.map(name => {
        const isActive = selected === name;
        const count = index[name] ? index[name].length : 0;
        return (
          <button key={name} onClick={() => onSelect(isActive ? null : name)}
            style={{
              padding: "5px 12px", borderRadius: 16, border: "none",
              background: isActive ? C.pillActive : C.pillBg,
              color: isActive ? C.pillActiveText : C.text,
              fontSize: 13, cursor: "pointer", fontFamily: "inherit",
              transition: "all .15s", fontWeight: isActive ? 600 : 400,
              whiteSpace: "nowrap",
            }}>
            {name}
            <span style={{ fontSize: 11, marginLeft: 4, opacity: 0.7 }}>{count}</span>
          </button>
        );
      })}
    </div>
  );
}

function MiniTab({ active, onClick, label }) {
  return (
    <button onClick={onClick} style={{
      padding: "3px 10px", borderRadius: 12, border: `1px solid ${active ? C.accent : C.border}`,
      background: active ? C.accent : "transparent",
      color: active ? C.white : C.textMid,
      fontSize: 11, cursor: "pointer", fontFamily: "inherit", fontWeight: active ? 600 : 400,
    }}>{label}</button>
  );
}

// ============================================================
// Tab: 交叉查詢
// ============================================================
function TabCross({ data, index }) {
  const [singer, setSinger] = useState(null);
  const [composer, setComposer] = useState(null);
  const [singerQ, setSingerQ] = useState("");
  const [composerQ, setComposerQ] = useState("");
  const [singerMode, setSingerMode] = useState("hot");
  const [composerMode, setComposerMode] = useState("hot");
  const nav = useNavStack();

  const otherSingers = useMemo(() =>
    sortedEntries(index.singers).filter(([name]) => !HOT_SINGERS.includes(name)), [index.singers]);
  const otherComposers = useMemo(() =>
    sortedEntries(index.composers).filter(([name]) => !HOT_COMPOSERS.includes(name)), [index.composers]);

  const singerSearchResults = useMemo(() => {
    if (!singerQ.trim()) return otherSingers.slice(0, 30);
    return otherSingers.filter(([name]) => matchQuery(name, singerQ.trim())).slice(0, 30);
  }, [singerQ, otherSingers]);
  const composerSearchResults = useMemo(() => {
    if (!composerQ.trim()) return otherComposers.slice(0, 30);
    return otherComposers.filter(([name]) => matchQuery(name, composerQ.trim())).slice(0, 30);
  }, [composerQ, otherComposers]);

  const results = useMemo(() => {
    if (!singer && !composer) return null;
    const singerSet = singer ? new Set(index.singers[singer] || []) : null;
    const composerSet = composer ? new Set(index.composers[composer] || []) : null;
    if (singerSet && composerSet) return [...singerSet].filter(i => composerSet.has(i));
    if (singerSet) return [...singerSet];
    if (composerSet) return [...composerSet];
    return null;
  }, [singer, composer, index]);

  const selectSinger = (name) => { setSinger(name === singer ? null : name); setSingerQ(name || ""); nav.clear(); };
  const selectComposer = (name) => { setComposer(name === composer ? null : name); setComposerQ(name || ""); nav.clear(); };
  const clearSinger = () => { setSinger(null); setSingerQ(""); nav.clear(); };
  const clearComposer = () => { setComposer(null); setComposerQ(""); nav.clear(); };

  const handleClickSinger = (name) => {
    if (index.singers[name]) {
      if (nav.stack.length === 0) {
        const lbl = singer && composer ? `${singer} × ${composer}` : singer || composer || "";
        if (lbl) nav.push("cross", lbl);
      }
      nav.push("singer", name);
    }
  };
  const handleClickComposer = (name) => {
    if (index.composers[name]) {
      if (nav.stack.length === 0) {
        const lbl = singer && composer ? `${singer} × ${composer}` : singer || composer || "";
        if (lbl) nav.push("cross", lbl);
      }
      nav.push("composer", name);
    }
  };
  const handleClickYear = (year) => {
    if (index.years[year]) {
      if (nav.stack.length === 0) {
        const lbl = singer && composer ? `${singer} × ${composer}` : singer || composer || "";
        if (lbl) nav.push("cross", lbl);
      }
      nav.push("year", String(year));
    }
  };

  const showDrillDown = nav.current !== null;

  return (
    <div>
      {/* Singer selection */}
      <div style={{ marginBottom: 16 }}>
        <div style={{ display: "flex", alignItems: "center", gap: 8, marginBottom: 8, flexWrap: "wrap" }}>
          <span style={{ fontSize: 13, color: C.textMid, fontWeight: 600 }}>歌手</span>
          <div style={{ display: "flex", gap: 4 }}>
            <MiniTab active={singerMode === "hot"} onClick={() => setSingerMode("hot")} label="常見歌手" />
            <MiniTab active={singerMode === "search"} onClick={() => setSingerMode("search")} label="其他歌手" />
          </div>
          {singer && (
            <span style={{ marginLeft: "auto", fontSize: 12, color: C.accent, cursor: "pointer", display: "flex", alignItems: "center", gap: 4 }} onClick={clearSinger}>
              已選：<strong>{singer}</strong> ✕
            </span>
          )}
        </div>
        {singerMode === "hot" ? (
          <PillSelector items={HOT_SINGERS} selected={singer} onSelect={selectSinger} index={index.singers} />
        ) : (
          <div style={{ position: "relative" }}>
            <SearchInput value={singerQ} onChange={(v) => { setSingerQ(v); if (singer) setSinger(null); nav.clear(); }} placeholder="搜尋其他歌手（繁簡皆可）…" />
            {!singer && singerQ.trim() && singerSearchResults.length > 0 && (
              <div style={{ border: `1px solid ${C.border}`, borderRadius: 8, background: C.white, maxHeight: 180, overflowY: "auto" }}>
                {singerSearchResults.map(([name, ids]) => (
                  <div key={name} onClick={() => selectSinger(name)}
                    style={{ padding: "7px 12px", cursor: "pointer", fontSize: 13, display: "flex", justifyContent: "space-between", borderBottom: `1px solid ${C.border}` }}
                    onMouseEnter={e => e.currentTarget.style.background = C.cardHover}
                    onMouseLeave={e => e.currentTarget.style.background = "transparent"}>
                    <span>{name}</span><span style={{ color: C.textLight }}>{ids.length}</span>
                  </div>
                ))}
              </div>
            )}
          </div>
        )}
      </div>

      {/* Composer selection */}
      <div style={{ marginBottom: 16 }}>
        <div style={{ display: "flex", alignItems: "center", gap: 8, marginBottom: 8, flexWrap: "wrap" }}>
          <span style={{ fontSize: 13, color: C.textMid, fontWeight: 600 }}>作曲人</span>
          <div style={{ display: "flex", gap: 4 }}>
            <MiniTab active={composerMode === "hot"} onClick={() => setComposerMode("hot")} label="常見作曲" />
            <MiniTab active={composerMode === "search"} onClick={() => setComposerMode("search")} label="其他作曲" />
          </div>
          {composer && (
            <span style={{ marginLeft: "auto", fontSize: 12, color: C.accent, cursor: "pointer", display: "flex", alignItems: "center", gap: 4 }} onClick={clearComposer}>
              已選：<strong>{composer}</strong> ✕
            </span>
          )}
        </div>
        {composerMode === "hot" ? (
          <PillSelector items={HOT_COMPOSERS} selected={composer} onSelect={selectComposer} index={index.composers} />
        ) : (
          <div style={{ position: "relative" }}>
            <SearchInput value={composerQ} onChange={(v) => { setComposerQ(v); if (composer) setComposer(null); nav.clear(); }} placeholder="搜尋其他作曲人（繁簡皆可）…" />
            {!composer && composerQ.trim() && composerSearchResults.length > 0 && (
              <div style={{ border: `1px solid ${C.border}`, borderRadius: 8, background: C.white, maxHeight: 180, overflowY: "auto" }}>
                {composerSearchResults.map(([name, ids]) => (
                  <div key={name} onClick={() => selectComposer(name)}
                    style={{ padding: "7px 12px", cursor: "pointer", fontSize: 13, display: "flex", justifyContent: "space-between", borderBottom: `1px solid ${C.border}` }}
                    onMouseEnter={e => e.currentTarget.style.background = C.cardHover}
                    onMouseLeave={e => e.currentTarget.style.background = "transparent"}>
                    <span>{name}</span><span style={{ color: C.textLight }}>{ids.length}</span>
                  </div>
                ))}
              </div>
            )}
          </div>
        )}
      </div>

      {/* Results */}
      {showDrillDown ? (
        <>
          <Breadcrumb stack={nav.stack} onNavigate={(idx) => nav.navigateTo(idx)} />
          <DrillDownView
            type={nav.current.type} name={nav.current.name}
            data={data} index={index}
            onClickSinger={handleClickSinger} onClickComposer={handleClickComposer} onClickYear={handleClickYear}
          />
        </>
      ) : (
        <>
          {results && (
            <div style={{ marginBottom: 8, color: C.textMid, fontSize: 13 }}>
              {singer && composer ? `${singer} × ${composer}：${results.length} 首合作`
                : singer ? `${singer}：${results.length} 首` : `${composer}：${results.length} 首`}
            </div>
          )}
          <SongTable songs={results} data={data}
            onClickSinger={handleClickSinger} onClickComposer={handleClickComposer} onClickYear={handleClickYear} />
        </>
      )}
    </div>
  );
}

// ============================================================
// Tab: 統計
// ============================================================
function TabStats({ data, index }) {
  const topSingers = useMemo(() => sortedEntries(index.singers).slice(0, 20), [index.singers]);
  const topComposers = useMemo(() => sortedEntries(index.composers).slice(0, 20), [index.composers]);
  const yearData = useMemo(() =>
    Object.entries(index.years).map(([y, ids]) => ({ year: Number(y), count: ids.length })).sort((a, b) => a.year - b.year),
    [index.years]
  );
  const maxYear = Math.max(...yearData.map(d => d.count));
  const sourceStats = useMemo(() => {
    const counts = {};
    data.forEach(s => { if (s.r) counts[s.r] = (counts[s.r] || 0) + 1; });
    return Object.entries(counts).sort((a, b) => b[1] - a[1]);
  }, [data]);

  return (
    <div>
      <div style={{ marginBottom: 28 }}>
        <h3 style={sectionTitle}>年度產量</h3>
        <div style={{ overflowX: "auto" }}>
          <div style={{ display: "flex", alignItems: "flex-end", gap: 2, height: 140, padding: "0 4px", minWidth: yearData.length * 18 }}>
            {yearData.map(d => (
              <div key={d.year} style={{ display: "flex", flexDirection: "column", alignItems: "center", flex: "0 0 auto", width: 16 }}>
                <div style={{ width: 12, height: Math.max(2, (d.count / maxYear) * 110), background: C.accent, borderRadius: "3px 3px 0 0" }} title={`${d.year}: ${d.count} 首`} />
                <div style={{ fontSize: 9, color: C.textLight, marginTop: 3, transform: "rotate(-60deg)", transformOrigin: "top center", whiteSpace: "nowrap" }}>
                  {d.year % 5 === 0 ? d.year : ""}
                </div>
              </div>
            ))}
          </div>
        </div>
      </div>

      <div style={{ display: "flex", gap: 24, flexWrap: "wrap" }}>
        <div style={{ flex: 1, minWidth: 280 }}>
          <h3 style={sectionTitle}>歌手 Top 20</h3>
          <div style={{ border: `1px solid ${C.border}`, borderRadius: 8, background: C.white }}>
            {topSingers.map(([name, ids], i) => (
              <div key={name} style={{ display: "flex", alignItems: "center", gap: 10, padding: "6px 12px", borderBottom: `1px solid ${C.border}` }}>
                <span style={{ color: C.textLight, fontSize: 11, width: 20, textAlign: "right" }}>{i + 1}</span>
                <span style={{ flex: 1, fontSize: 13, color: C.text }}>{name}</span>
                <div style={{ width: Math.max(4, (ids.length / topSingers[0][1].length) * 120), height: 8, background: C.pink, borderRadius: 4 }} />
                <span style={{ fontSize: 12, color: C.textMid, width: 30, textAlign: "right" }}>{ids.length}</span>
              </div>
            ))}
          </div>
        </div>
        <div style={{ flex: 1, minWidth: 280 }}>
          <h3 style={sectionTitle}>作曲人 Top 20</h3>
          <div style={{ border: `1px solid ${C.border}`, borderRadius: 8, background: C.white }}>
            {topComposers.map(([name, ids], i) => (
              <div key={name} style={{ display: "flex", alignItems: "center", gap: 10, padding: "6px 12px", borderBottom: `1px solid ${C.border}` }}>
                <span style={{ color: C.textLight, fontSize: 11, width: 20, textAlign: "right" }}>{i + 1}</span>
                <span style={{ flex: 1, fontSize: 13, color: C.text }}>{name}</span>
                <div style={{ width: Math.max(4, (ids.length / topComposers[0][1].length) * 120), height: 8, background: C.blue, borderRadius: 4 }} />
                <span style={{ fontSize: 12, color: C.textMid, width: 30, textAlign: "right" }}>{ids.length}</span>
              </div>
            ))}
          </div>
        </div>
      </div>

      {sourceStats.length > 0 && (
        <div style={{ marginTop: 24 }}>
          <h3 style={sectionTitle}>外國作曲來源</h3>
          <div style={{ display: "flex", gap: 12, flexWrap: "wrap" }}>
            {sourceStats.map(([key, count]) => {
              const info = SOURCE_LABELS[key] || { label: key, color: C.tag };
              return (
                <div key={key} style={{ padding: "10px 16px", borderRadius: 8, background: info.color, color: C.tagText, fontSize: 13, textAlign: "center", minWidth: 80 }}>
                  <div style={{ fontSize: 20, fontWeight: 600, marginBottom: 2 }}>{count}</div>
                  <div>{info.label}</div>
                </div>
              );
            })}
          </div>
        </div>
      )}

      <div style={{ marginTop: 24, padding: 16, background: C.card, borderRadius: 8, fontSize: 12, color: C.textMid, lineHeight: 1.6 }}>
        數據覆蓋 1985–2026 年，共 {data.length} 首粵語作品 · {Object.keys(index.singers).length} 位歌手 · {Object.keys(index.composers).length} 組作曲 credits
      </div>
    </div>
  );
}

const sectionTitle = {
  fontSize: 14, fontWeight: 600, color: C.text, marginBottom: 10,
  paddingBottom: 6, borderBottom: `1px solid ${C.border}`,
};

// ============================================================
// Global Search
// ============================================================
function GlobalSearch({ data }) {
  const [q, setQ] = useState("");
  const [open, setOpen] = useState(false);
  const results = useMemo(() => {
    if (!q.trim()) return [];
    return data.map((s, i) => ({ ...s, i }))
      .filter(s => matchQuery(s.t, q.trim()) || matchQuery(s.s, q.trim()) || matchQuery(s.c, q.trim()))
      .slice(0, 30);
  }, [q, data]);

  return (
    <div style={{ position: "relative", marginBottom: 16 }}>
      <SearchInput value={q} onChange={(v) => { setQ(v); setOpen(true); }} placeholder="搜尋歌名 / 歌手 / 作曲人（繁簡皆可）…" />
      {open && results.length > 0 && (
        <div style={{
          position: "absolute", top: "100%", left: 0, right: 0, zIndex: 20,
          background: C.white, border: `1px solid ${C.border}`, borderRadius: 8,
          boxShadow: `0 8px 24px ${C.shadow}`, maxHeight: 300, overflowY: "auto",
        }}>
          {results.map(s => (
            <div key={s.i} onClick={() => setOpen(false)}
              style={{ padding: "8px 14px", borderBottom: `1px solid ${C.border}`, cursor: "default", fontSize: 13 }}
              onMouseEnter={e => e.currentTarget.style.background = C.cardHover}
              onMouseLeave={e => e.currentTarget.style.background = "transparent"}>
              <div style={{ color: C.text, fontWeight: 500 }}>{s.t}</div>
              <div style={{ color: C.textMid, fontSize: 12, marginTop: 2 }}>
                {s.s} · {s.y}{s.c ? ` · 曲：${s.c}` : ""}
                {s.r && SOURCE_LABELS[s.r] && <Tag label={SOURCE_LABELS[s.r].label} color={SOURCE_LABELS[s.r].color} />}
              </div>
            </div>
          ))}
        </div>
      )}
      {open && q.trim() && results.length === 0 && (
        <div style={{
          position: "absolute", top: "100%", left: 0, right: 0, zIndex: 20,
          background: C.white, border: `1px solid ${C.border}`, borderRadius: 8,
          padding: 16, textAlign: "center", color: C.textLight, fontSize: 13,
        }}>無相關結果</div>
      )}
    </div>
  );
}

// ============================================================
// Splash Image (base64 embedded)
// ============================================================
const SPLASH_IMG = "data:image/jpeg;base64,/9j/4AAQSkZJRgABAQAAAQABAAD/2wBDAAYEBQYFBAYGBQYHBwYIChAKCgkJChQODwwQFxQYGBcUFhYaHSUfGhsjHBYWICwgIyYnKSopGR8tMC0oMCUoKSj/2wBDAQcHBwoIChMKChMoGhYaKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCj/wAARCAHvAZQDASIAAhEBAxEB/8QAHwAAAQUBAQEBAQEAAAAAAAAAAAECAwQFBgcICQoL/8QAtRAAAgEDAwIEAwUFBAQAAAF9AQIDAAQRBRIhMUEGE1FhByJxFDKBkaEII0KxwRVS0fAkM2JyggkKFhcYGRolJicoKSo0NTY3ODk6Q0RFRkdISUpTVFVWV1hZWmNkZWZnaGlqc3R1dnd4eXqDhIWGh4iJipKTlJWWl5iZmqKjpKWmp6ipqrKztLW2t7i5usLDxMXGx8jJytLT1NXW19jZ2uHi4+Tl5ufo6erx8vP09fb3+Pn6/8QAHwEAAwEBAQEBAQEBAQAAAAAAAAECAwQFBgcICQoL/8QAtREAAgECBAQDBAcFBAQAAQJ3AAECAxEEBSExBhJBUQdhcRMiMoEIFEKRobHBCSMzUvAVYnLRChYkNOEl8RcYGRomJygpKjU2Nzg5OkNERUZHSElKU1RVVldYWVpjZGVmZ2hpanN0dXZ3eHl6goOEhYaHiImKkpOUlZaXmJmaoqOkpaanqKmqsrO0tba3uLm6wsPExcbHyMnK0tPU1dbX2Nna4uPk5ebn6Onq8vP09fb3+Pn6/9oADAMBAAIRAxEAPwD6MopKWgApaSloAdRRRQAUtJRQANXOeMNcg0TSri5kAOxOEz1NdHwK8O+Pd+RNZ2kJx5g37B3FAHmOtalLqN/c3twRvnBwD2FVbkPDp0UCYL/fkwOpPQVnq5fYXALTSdPYdB/n1qTXr0QiVxy8KdfV/wD61AHIXIl1TxF5efuPtHHp3rqrT/TYbk2+IbBCfMnMmAevc9QBkAe+a5DTINm/eT5sg2YH611Vg8QQ3siAW1oNtvGOQX+n+eaALzSR2CQwadHvvD995Y8CMeuD6+/PsOlVYfKSDM7+ZJ9+eSQ5Htv9fpRbXFxGVvL0AvLhgH5GTzvP+f0zWRNcPMjO5d/Jc4THUn+M+/SgC7qmpb4k3IBnAGTjf6k9PrisnUrmeNtn2jMrp+8dxjZnsB+vtx3qazjedXuJsmGNxgHkSPngD+f4VpWulby15f4Z+oz2Pt70AZuh6HvX7RdRvtHRHGc45Lv9Bzj86talDc38rixHk2g480nmRx39h2ArpLnyrWOOJAkivy5RPv8AfZ9M8+5GT7wSxyRQiK34z998ZSPjOB79vxP4gGZZ6cllDkIZH/jnJ454+T0+vPat+0S2so4ri+n8xhmVLROgwBjPv09vr2zryePTYVkmjSa87R9SB6n3PYe5rLs4bm7jlu7ov+8OeuPk9f54+lAGnqusz39vvyIUzu8qDoPTJ7n/AOsBXL3rujlJMGSQ/P7+ifX1/wD11rTSAbXCeWiD90B1Pvj19KxrqB5vnKERY4Azz64HpQBVdLe1DGaQzTE8hE4+g5qSCeCRMvaLn+BC5c/0H9aguIRH/rBlwP8AVoeh9/8AP5VLPGlpGpfDzONxz0FAFa5kkmUIiRoidQB8mfWo8+Xt++XI5JPJ/D0ppc72Mg34AwD3PoaiBkRHcqd7nn1J/wA5oAfBGTvkPPOM5qzk+SkYcbM8/wCfxqUWpS4WBP4E3GmwwubnYAD14x0xQBBMDs/zzVu4DwaVbQAczE3PU/7gP4YNRzJ+9yM4ALEnrnFS6s7yXCCMsYooRDET6In9Tvf8TQBQsUBlmk/uRO+Cfv4Gcfp/Oqr5DMg6nHPt1rS0oIkF43/LX7NIgH13En8ET9areTv8mX+E/I/sR/8AWI/WgCSfMdtPnPMgix2zjINQ6fsS7VCPlmOw/jVmYpJaPgDc7xkf98GoYo8PHv8AQtx9KANVCTcw3DRp+7dxKmf9ameR/wB8HH50SWr2d9cW+8yInyh/747H+VNWGWezZ4XAdJA493Azj8Rnj/Y961o5oL/RrK5wPOjBgkORkAcg+4IP5x0AUbaQRpvm+5gb8enrUkcfk3E1nIcocvGT3qB0McPCOMZVx/T+dSyzOEEsY85oQH57j/P86AKM0OA+O3UYp9tjO9CcH9K0ryBPMjl+8mAwx3T/AOtVOW3NvM7wnKE7vUOPWgC9aT7HGeCh2ketegeD9bTTrpfO/wBWRuQ152+yRFkhGDjdj09q0LO4fyVjf7yYdD/SgD7F8MaimqaVbSg5yOtbi5HWvC/gx4wCTnSL44Q/6pz/ACr3OEghfTtQBJRRRQAUUUUANooooAbS0lLQAUtFFADqKFooAKWkpaAGS8Bq+X/jJqL3vi+75wIIhDH9T/8Arr6cvHCQsT93HNfI/wAUboXuvarPv2AHbHgfhQByUt95Do/Jflh7f5FOnje60x/OGyWR8kHsO9Z9vG901vFzvLnOfStm8kAgml2fJs2pnrgZ2A/U5P4UAYVrB51xFGN5kPoOh9B/ntV+aTzNRVDHm2gwoiP3HI6A/wAzT7IIESViMkHHz/P05P8AnuamtbePyle5QFwN8noM0AVtRunuH+z72d5epPTHH+ce9UngMykElIehP8z7+n4097py+8J883QE9B/kn8jTbuRIZYoEPyRxg56Z4zn8qAN6ON0treO3Q7wDKmX6ZOPz4qa5nT9zAC5aEeZKUPycdh+dZkrj7c9tHIdsCIs7/wC4MHnr1B/lU0SYuCH3bEIeXP8AGeuPwzQBoQwSPC08xEfpz0GePzqa41KK0h5jD+WD5KIPkBPHPrVea93s0mCVz+7QHP8AnPT8u1VLO3Oo3P759kScuSePTH+egHHbIBX0uxfWbiS5vbgpZRnfK56y+o/nx34rZvCLeJPOQpF/yztgfnI9/wDPp3q1GkdpCpeMBAP3cX9T/wDX9qy7O3N7ePLNKcYPz55cD09B7+tAFOR0NtLLMA+wYPljjP8AcH0rHuY555FSaT5z2Bzj2FdNqboIooEQboxvAQ/IhPA+vTP41kW9rI4zIULSHODx8meM/U0AVLO1Se4igt0cu5wD/n0FLqMcSXWEQ7uFGecDsT71taZbz2qTXZQcRbYgeyd3+uf0FYSf8fbDecoHeQnv2H+fagDHAy5LZIHXnvVy2gEb2rzH5AnnbPfnFStb+XbxiQnn5iMck1YugiPISnL7IUH9wADI/PH60AJp1qbvUv3e3b5b89yB0/pVixh/0omTAGS2M9U/+vmp9FcW+sWcScZl3E9ucj/Gr9nZb03gZ/decSPx/n/QUAc9z99wC7yhfXvnp+VQakHSd8DCOSBkfUH+tbUNr5l3aT8DAEuB3+QAH8iDWfcQPJduOXwMk+pwCT/P+VAFOJMRraDo+U+mUwT+X86qpnyJY8Jtk+fntgHB+vNSl/8ASQADiEFiT3J5/wDrUrxlFw/Cjt7/AOQKAIJtiW6DGMOPrwKlWPLpJhtshPlnGN+MZ/mBSiAzN8+AnLu55wP8fbvRO4kYEcJGMIOuwdR+ufz96AJ7B8O+/cfuTIUPIKc/njP51LpN0kGpiW4ijEWUdwBw47/mKbBb4RJEzv4UBOuf8il8vdcQjAx5ezp1HagDWvbJ7F/LmOUB8knPGOef0rMtJDA67wcYdXjP61vwgXem2kdxz5kWD9Rx+fQ1jpBJM2HwZoyN+P4x/wDroAkgkE3+idV6IemzsD9Ocfl6VXEh2NZuiAA7opP7nqD7H+dULiQh9/qeCOmCP8RWhCBf2/mpg3IG/A/j9fz60ATW8YmCpGfLY9SegPr9Kej7GVH4bJyPQ1PaoNqyx8KnOD1I9al1KDz0S4hjCYHPvQBr+E7gR6pbpI5TLjBzX094R1S4EQs74sUxujkPevkK0nMbrIRuAOcDtX1L8PQ+qeG4w5JwPkPcUAekLyM0VQ01yieQ/wB5P1q/QAUUUUANooooAbSrSUq0ALRSUtADlooooAKWkoz8tAFHVcJbF3+5g596+VPidB/xO2kkGIpAM546f/qr6wuQH4cZUV84fHKNE+wFURAXLE/j/wDWoA8vsDFb215LICW8oQx/U84/IUmtz+ZcxWf31RNzkdCT1/TH51HeTp9msI+Ajubt0PQ9ET9QarQj7RNcXBy7klItnc9P5nNAE9vyTne4JCYyRx/hwatalORpWCCJpz85z09se2RVWSSNJ2S3JmUJ5Ix37frv/KmXcieaMJhPMxHyT7E/y/DPpQBlT3Dm7KIdmMomT0J/oBTJbspcySx8EnanH3B2FUEmJkygyfvH69TU0w/0hx/yy84oDQB0WlSb7R55zvlml8yWQnrjn8B/hUtvJ5lrc3DnjOEBPfNZdnIBZshQ7Twcdcen41oxHZbAyJvfJ4x0Hr+dACQi5MXlgkXEh2464H+f88V0kDWliWjdHe2hQMU7ySY4BPqaztNhARribh5BhAf4E7n64z+dWd6T3GZsJbW/z5xxnrn3PoKANDY99uubjy88b0IwgTsPp7d6jv71Ps8wtRscnZ5vdPr+nGPQVUv7uS6/0eEOnsDnA9z6nv8AlQbREtooiS7AOcY4cnsMf1//AFgFJD9rZZM+XbZ3DOeUQYH17n8ufSOUuiPI/DADZk9eePp0/QVdng+yoqPsIIA3g9uuB+dR+X9rms45OITLvIx1Cc/z/mKAH6r58OnfZoPkmkQKAnbOP5Y/U1n/AGWONL+X+5iOIJySM9f0Nampg3F8H+4xR+fTt+QBBq5HBHZWbl43+TMjuRzkDgfXkUAcfqiPb3DJ1nxwg6J2H+fxq5Faxz6rDGnOzMpye+ar2lubq/zcEb4wXfB4B/zx+FbOhwCO4ubtH+UJsjz1JJIyfrxQBRS1khuIZJMB0xjJwd+R0/8AH623cQWJiICMXLS47IOev1/lQ1vvdvMJ/cENz3Ow5/maHIKRpw7zufxHPH06UAQxQSboeIweeH4wAnT24cflWBqEwjtj5By0nqOw9/r/ACFdRq8CG7aO34lwUkIIOcnt+AH5VzN+BdavGIEH2cOFROvAHA/T8Tn1oAz5YfJeUZ+Uuc+4zipb+F/tsm7pkMO/8FWri3zLL5YJABx375/lSXg33Qjz3HOc4yQTn9KAKMqAxMMjah38Dr9fyqtaDfdQxkY3kIc9vT+lWthO7PytMNoT361Y0SPZqEUvB6nn0Az/AENADoIMwPjIkhuByPcEH9QlLeI6anCRxmMLj0OM/hV+0QBnQnzFJdD7FMdvyP41FqQ33t2MYYPIgIP4fyoAhsZ3eURI+DEUmifpzzn+f6CpdSzb6q0sbmOOQB0A7B+cfh0/Cs3VJCk3mwkdN+fzrV1VhcR2ssZ+TzO38Ge34EmgDK1i13/6sYBfdx+Oap6TcPZXGA+FJ29K3bmcMHiIG5OTj0I/xrHvISCr8KHj3gemO355oA6JJAkybxw8ZQEd81N9qjmtJwSQwjRwPr1H6/pVTwvPHd26RTEHYeC/1/yKq3CSWWoy2k2A3vzkUAQySeW8Mg+4flNfSfwI1Q3WieUT88Hy5FfNN2ht5cHDR79wx6V7j+z9cYW5APpkUAe/sE3pJjFWU6VDCN8IzUyDbQA6m06m0AFFFFADaVaKKAClpKWgB1FC0UAFGKKWgCtdcIR3xzXy98cr0Ta3HaH5wgMmB/AOgFfT2pOI7Z3PYFs18h/FzzY/Fssp53oXI9B2H6UAcZeThLmMgB1SMRBPTZk/rmprbfY6c8iDMqRbx/vk4H+fas1Mz3luifPj5yfft/T8q6O8G/SVjwoEgkuenPUx4/8AIY/WgDLs9kaO5iY42SYfjgY4/Sqsk7j7LGQ5k8x2O8c8Jk/0/WrafvrKYw8cADe/ONmeffn9RWPkR6iDM4DCXkkcYJIP6UAVHHkvPjG7zHQ/nzirDO75OAUdxMMf3ygz+v8AKotRGJkSP7xROAep/wAamcFLaExg+bGAAcHvz/n8PWgDSt0OVRyP3eN+Dkbxnj860oglxcdcWycuncgdvxrOtk+y6fJnBfIB4/P69RU8M+I0jJ+UjeR/fGe/4/yoA0bi9C5uXIjRP3ez+Z/z7VHBcSTxRSlC7yPst4yDxjkuf0/Ssbzxdz75+YYz9z++e1bNvM/yhT5bOnLkfcHr/nvQBsaUiQP5QLznzMyOBkue9aXmCa8W5uNhSCPbgcj/AHPf/wDX+HOfa0hhlit5BHCAfNkzyOOgrRvrgW9hDZxpscjzXB/5ZjHT8qAMrW77/R7h02l3OwEnqe/9K3bSN7e0iL8zC1AQ478//W+vFZNppHnzWxmf9zAN8mRxn3roJi73EcEg2PxlD0B9PpjH5mgAWxD3LEk7UjEfHqeXJ/IVW1OciN40Bf1Oc5Of/rCtFJwLmYAZzJtGB07n9Bisu8kjgmOfnmRPkA9c4FAGJeyDS7ECP/XfePfzJDwOfQDP4mtjQLGSGzSK4QPK8kbOSORg9P1/SmLBFG6zyYklB2Rp1Af/AB7e38rdg7+bMXdg0nyo+fbr+v8AKgCa6cJbPGCd00xcH0GMVUYJHf8AmIWSO0jSEeh4JP45NPa6QKXPIHf268fhVOy/0uCUnDtJJvI4oAhlu4ktppAP3sw2jjgA9Qfw4/E1Dp8GbuExnPlRmXHck9P6Uurvl1jAZCPl57DH+PP40+GbZvMP3vu5/Dn8KAIbOEyF5ZOIeXPb2/xrNTMlw59Q7DJ4/wA5rZut6WXkfNvkPz44Bx/nNVba1ATC9cxpz2yaAMy4TZMhTkwksnHf/OKu21qUcCPg4dUB7Aj/AOufypzxmaZunPPyH1rTto8SJ/z1TIyf8/WgCtEPIvXIwD9o830JGc/0/Wo7hNluj4BRMkk9emasp+8t/tGPmfYifXPP5YpmpTIbOZPQFc+mf8mgDnriHzFaM/62EAEY4P8Ann86s2bmTSBBI5DlxOh+oPH4imTOg1En+GRCDn3H+Oau6dBiaGPHOzqfXmgCr4hk+zzpKnGH+dP76dP6iieFHRY3O9ij4fPX2/z6e9S+Igh1LYeeiEDtxwP1/Ssi0uH+zJl8eXjoO2efy4P4UAPsbiSxuOD3yD6j/P6iugSeO9YQXAzMBuifPX3zWIxSSLDoAyPlPb1H5fyNNt3MhXL8x/cHtQBf1CMxup6g9favePghY24hQxoyeZB1Pc5rxbTf9Oge2kB85Dw/pXv3wW06WPR7Z5s5icrQB67aZ8vBqxTEp9ABTadTaACiiigBtLSUq0AFLSUq0AOWim06gAooooAq38Pnx7Oq18pfHsxw+LHgQY8uLYT6kg//AFq+s7l/LhZ/avjf4vzG68aXm996hwT9O9AHD6TkTTSEHg+X/L/69bqDfYoZC/7y38rj6nefw35/Cuchf9zCAfkcO5H4uK3nupU8OIYzkRwyxA/7eS/8nSgDP0a4EguvMH7u4nDZTt1jH6kVivIPtLucf6zIH5/1xT9Nuzb6fcgAliExjth8ioFLzam54+/0z70ATQc3zy4+SIBEA7v0GPr1qePf9sCcO/3c9B7/AOfaqyTmC2Hl/e5YPj8Af8+tLpnExfClEjLYP5UAbt6DBHCnIQ5cv6nP+fyrKefCq5++fm+g6CptUmElvZ28cmR5fz/mazfMBdnP3QD+lAGnYfPcoNnyR5d8duM//XrRmc+dJskGxMeZJ2Tjp74/nms2xhI053coufnO/v8A5/nirGnI88yQD7pfpj8T+FAGnosD31zDAIyIIT5mw9h7+pNb6QfaLl7mRMtOdkQJ6D1+lNs4Y9OgYAEXEhyQOn51ainEzGV+UA+c5xvHoPQfzoAuCSMn5UJht0Mhz/y0Pb8Og/Wsd5PJmSRy5ORlz36Zqa7uxb2jbAP3p3kHg7B6/rWa0gM0Yz0TcfYnH/16ALivm7QghQQcnpnJx1+marWf+kakbiQgpCSyHHG8jj8sZrL+0f6O0mX4j2gevHT/AD61pWJyyQQnOSc/XP8AnmgDaAEiwCMA+SCS5fkknqffr+tJfgx23lR79p/dAnvjvn86sqQkSbAN8x3fT0/SsbXLom1iPvwB3/8A1UAZNxOOo5y//jnX9TWsz/ZNKaQ7kJJ6cZHT/CuehcnUACmWHQf5/Gr3iG7R/stmM7gA0p9T/nNAFaZ3f9/JgKEOXPc5/wA/nWjDNs/dISAAcn1/z/SsWHM0qRk5Xrj8a1bg/ZWGw/OciL+p/Dp+FAFm+Hmbc43vhQD39v5U58eW75+bP5/5/pTYpsOZ3z+5G0A/3zx/9en7DtQEDJ+cjv8A5/xoAeAEuPNIzjHb2H+FCnCNsR/NkGEx154wKlZBHw/4j/69RKCUd3+7jYBjGBj9M0ANfHlRRxuHW13nPqeuR9Tx+AqleR/u8u+W37Tz+tXGQQ2zyvgZxg4rN1KZI7WLKAvksAD9Mf1oAoSlHuzGSBiAsCemSlb2nJmdJf4440z9cf8A6zWFbIf7SmPZICACM8gAV01jD51jdEvnMhUH6IU6f8DoAwfFCobmVxkJKZI0f/bBBz9cZrAcmEh9meM4+vOP51q3EgvYbjyQcw3Iuo+Ox6/o5P8AwCsu8TGw/wAJcrj09KALMWPuO+VJ3CQfnzVeP5Jsg4cPzSWjgzZAwvI+vHepp4wEWWP7v3SO9AHW+GIUuLmfaC8rgcehBzmvqL4fWP2Cz2D7kgDY98c187fCPTvt3jm2jH3fJL+3FfVOjwCC3X+dAGquaXNOSmsKACiiigAopKKAEpaSloAKWkooAWnU2nLQAUUUUAQ3YBjfefkA5r46+KlrImr6leECNZHdE9eelfY1zGZLeWMcb0Ir5h/aP04Wuo2rx/8ALbJP4f5NAHh9pklAOWOcCug02Qz6de2kDjfNGCPY8jH4hx+QrDtU8maFycJh5AfTAP8AXitHwzcOmsRGQuWGFceoxj+Tj8qAMbTVVkbeP9YN4OKi0qQ77qcDLJGXIq9qqCx1GSNNow58t0HSM4Ix7YJFZ8ACQ35x9xNo98nigAXDxtGD9yPqe/c/0qe3/d2cshHL/cOe3XH6D8qqx5k87PJEYx+YqeY5hEcfYE/gOP60ATLN5cLlACSMIfQE/wCHH41DFjO8/cHzVHy8WPXCir2nQpNOXmANtADLKPYcAfiSBQBfmd/LigGI1CI8oHqQCEPqf8a1NHeO1t2ndHLyDhM4ATr+tYU00k86yTEebKTcS9uT0/pV+a6/eJbJn5EG8+5wf5HH4UAbXn+ZdkP8+xN0noT/AIVYuL750A+6D0Hc1jNI/KDgEjfk4Bp0M43s4c4j7jk56UAW7yc3E+9ymDxk9SKqi4Q73QfORkmqN9MUjU9N+Sn0qnJPsTZz9zdmgCWSYkW+D1zz6Vv6QRFbb+jOdo965kjfAoPUfMPetyKcIkZyAqdB6mgDcN08l2sY252eV9AByaxtVuhNh0JK52RjPAFM88R2krnJecbR7JUDjN5bh/uodvH0oAfG8cKRyeqbj7n0/lWexkupi5Pz45NPv5gLcbx8sb7Prz1/So3cTLsAxF93y06mgC7pc0dqryEF4oup6Fz6CpfOe4vEkfl3PA7IP8/0qnLNGQoGPLQbQnr/APWp9tIdqn+NyfxPp9OKAOhsyC5Gf9Hjz/wM/wCf5Vdj+eXI+d3fknpmszSk+Zgg+50Pqa2bUpHvI/3iT296AIpSE37Mu4zk+/b+lRnJZIA/zHqBTosD5yD853+v0FRyOkKGfY+5+UJODgUAV7+fD+W53kcnPp3Fc3eT/bblEU/LM4iHOMZOKLy4MyeZI4APXHH1qtpW+S/80JkRo7gH2HB/z6UAbGnSfNeXBQfvieCcYBfIFbFyfsVhZiThxKAT7kgnj/tn+lZekQ5lSPZ8ow5OMnHuPXP9aseLpvJeOODKYt/tBI55yMUAYmmy+RqFzvO1CXjOB24/oRWXfoI7p4CPljfZ+Pf9QavTSeXcXMfOS7zH3zzx+H86r3o8y8ScdJI0fHv0P6g0AMhT5Vx3G2tSKP5HjccOm5DWcgKbPYZ/WtHfiNhnp84PtQB6d+z/AOd/wlVtIhH+rffkcEV9SwqAPTNfMfwAt5H1gzpzGm9cV9OQfvLdfUCgCwBRTUNFABRRRQAlFFFADVNLTFp9AC0ULRQAtFFFADqKKKACvn/9o2wea3hcIFZELk+1fQFePfH61Mnh2aVCQ6IWGO/tQB8rXEZ+zhF+6EOzB9z/AIiq1q7/AG2GdA6r5e4Onfvj9K1UaOTYnBVPlPrsI5/z7VmSxz2vnW6SYeOQlCD3HbH5fnQBd15P7RiE8YG+AEMcclM9fw/k49DWI2QbmHr86D24J/xrbkmNpLCUdCr5yOxHH6HJrNv444JXaB3eIn92evTsff8AnQBUt3w+fU1YsyHu/LP3XjdPpkf/AKqqRf63AqWzkEd5DJglQegOM8UAEYJkjByOeRWpbTP9mntiUCTujE45yM4GfTn+VU5UQTylN5QkmP1pYpMwr2YOefwoAmvpzJcHGNoAABFOtpD5oG8DJ7frWfcPvmz/AA53Y+tWEJj+fpgYz70AWrm48yYhHJQck5q/bohto3J+XftKY6msjJhhU5TeTyK6Cwt3jthLNzLxgeh6/wAzQBnaqDy8n33+Uf7A9BWehJzk53/LzWjrR2eSn9wc1m2/30/ug96ALkvNwvZIUGPxo88Dy4yfkz+hqOGTfDM55JfgVDbJmdg4yqHb1oA2pbgRpH9C5Pb2pZi8aQ7fvuPyqiGE9yATw+OO2K0Lhi93DJ/cPNAFObZJ5sQ5wX61ShdPJYkncRg47VftoTJczIfvD5j/AFqhAoIdOwNADUDyXqjA6cegrVtMHiE5RHxk96xw/wDpAjT5EBrd02DMKJ/GTz/OgDodHybfzT2yB+fNWbwjyVjd9ifd4HbvTNPeMw4IOIycAnA9agaQzzSO/wA2AcE9PyoAlnuhBCxAGcCNBisvUpyLfzZD9/5QPYVPdlHbeXASP+PNYOpXqSTPPzsxtQZz+NAGfduXm+YZH9w/yrU0qN0tpnTeZnxhwM4H+FYa5klXqSO9dPYl4xNJJkNwsUSdcc8fy/WgDStkEEMVojjfKCcgkHjAPPsP1Nc1r199uvJNhHkoQkYBOCOf0zW1czfZJJJT8jAeUBj7gHHH61zDJ5cj+Z95O5oAS4cbRLk8xgnPUcYqwhL2URfnALIPx5/nWdeOBHtxgEZx7CtG2I+zQoc7kfn+Z/lQBI6FDcIeXRAg9jkZpGm2AI4/1Z2nHcE0iufs9zL/AAvJtz696qB/MmlH0oA+j/2breObS7iVEJdJeT6175CMMcV5X+znpv2XwQk8hHmyPyPavWKADFFFFABSUUUAFFFFAEdO3U2igCSikpaAClpKWgAp1NooAdXmHx0uJLbwrOkODJcIYkHsetem5rzD9oOCSPwgl/D8z2snT2NAHyIjpBquycEx/df2BPWor6+Elz8/yS42SD1/yKivpDNcPIfvHNZr535z82d1AG5aul7bJHPgNhwHPOHA4zTru3R4pZ7VyYXj3lM/ccdQazbBxulzn5xsAHqa0tNLzX9v5Y+SZ9kqZ6f/AKxigDEQ7fypV+8hHrtpbhNkzofvoSH/AAJpWBRU/B6ALrZFlbyj78chTOO3Uc/jUEf3F579PStS0UC1v43+cRxRyFPYEB/yyD+FZgjMfHXnqO/pQAwD5k557mrTIJLkR4OwHb+lQxoTc7OyGrtshPmEj5nyqfj/APWoAdp1uZ7yHj5IznpXTSpvfy+ioN/1NZ+gxjzUG/rhj+f/AOquhMAD9cs/pQBx/iAEBX/hPzfhWVDwrPwVzXQ+JoTHCSR0HA9ia5uDKQOD1B4oAu2yAWqnqo/majt5DHHNImA2d2auxAiwCR9+f8/pWUrlIsHGCAv9aANLSERLmR5PuR4+nvWpN+8tH/vly5x9KzdOiOxXyMvJtIPetyWHiYj7nCn2HSgClZoQryY+WTqfXmszhJpgOSjn8MgV0OESwt4thLhxkj061jajDs1C5AHyHGD6AYzQBmOh/tCNB94nb+ddekYR/LROT1I9BxXKFymq28uMEvu6+nFdfa+WkaXBI+voP/rmgCaF0ET27kDzOpA7d/5VHPIIYSkPV/4x2NRq5MzO6YaYZJk7Adh+tRvCXK+WhHHWgDN1KaQgBN544HbNZl0jzStFCS+DtJ+n/wCuunTSjuDkln+9n09KtaVo6RyY2HtQBz9npUiAHkHsfU1rQwC1iBZMkYJ55JrqfsKbOYxtHcGsPWIBDFyMZoAwNQkkdR5x+d+eD+VZ8zp5ID9EG01buOOgqjKNyMO5oAzm+eRTJyv3nq/bscvJ/EM8D2qsw5wg5HzVPaSbIVc8MYy4/pQBJdkwW0dsvUfO/wBT/wDWqXwtZG/1u2tsb2m+TFZru7q7n7z/AK16f+z5psF348SS4yViicoPU0AfS3wr0o6J4Ss7MvvKdT612VULKAW8r+WMRvhhV3mgB1JRRQAUUUUAJRRRQBGtLSUtADlNLTKfQAtFJSrQAq0UlFAC1yvxR04al4E1iAjJ+zkj8K6qq9/bpe2NxbP9yVCh/GgD8/ru3w7cYz0rElbDkV6v458KXHhzxHfWdxygO+J8dUrzK5t8215L08qQfjnP+FAFSGQxuJAOQQ6D3BrRSRIL6U275SOQ+W57jOB+lY7H0q1bOd/+zzmgDTmiSa5t5Zy/krCjzOf4hyOPc9P/ANVVLj57hpOz/OPdO1TXc/mWbRuflCBU47g9f5j8aZbJ50KxoMqM4yelAE1vOYYpXkzv8x4ZT6o4x/MUyaM2+Af4CM/lViCAXYkgT/WXMSInr5gxj+tS6ri6m1GSNMD7Q749Bz/9agClYnfNLjrgtW9BZf6Pv/iRDgfjisbTcfaZUP8AcCjP1Gf8+1dpYWvnQKS/V8YH1oAfplgNhwCPkGSP1roUsnMSgR5YAEfWjTbT/SZeBsc7T+ddPpOnb0kQ/wCsjcgfTtQB5v4wsv8AQppPL+7b4IPvn/CvP+ZoxGP9bH9/B6+/9K9t8aWEcGk3EpCp/qX+fsAeteMyp9n1OZ04yDgHuOn+NAGspCWxOBjy8ge+Dn8KwLpAioiHfn5h+QrqY4U/sq5PGCnyflWDFH5k1tg8Fz+H1oA29HtzI42DhI+OO/8An+VdFc2o/s+ZCPlKDBB9ap+EYf8AiXbzlsn+X+TXR3kP/EtY4w6AgD6UAc9ZE/uTj5RBsxjqcVkaqju/mEgOgzIPU5/rWzbI6WTZ/v8A7semRn+tJqVu/wDZ8rkHdKeP8/hQBxVzGhwByY/6c12VvGJ7W2lQYAAYYwO2P61ifZDIyOExl8HHqR0rsvAlkbqzS3cZKExP7Af/AKxQBFDo8jpnBJf5gfStKx0qR0U+WQx65HWu/wBP0nCDzMFsfJVmz0r/AEpgAB/L/OMUAcbZ6M4Ri6Hp3FSQ6cEmHHPPOK7uSx2cOOBUEOml1Zzwc0AcZe2rpE4hTI7nYa5LWIJCv7z7tevzab8hyBmuN8SWARXwnzGgDyq8jw1Z0w/vV0epR7HYDiuduQU++cn1oAzJ/vgEcZ+cego8wlXc87/lH+fyqpM+JT/dqS0+cS5+6O3rQBJn58A4GeK+iv2b/Dskdz/aciEZBxkda+edPj8y/gjdMq8gBHtX3f4G0m30rw/a28CEKEDc0AdGo6ZHIp9J9aKAFopKTdQAtFNY02gB26im0UAFFNp1AC0UlKtAD6WikoAWihaKAClpKKAPJPjxpUdxaWF3/GMxE4r5l1jTTb22sJj5fLRx+D19ffFq0+1eGcgZ8t99fO3i2yQ6BqskeN/2c/pQB4pitSygzDv9qztnzv7Gun0y18zS+M8GgDPeAmEf3jlQPwo0QEXDIeMA59sYz/StK6BRFkQ4w+7HrWdNvtV3x/IhfnA646D+v4e1AG7pMITxJbiPPleakwyOmAD/APWqpZQn+1LyNwCrkyj3B6fzp1nJvt3kB2SiPjB/2x/TNPe4jDRB02SICofHb0+nWgDKTMNzb78bMlXc9+cV6fo6RixiIwVyGP4n/wDVXml7878/eOQCD/nv/Ouw8JatG9kLaf5H2FMH0oA9Q06wCrHg9UK5/UGulhg8tPNc5Axvz6VymmaxH9jh8w4P3eveulsNVg2B/MB4xjPX2oA5j4jgHQbmMoE3lE5Of4xj+deReMLAR2NhewH5I8wnHHBPX9a9b8cyQXVmkQI2B+M+wJH5EVx3iO3jn0SeDYP38f8A3wRQBz2l/vrGaMoNwT92Bz2x/WueSPZcQH+Ak4+mKuaVdulnC/O+A4f+VULlDHIj54QjP0zj+lAHoHhSECyhwAcDcf8AP41q3ETvY3JUlETeo9c5/wD11leHpPLTGQB2+mf/AK1ac0jyadc+WQcl/wBc0AZGnRkapCXHyOhf6n/Oa29StQ9vbwE/ISWQj/cxWZbYBiOB+4x+P+eK2YybiJAD8n3h6j2oA56wsflcOfkLgjefz/XNdp4KsRp2vTO4CxXyCaP/AGCDjH6j8TWXbRiO78ubH7w8Y9eP8DWtc38FrYWs4OTadQD99Dw4/XP1AoA9Nt4AdwIXbS4SCbkZYvx78f8A1q5u28V2awoXlH+/nrWfqPi63LY3g+9AHYyzxliH7dM96q/bkDbHIGOleeXni7zF2eaCR0NUotdc8lzk+pyKAPT7m7jEJJI3Vwfim6jdJdmckHFYl34gkAwjgfQ1hXOoly+/j69qAK9z+8Q5GW74rldUxnjtXTvOhgYjueTWPcWXm7zjOaAOHnzvY+9aOnQH+zpJz084R/8AjmaZqluYH+YcE1q6TH5nhu4x/BfRsfxjf/CgDt/hN4LHiu9u0yEeC3Oz69q+s/CUdxDodpBfY+0wRiNyO+K8b/Zjtdo1SfZxwM+v+c17yBhcDigCSk3UxqKAH7qZRRQAUU2igB1FNooAKdTKWgB1FNp1ACrT6jpaAJKKYDS7qAHUUUlAFPVrQX2nXFuRkOm2vm3xtoT2lnqkgJCi3mWSM9uDX09XmHxc0Pfpt7c24+Se2mice+w4oA+L9mZmjUff6flXaeFY/M05k7kcVyUKE3dhJjhzHk9hniu/0QWdhcSRSXECbCUP7wY4NAGfqEKRkwTAcjehI61hakmyNIx/Ac/X0/mRXW+I77SJgvk6jZFx6SA1y011ZyMw8+M/jQBWsf8AVsnvmpxI88/7wYGeabbeQZsJJGWz61rLDA8kQjkh2B9x+frQBhSP56Yf74HBplvO8T5D4lH61qyWQ3q/ydeoIplzpMj4lgA3YDHHOzt/SgATXZI1/dv+taVj4tuY+N5NYT2j5QmLk5Dg9D9CKrSwBGYhGTPQYoA7G88TfavJfLnyvUU6bWRJG8YJ3ZP681w3I6HFL57780AaKfu5ZcEhM7XT27Y+nP6VDeNkPEfQL9areeSWP8RG2rkp+0bH6OB0HegDqfDNx+55H+yfauit7iJLc45/iz+NcNoN19n68xSAKfr2Nacl+kcTjzPwFAGhbXRj+0DA/ufgP/rfyqdNbFuzgEYI79xXJT6kMPs9ayLi7MjUAdTq/iIu2A5DA8YNZUniS5dWG9yMbfwrBLEmrNtZPM2AKALsWt3AAQSuEHTrVuG/nk6yOV9+an0rw6JPnneNMf3ziugtrTQLJiJtTtUcclBJk/lQBiRXErsuyPPvsrUt3n2fvBjHepX1TQo9/wDpEx29xC4/mBVKXxdo6/JHHM69gMdfzoAS5nI3e/Y81Xnne4tllyN8GA/uOx/Qj8qq3urSTLmPTLvaf4/KOP5VnQ6lKJ9klvsjkBRie3ofzxQBtW++4lAwQg7DvW/Ba4XGO3evP4dW1OPiN44z3wn+NS/8JNrAXH2sfhGn+FAFvxXBiLJ6eZR4PHnaLrcR7fZ5h+D7D/6HWVc6pe3sJgnkEi7xLjywDkfT610nwxg/tHxTbaVHFsa/Bgkx0x1/pmgD6c+AOknTvBguJBh7py4+lenVT0qyi03TbaztxiKKMJVqgB1FNooAdTaKSgBaKSigBaKbRQAtFJS0ALRSUUALTqbTqACiiigB26l3UyigCWs7XrFNR0q4tmx84/Wr6mjd/s0AfnpNDLa3l3pk8pQWsr2+COuwkVNb2tgDm6l+pGOa6H466T/ZXxU1+JE2RS3Au48f9NACf1JrzuQ4OCSfcmgDu7T/AIRCP/j7ju5/XFyE/pW9bX/wyQKLjS7rd6jUHP8ATFY/gfwXZ3enNqGuIXQjdHBvKDHqcc120/hbSI7cGDTLVBjgiIZ/PrQBTXUfhC8Oye1vkx0CXkoH6CnRx/BGRh5c2sxv7TyY/VKwNZ0CPYxRAn0rDSaXTmUTRxyRdieKAPQW0r4NPBug1nVEf/r4GR/32lRQ+EPh9PxYfEFo3foLny/6EVxy3QdMPZHB5ymDU4n09/8AX2iD/ftx/hQBvav8LpEtjLoHjHTNQTjCBzHgeucnjqfwrnb74eeMYE8y2jttStyMpLZ3kMwf6DIf9KHi8OPkSW8A98BP5Cs6VrCF91jc3EB+8PKuHx+poAw9TstT02XZqlhPbP8A9NYylUVn+blGFdZceKvECxeSmu3UsP8AduAsg/UVz2pXct62ZbSyEneSCLyyfwHH6UAV0mBNX7Q+c6+WQfoayW4++mKs2scUz4EsaH1c7B+dAHWWcBkspdifvE68dv8A6x/nVW6LmLJGzHynPY0abo+ph1MMczwkFSY3yCDUNxol5Dxfyw2wPU3MoGfoO/4UAZE04GfnH4VB527OAeKuNb6ZEzj7RPcsDtAgjx/P/CnJdRIf9E0uPcM/vLtzJ+nCfmDQBFplpqOqXHkaZZT3c39yCIuR+XSuofwP4itVzrl1Z6JFjcPt14Ef/v3Hvk/SstfEWufZfsv9qXUFr/zxtCIE/wC+UApljHZmbdOEkkPVpR5hP50AbVtpHg6Pi+1/VtXn/wCeOn2W3n6uSf0FbUL6JHB/xKfAWq3gHSS8uZIx+Uez+dGk6raQFUBkGOnl/J/LFbc2rQSJh/Lx/wBNJN+f1oAxn1LXURX07wX4bscN997W3kcfjMXes3VfEHjEr+/1i1tR/cgYIPyRK2b29tI+dlrz6DNcrqWo254TY7Z6IgFAGTe3WsXrH7Xq8k2f+mjml07w3e6iVCXCc/3wa1NLsPPmEk4PsB2r0Xw9pwCqUTpQB59J8OtcmZ5Ibi0dT83Mjgn9K5fV9IvtGufs+pW7wSfUEH6EV9Jpa7IeuOO1effESzjvdMnWQZeFDJG/cEUAeQKT0Br3H9lvw+J/GrapOjO1rbSSR+xJCZ/U/lXhUPzOB+dfXX7MGhXNh4WvNXu4nhW+8uO3z1MaDr+Lk0Ae05ozSUUALRSUUALRSUUAFFFFABRRRQAUUUUALRSUtABS0lLQAU6m0UAOooooAKKKKAPnz9qPwLLd2yeLdNDObeEQ30Y7IPuSD6ZwfwPrXy8+z7R8/wBzIzX6QTwxXFvJBPGkkMgKPG4yHB6g18EfE3wv/wAIh411LR0LvZxtm3d+pjPTPuOn4UAet6J5eHgIBQjbj2rovsokhUCuA8K6j51nYXB/5bRDP1HB/lXf2c28KKAMLV9N+UjZ8tee61YofMik7ng+texX8IkibmvOvE9qCrkZBHSgDzqWOeyY+XI+zsD0qQatcxpzWis8Ey+RdjDdjWddWGwt5ZEiUAV5tUeb78YPWqktwZP+WYC+vrSvARx5VOWHZ9/aPagCosc7v8gq/DY3AT5wCvtUlvIB/q0ya3bWF3izMMcZwKAOantDJwUIQDqRisq4j8iRo87yhwfSukCb13t3PJrnnbz72WTH33LfmaAK+Cf4P0pQjgZ2Y/Ctm2tJXTIB2+wptzbyQr84OPpQBDZEXrpFcIdw6Sr1AHr6/wA61rXTjINkDpNsHAQ4P5H+lYtkwt9QhZ2whPJ9j1rqNLgH29UcfwEflQBQl8P3L8v5gY9PkOKoS2txaSNG5wRXU6rHLHzGD+IrEe4R2ZJ0oAoi7uI+Af0p41G5fjedvepvLT+B/wA6cIc/ekQCgCH95J1cn8a09OtUDb3/AFqvH5UZ6q1XrMG4kTj5c9qAOn0G33vvA+XNeiabB5cPWuZ8PwfIAox6mur+0Rhtg6AdaAHXkgjh5Nea+OrzZpV6d/34xGPq5x/LP5V1ut3/AMrAEYz615X491DzPItA/wD03f8AEYQflz+NAEHwx8Ky+MfGdho0W7yXffclf4IB985/T8a+8LW3itLWG2tY1hggjEUcaDARAMAflXkf7N3gpfD3g1dZuosalrKJLyP9XB1Qe2ev4ivYKAFzRSUUALmikooAXNFJRQAtFJRQAtFJRQAtOptFADqVaSigBaKSloAWikooAWikooAWikooAWvlz9prRftGvPcwj9/HGHz6p3H6Zr6iY14n8fICmpWFwP44yufcGgDwHwFqmVfT5jhs+dCfw+dP5H869P029GEAPt1rxXXrGTSb/wC02eUhL74yP+Wb+ldn4Y8Ri7jQuEjlHEkfQZ9v8KAPVoZvMirA1uAXD7PKxkcv6GorfW0jXMxMadN78D8+lW5bv7QMoQc9Mc0AeY+IdIeGZnH51zrCccb2r1HWYQ+8PjPpXH3lhlmwPyoA5lxIe9CQF/atdrFx96n7IoWPnOiY/vnFADNMsURgXPzV0L4jspgB8wSsEanaRf6gvcN/diTI/Oq2q6lc+Ti7/cQf88A+ZH+p7UAU9XnSKz2Rn5nGwfTuf6U/wpocuqX6QICWJGT6VmwpLe3nmcFzwiAdPSvor4SeEk02wEt0gaaQB8kdKAK+lfD9IbdRInzVleJfAyfZ2MIxjtXvVtB5lvCBHswNpwOtZ+s6ahglJGOO9AHxdrOnyWVxLFIh3IcitXQL8SNDKxH7vCSE/kCfr/OvSPiF4RNwjSwAGUc8V45NHLYXbcc/xjHH0oA9FuPLIx1auev7FOXUVm6fqRIPkXIjX/nnLkgfjWokl3Ip/wBD873glD/pQBkNBim+Sf71a7W9yRk6dqCL6m2fH51H9kn/AOfS7/8AAd/8KAKcUPzV0Gk24DIZO3pVW2069LDGnXx/7d3/AMK1rG0vxIqCycN6PIgP5ZzQB1dnMiRYQEVaa7SOHp83cnpTNJ8JeJNQcR29i6Z6Yjd/6CrGs6FZeHIc+JtYsoZf+eEs4d/p5MeT+v4UAcZrmprFHJc3G77MnQH/AJaP2QetYPw50U+NPH9rHe5ktml865JHyv8A7P07fSqfiR5/EOs74JnNmDthMkflgD/YTtXoHw81HT/Bs0V5c/6iP5c46k9TQB9WRgIiiMAIBwB2qTdWF4a8QWev2EVxZSh0cdRWzmgCTdRuptNoAk3Ubqjp1ADt1G6m0UAGaM0UUAO3UU2igCWlpKKAFopKKAH0U2nUAFFFNoAdRTaKAHUU2igB1eafHSxM/h23uUTPkS8n0B4r0msPxtYf2p4X1K07vEWH1HNAHyNqccbxyxTAOD8pHrXMQWH2W+Eto4TYd3luMoa6rU1+fp82Oaw548rmgDvNH8TaVIqDVfCTZAwZ9LvcOP8AgD4/nV8z+BJmbenijTnPUzWKSZ/GMufzrzO1m2PnPNb1tqwjTB6UAdX5Pw6cbT441G0buk+nXGR+opraX8NXGR8SHP1sZR/7PXIvqW+TP8NUrm+37hnFAHZfYfhZC7fafGOoXvtBp9wc/jvxVWS++FlhJi00zxDqB/v/AGOJE/NzmuHnuz0yeKz55yRyTQB1mt+MNMKNFo3h57VfuiW7vS5/74QAfhzXDCF7idc4Lk9AMD8qVyXcAVv+FdKnuL+JxHlA4zQB6d8LPh4ZEF/fAbeCExXt2l2Pluf3eB2qv4KEUmmw+X2AXFdZ5HyDCd6AKyDCADtWbrCSOjRo+K2Vhy3pUN5b7kzQBwF7pfD7+fevJ/iD4ODq93AmGHave7tBAuD93HUV5X44v97/AGeD757igD55ubLy5ShHI9KfGkiMDHcH6OAa19btZYLtvOHU5qgiZ6UAaGmaze2DcQWTj3hx+orpLb4hXMK4OhaVJ7uZK5BYyacsB3ZoA7lfiVqG3/R9C8Own1ez8z+dTP8AE7xfMmINQtbFO32OyjT+ea4FY8NU+cLQBt6x4j1nVEaPVdc1e7ibrE906Rn/AIAmB+lc4gijkIggSPPoKdNN8tNtxl6ANiz4beecDvVbxfP5en2lsD8znefertmmYx/tkLXNeKrrztTMYPyxDYKAO9+A/jGXRtfi06aQ/ZLj5UyeENfXcMwmiEifdIr897C4e1vIJ4eHjfcK+4PhxrKax4Ys7hDnMYzz7UAdXSrTM07NAC5pc02igBc05aZRQA6ikooAWikooAnpaSigBaKSigBaWkooAWikooAWikooAWkoprEBWJOFFACucLk8LXk3xe+J9t4dtHtLFxJfPnCA8fjVb4tfFO20KF7DTn8y9cFeP4PrXy5ql/cajeTXd3IZppDuJNAHYTXaXyrP087mqDEbmQj8aztHuv3DRZ+5yKusd4BH3qAKksflzU7zMLzVmaEvDn+Ks98o5BHSgCx5wK8VGeaiXLU5z7UARSCqUwycVcbL0+G3L80AGg6a+o6lDbRjlzivpXwl4QtLOxRPLQvs5OOteI+A5E0/xFbyTABD8uTX0Tp+sRfZk+cZA7UAaHhXFkksWFABrs7edH3IMcV59b3UX2yXB610GnXe/aTwz9aAN9SBuqrczR+W+X6dsdKqy3vr+dZOq337nGQDQBjeJ9SItpNh+btXE6HoEl2zXN0+935GeQKt+IL4STiLPU11Xh/y7exQHHTbQB5T8VPD4t9K+0bBvR+wryuKHFe9/FC7in0q5iBG49K8law+QYTNAGRFHV1IPl6VYWyMfUVMiY7UAZ7QAVTuIQK2pkrOuFyWoAynQU+EYp8gxT4UzQBqmQW9m0n9xN1cFcyGaYuTlj8xNdH4lutkAgHDv8ziuXzQAq9a+hv2dfF0cMP9j3EmCn+rB7ivnla1tDv59Nvobu1OySF9wIoA++UcFeDxT9wrhfhj4qi8R6DDKHHmBArj3rtVNAEu6lzUOaduoAkoWk3UUAPopi0tADqKbRQBY3Uu6mUUAP3UbqZRQA/dRuplFAD91G6mUjHFAEm6jdXO694t0jQ4Xe+vIY9nYkV494p+O8UfmxaPAZGHAdxgUAe+y3UEK5mkAFeZ/Fj4jWehaNLHY3Ecl5JlUCHmvnbxD8R/EesyETXpgj9IuK5S7uJJ33zSPI/qTmgBdQvZ765luLqQvNIdxNU6GooAfbSGGYPmuhs5A+0etcwxrQsLojCE9KAOoj/iFV7m3zk4+Wi2nEm0itYRpJEMUAYBj2dqEgeRuBxWw9kd2fWrthYb2oAyrPS3k6JW7Bony9vyrdsLSOOLPGa0okQOEI6+lAHG3+j+XFlByPm4rCm8VazpbeUkvmIO5r1eayR8919K8+8T6MMuUQ7aAH6F8Rp/tCC7yj569jXrWheNbe4t1zKNxFfNc9i8ZPycVLaX1xaMuHcYoA+ov+EkikTiUbs9jWPrPiKIIweUb0968Ci8T3MbYMriql9rdzdZHmnHvQB3Wr+MYo74nILA8c1Yl+JqCJUhBGBgV5PsLtknNSx2/wA1AHeLrk+vXKIfmTvzXdWWjo8aE9xXCeCbHDLJXrFmdkKigDmb/SQM4rDubApzg16Jc7ChzXOaoiLudOcUAcbcQY67/wAqybnKtxitvUr3zHaONN/rWTOMDkfNQBly0+2YDl/uio5j87VT1C4MNrsU4d6AMvVLg3F275z2qnTc/NS0AOWrNuaqrU0dAHf/AAp8YS+GNbRJnP2OY/P6A+tfW+kalBqNmk8EgfeOxr4NP3s17D8GviH/AGPIunalP/o5P7t3PT2oA+oAflpc1R02/t7+BJYJAc88GrmaAJM0ZpmaXNAEgNP3VBTqAJaKiyaKALlFNplxMkEZkkOFFADnYAZJwtZmpeI9L01f9LvIY8f33FeHfFL4uTpcS6foRQFDteXsPpXh2o6jeajM0t7cyTOTn5zxQB9ht8SvDQdR/adru/3xVlPH3hx1z/alt/38FfFmfx+tIxoA+tde+L/h7Td4hnSdwOBHzXlPij436nfB4tKiECdnfrXjjZLZzSNn1oAv6trF5qszT39w80h9TxWUz5NDvTF60ASLSPT16Ux6AGNSUrUlAEbUmdjKRT2pjUAbFhdfLXRafe4IGeK4a3mMb/7NbFrdFCvNAHfW480KauRHyaw9I1HhMmtS8mBhZwRQBpRXWccVqQTBEzkDHU+tcB/baWr4OC1UbzxO4YGMZ9qAPZbS5R0XH51T1fS0uELjliK820fx2IFAuo66yz8c6XJtDyYz70AYmoaPtm6HiuX1Ow8voK9Mm1zRp0yJEJ+tcxqotrqZ/s7grQB59JD8/IpRBmuhvtOw/UGmQWXzdqAMqG0J7VqWFjvK5B4rVttOQ1eSAQnINAGv4bsgijsa6iWcImzOG+tcX/bEdpHgPz7VQm8SION4fPXJoA6+51TyfkL9PWs578SZwSVNchfawk6cOxeoLa9kJxnK0Ab1ybaMuUxk9ccVzuozjBAPWpby4QJnI3VhXNxncTwtAEqnecntWNrEnmTYq6HPksR8tY1w5eXJoAiWpVpjClSgB609KYtOU0ATbvloQ7DkU1aKAPUPhp8Q7vQruK3u5C9nnbn+5X0/oerW+q2ST27h946g18Koa9A8A/EW/wDDKeRzNbdh3FAH15mnV4xoXxp0+4kEd6jwtnqa9H0fxTpeqIpt7mMsfQ0AdDS1CkiOuQafkfLzQA+ikooAtMRtryn46+MDomkfZLKTFzP8gx2rP8VfGiwtUaLS0M8hHXHFeD+KvEF74j1Nrm+PI+4PSgDCuS5Zic881ElSyrgVEpoAVjSrUbU5TQA6o3qT+Go3oAhahaR/vU9KAJP4ajY1I33ajxQAykanNSNQA2o3qTbUb0AQtVi0nxw9QsKib1oA6G1vTC/WtyDUTMmCa4+0k85efv8ArWpYv+8UUAdBBpYumbYOp3V0mkeDoPvzplaqeHp0ES8rmu5sLhJIlwetAHIax4Ut3hZEiA+lchd+EbiGbZCcIehNexzlCmCFrFuEynI57e1AHkE2l38CuPIc4JyRUdte3Fk/BdFPYivUpdRNv+4kjQ27ndyPzqHUoLDVAqFEjL+g6e1AHn1zrMp4Qjd3NU/7Suc5EuK6ibwtbh3Pmps+8M56Zp0ugaZDChAPzgnl+3Y0Ac2mu3cf/LQmkfX71+P61q32lWUcyJaSedxuOOmcU1NLTqcD0oAwmuryc4yQPvYoEM45JPNdImnoORirBtERMkUAczDHJ3zVxp/s6YqzfEIPkrFdjIaAHvIXbJPFUnkM9xj+AUXkw+WNOKlsY/n57UAWZ28uzNYqnNXtQnz8maorQA6lWkpaAFWnLTVp60AOWl20i09TQALmpFpgNSUAOzVuw1S7sJFktJ3jYHsapUygDv8ATPij4hsXQGcTIOoevWPBnxhsr2IJqn7ib3PFfNK1IDQB9lx/EHQmQH7XH/33RXx2pOOrUUAWFmpjSUxqWgCOVyRUaGny/dqEfeoAkagGndqY1AEq016EOaHoArtT0pGpwcCgBWptLvB70gNACUxqmWmYoAibpTGFTNSMKAKzCoXqw4qJhQA23OyVTW7YPvlXNYJB/hrSspMqCO1AHYWheBkdOlb+n6oYZeny1zujSC6hxmtVISnXt6UAdVFqXmRckbaoXWo+WrdxWVsk2ZQnFVLvzHHJ7UAPv9cj6GMFD1FZS67bxthN6getVby3L9DWVNZOOxoA6GTX0kTHmED0qq19FI3zuNtYjW596VIDQBtC4iB+RyfpU0Vx5n3ulY8UOOpq6jkcCgDXSZETj71V7ifINQRZKntVa5cigCpeOXJAO2su5n2JsBy/ep76fZ35rLUPJN60APgTezPWxbAeVkdPWsyZxDDgfeNWrFylid9AGbc8zPTFoblyaXbQAtKtFOoARaetC06gBV+7TlFNBpw57UAKBTlFOUH0pcH0oASmNU+z2qJhigBFqZEpEFPHFAElFRbqKAJm60p+7StSUARS1Fip2qBqAH/w0jUqUMKAEQ0rfdpqnDVJu+WgCvMDhsdapOZE4NaR5pjID2oAy/Nenec696vG3R/aomtB2NAEC3Mg71bgmMg5qs1qRV6GPZEvHzUADLimtUvWmMKAK7io2qywqFxQBCwp9rJ5cvPQ/LSYpp4oA07C9ksr3Ac+Ua72xuop7dSHy1eZQzhTz1rVsdSeyI5/dUAenWbxllBHy1pf2XHP9xBiuDsNZT5Tniut0vxFE5VHI6daAJp9AH+RVObw6D0Stn+0o/MR0k+WnPqSHjeKAOSm8NnqEqhNpUcP3uDXU3WpfNjPFZczic5NAGG1vHu4GanjsCRkptq+ogjPLiqV/q0UabEOQKAK92UgXHFYN/dDDYov7/zHJzgViTTGR/8AZoAa5eaWpuIU44aktxhGJqOQ72oAid8vzzWjIfL07H8RqgEy659as3j5wn8IoAqKKdRS0AFKtLilxQAtOWilWgB4xuo3gUijmmzRkrxQBJ5/vTftH+1VPY/1oWM0AXPtW3vQkxkNV0tyetW44wBx1oAkAp1NyRRmgAopM0UAW6RqFoagBrVE1TMPlpjCgCJaetMp9AEZ+9T1pj0KaAJmplKDTmoAiajHy06nKM0ANQc09qeqUx/vYoAbTKfSUAMpjipmFNYUAVXFRsKtFM1E8dAFVhUwkfy2Q801wVqWHBRs9aAGQzmMd6vw35HR9rVRmjKckVHxQB0cOsXMarifj61J/ak//PR/zrmcZpOfU0AdL/aVxn/WGlbVJ8Y8yuX59adk0Abc1+/8U/P1qjNdg9OT6mqXO2igBXd3OSaWJC7e1NarNtCX+hoAaxyNg7UJHW7oGgXGt3zWdkR5vll+R6VQa3eC4eB/voSp/CgDPf5HqJjk1NeDEuKhWgAUUq05RS4oARRT6UCnbaAGU9RTwPlzRigAWnUUtADWSmbKsIM/dpuKAGgUqriiloAcvSmMaGqJ3oATdRUfNFAGnmjNI1Mz81AEmeKY1CmnNQBE1Oz8tNahaAGyfdpiGpW6VD0oAmWlpqnNLigAqWIfNzUS/eqduEoAG4pmMijmnLQBFTlo2/NQooAXbSNSrmk4/ioAFQU10FPGfwpWoApSCqrEoeDVu54qlJQBfimDphxUU1sOopbNA/FWWhdN392gDLZSKWrcsearFCKAG0U/FGPmoAMUAU9UqdISaAINnFW9II3sj9huzVmCyz1p135UI2Q7XlPHB6UAbvhvxENG+0yWUbvdzRmME9ErKOdjzzffOWJ9TTrK1+XAHzVHrx8mNIB1I5oAwnO+Vj705EoRKmUUANVKNlSYoxQBGBTgPmWn4pMfNQBI444piipk+Zcd6YUw1ADaSlaigBM/LUo5XP8ADUS09Ad1AClM01uKmqvIfmoARjVeU809zxUSDe3NAD1HFFTqvFFAE7Goj96n7aY4NACofepV6VVXrU6GgAemVK44qKgB1RPUvWmPwKAGpUq1EtPoAR32Va35C1UmTfERVWCZ4X2OePWgDVcb+R970pg+9inI+RkU5/u8Dn1oAaRikpPrTk70AGOKb1WpQvyYpjYB46UAJRS59KTnvQBXuY81QfmtVgKpvB+8wBx2oAsaZHnbWxLBlKdoFgX2nZwK2Luy2buKAOUmhxVZ466C4tQegqi9vsG9+FFAGOYD2qRLf2q2JsygQQfKflyaMXBmMZG2gBiwAffIAphvYoP9WN7epoudOk85cng9AauWejI/36AMqW7nnygcgHsK0NE06R3UkbfwrprDRIBtxGPrXQ2GlAdqAMmzsDCm9+tcXrUnn6k/PQ7RXperJ9nspnHYV5Wf3kzOfU0AKBTsUYp+2gBMcU3FO/ipdtADMUAVJj5aTbQAi0779GPWkWgCNjzilqYJHI68UsoG/CUAQLUqrsGaav8AEfSnP92gBrviqTSZmouZuWQVDCh25NAEz9aWEe1Iv3qnQUAPAopeaKAJG4NNY8UP1pM0AQt1p8RyabJ60kZwaALTHIqNqfuPrTHoAFNI3NItDUANpelJQxoAXrUVxHvWpM0q4oAgs5vLk2Oa0lOeR92sy7jy2QKLK42fI54oA0ZU/jGSaYpqeJ8Lwfm9aZMmAHz1NACZpKatOoAVaGpKVB81ACU+FwkiGQZXPNNPX0oagD1LQrK3fT4pbcAxv83Sn3lhlW4rlPAuuGwu1trhybSY7f8AcNepfZxIvA60AedXNlsfBH6VWvNKzsDg7QOleg3mj+ZggfNms68sJHmY4+X7tAHBXenbI/3Yww6cUouIPlN1bnzum8DrXXzaW78BCeeakGgDYuQfpQByItTO+/yiM9BWrZ6cfl+SuigsAkoQjH4Vu2Gjh/SgDB03S3cqNn6VtyWqW8S5HzV0NvZJbwsSOgrlde1SJHb5xx05oA5jxlME0u4x97G2vLoq67xXfPPav05NcpEKAHqKdSdKdQAYG2msKdRigBKSk70d6ADbS0dKRaADbR9Ad1OowerjtQApwO23jmqNzNsT1qa5kCLms7mR8mgBYwXbJqc8CnImKHNADU61YWoYxU60AFFP20UAfQP/AAy94g/6GHTP/Ad/8aX/AIZe8QHr4j0v/wABn/xr6zooA+Sj+y5rxXH/AAkWmf8AgO/+NNX9lnXh/wAzJpv/AIDv/jX1vRQB8lj9l7xBn/kYdM/8B3/xoP7L3iD/AKGHTP8AwHf/ABr60ooA+Sv+GXvEH/Qw6Z/4Dv8A40v/AAy7r/8A0Mem/wDgO/8AjX1pRQB8kH9lvX/+hk03/wAB3/xo/wCGXNf/AOhk03/wHf8Axr62ooA+Sf8AhlrXv+hi0z/wHf8AxoH7Lev/APQx6b/4Dv8A419bUUAfJJ/Zb1//AKGHTP8AwHf/ABqE/sq64xz/AMJFpv4QP/jX15RQB8mRfsweIY1x/wAJHpm33t3/AMaf/wAMxeIe/iHSv/AZ/wDGvrCigD5M/wCGYPEGf+Rj0v8A8B3/AMaX/hl/xB/0MWl/+A8n+NfWVFAHyZ/wy/4g/wChj0v/AL8yf405f2YfEI/5mPS//Ad/8a+saKAPk4/sxeIT18Q6X/4DP/jS/wDDMPiH/oYtL/8AAZ/8a7zWvHXiTSf2ldN8My30beHtRgUpaNEnyExv8wfG7O9O56Hp0r3SgD5O/wCGYfEPbxHpv/gO/wDjXoHhz4Qa5YWCQX+r2VzKny+YkbjIr3GigDyX/hV9/j/j9tP++DUI+E953vbX/vg17BRQB4+fhPeH/l9tf++DT/8AhVN52vLX/vg167RQB47L8Jrx/wDl8tf++DUtv8LtRh/5iFr/AN8GvXaKAPJtV+Guq3Fg8NrqFpHM4++UNebzfs6+Jp5N8/iTTGyc/wCokH9a+oaKAPlzUv2btcuI0jj13TUUdSYZD/Ws8fsweIO3iHTP/Ad/8a+s6KAPk7/hmHxB/wBDFpf/AIDv/jR/wzD4h7eIdL/8B3/xr6xooA+Tv+GYvEP/AEMOl/8AgO/+NH/DMPiH/oY9L/8AAZ/8a+saKAPkz/hmDxB/0Mml/wDgO/8AjQP2YPEH/Qx6Wf8At3f/ABr6zooA+TD+zB4g7+I9L/8AAd/8aB+zB4g/6GHS/wDwHf8Axr6zooA+Tv8AhmDxB/0MWm/+A7/40H9mHxBtx/wkemf+A7/419Y0UAfI8n7K+vSfe8Sad/4Dv/jSJ+ytrqf8zDpv427/AONfXNLQB8kf8Mt69/0MWm/9+H/xpP8AhlnXv+hj03/vxJ/jX1xRQB8kL+y1rw/5mPTf/Ad/8aeP2Xde/wChk03/AMB3/wAa+tKKAPkv/hl/xB/0Mem/+A7/AONFfWlFABRRRQAUUUUAFFFFABRRRQAlFFFABRRRQAUUUUAFFFFABRRXPX/iey0/xNYaJfFobjUI3e0kb/VzMp5jB/v45x3oA6GihaKAPlTxPI2q/toaVayZZbMwhcN/ctzN/MnivqrNfLeqwsn7aUaOxjF3DhZAeUzYldw9Dla9o8P/ABD0qfWp/D+t3UOm+I7R/LltbhvLEvo8ZPDBhhgOvNAHe0U0NnpTqACiiigAooooAKKTNc34j8beG/DSSHXNc06zkQZMMk6+Z+Cfe/SgDpTwKxvEPiTRvDdslzr+pWmnwyMFR7iUJuJ7D1r5d+JX7TWpXktxY+B7ZLK0yUF/Ou6Zx6onRPxyfpXgOq67qGt6r/aGvXc+pTEjcZpDkj0B7fhQB+msEqTwpLC6vGwyrDoRUlcZ8MvGOheLvDVrP4euIykMKJLbbv3lucD5GH9a7OgAooooAKKKKACiiigAooooAKKKKAClpKWgAooooAKKKKACiiigAooooAKKKKACiiigAooooASiiigAooooAKKKKACiiigArxr9p61dvBmi3VoyxX9rrds1vNjJjZiw/wDifyr2WvHf2nr2Cw8A6ZNcgCFdatCxxnaAWcn8lNAHrEEoGyGSVDcbASuRk+pxVpa+UPAV7qnxS/aKPjDRIZLTw/pf7s3DLgtEEYBD6s5YnHYH2FfS/iTxBpfhrS5NR1u9gs7OP+OV8ZPoPU+1AHzZq2X/AG142L4jgVZHY9I0Fjk59v8AGs/4pyv8dPiZY6J4JtreWy0xMXGrlOCpbk7+6D+EdzmuA8UXt38W/jReyeEYbuAauY4NrnaRCqIjtJg/d+TcRX2Z8OPBOleA/DkOk6PHhR881w4+e4k7u/8Ah2oA0vBugW3hbwzp+iWTySQWUQhV5PvPjua3KKKACiig/doAGrifHvxM8L+BrctrmpotyV3JaRfPO3/AO344rlvjx8VbP4f6LJZ2TpN4juo8W0QbPkD/AJ6SegHYdz+decfs/wDwWvW1O78S/EXT2klJ3W9rdne8khIczPz/AD67jmgDVi17x98XJCbS7PgTwjK4SC6k/wCPi9J6BDlc5HPyYHu1bem/sz+DIJkm1G51fUpid8hnuAFkPf7gDfrU37WvhubWvhil7axF5dKuVnKqu8mMgo/5ZB/CvOf2Z/jBJp//ABS/ii5H9mQW8k1reSucwLGMmM5/g2qcemMd+AD6J1jwJ4Uv9Eh07UtD059PtI9kStEB5SAdj2r4a+Kg8It4q/s/4e6fLHZW7tCblrh5jdvn+BT0HYetewa1418T/HbxJd+FPBjf2Z4ZUFrm5kBBkizjMmPU9EHXv3r3X4e/DDwz4Fs4l0mwje9EYSW+lXM0nqc9gfQUAeffsq/Dq88K6Nfa3rkM1rql+3lLbTDDRxKeCR6k5/IV79QtFABRRRQAUUUUAFFFFABRRRQAUUUUAFLSUtABRRRQAUUUUAFFFFABRRRQAUUUUAFFFFABRRRQAlFFFABRRRQAUUUUADNiq0N5bTTywRXEUk0X341cFl+o7VOy5r56+NvwW1HVNdn8U+Abo2urzjN3apMYvOPTehHRvUHg/XqAdv8AFD4x+GvAcUsE1wL/AFgfcsLc5YH/AGz0QfrXzT481bxN4ybw94m+Icc1t4Wvb0x2en2oIcx4yXRO+eBuPJ7V23wW/Z+updRXWviJbgRxyNt0yUbzM/8AfkOenfHet74jeI9I8W/H3wV4Pt4457fSLwvdNj5PMCbvLH02DPvx2oA9L+G/g2Xw78N7jTbbbpupagJbk/Z+VtJJB8iJ67BsGe5UmvkvxN4W+JnijxomkeIbbWb+/WbyVmuFdrdAf41IGxUxzx/Ovvjb69KxPEfibSfDkULaxeJC8hxFEoMk0p9EjUF3P0FAHzT8NvCX/Ctf2j9D8P2121891pbG6lZQgDFHc7B6ZjXrzzX1pXzj4Q1Sw1z9qfXtUE4WC30uOK3W7jaB9xSPPyuAwP3+3evowNkAjvQA6iiigAqnqVmt/YXFnI8saTxtGzxOUcAjGQR0NWs89qXnbQB86fD79nKLw/49Or6xqkGp6bav5tpEYyJGk3cGTt8vt1Ppivorp9a5/wAR+M/DnhpA2u61Y2WW2BZJRuz9OteJfED9pfTbdm0/wLZS6pesdiXcyEQ7u21Pvv8Ap+NAHvHiTUtN03Q7y61ueKDTVjPnPKcDaRXy54W+EujfEbxfHqeiaLdaJ4FtxxLNKfN1Ij+4h+4vv6fXjoNA8FeNvir4t/tD4qRXWn+HbQJNbaYrYjlZugwD6dWPPOPXH0nb20NrBHDbxrHDGoRI0GAoHQAUAUdA0PTfD+nJYaLZW9naRjAjgQL+fqfc1q0UUAFFFFABRRRQAUUUUAFFFFABRRRQAUUUUAFLSUtABRRRQAUUUUAFFFFABRRRQAUUUUAFFFFABRRRQAlFFFABRRRQAUUUUAFFFVb+OWWznjtpTDM8ZVJAM7Djg4oA8h/aE+LEPgPRzpelMH8Q3sZ8vB/49k6eYf6Cvnj9mywubn42eHLu5R5d4ubouzbif3Ui7z/wPjPrVXXPh18R/EfxCmsdbsL+71Sabymvp0/clBxv39NmOeP519MfCz4f3Wh/ELXtau9MjsLGC2j0nR4hKHP2ZAMyHDH75UH5uetAHZ/FHxfD4G8D6lrssP2hrcBYoQ2PMkZgFH05yfYGvAf2b9d1nxv8T9R1nU7tf9Ftd9xmNHecvkBVcrujjHXYhA4Gc859++Jfgmx8f+GX0XU5riCAypMHgI3hl6dfqah8JeDtH8FyWVj4esxa23kyIxBy8pyp3O3Vj/npQB5D8NdCi1/9ov4ianqdpbXltaObcLNGHGTgDAPHRK9E8W+DNYsLW41H4X3/APY2pHY508hGs7nb22MCIzjumM/rWN+zjpRgg8Z6y0iOdS1y4Cgdkjcjn8zXs9AHytZ/tC+LfCmrnSviP4bUSo+x5IF8twB1KjlX+oOK+gfBXjjw/wCM7GO68P6nBcblyYdwEsfs6dRS+PPBuj+N9Cl0vXLcSRH5o5V4kifsyH1r5y0b9nTxf4e8cWWoaLrlillbXCSJd7nWbYGBwY8bT6Y3YNAHrPxh8NfELVdStLz4feJvsCeWIZ7N32Jncf3gO0/3ufoK8s1f4U/G7W1A1HxjC6MclP7SlRB+CJivq5aKAPlzRv2W/Pjnl8TeJpZL2Qqytax5x1zuL8nt6dK9c+FPwo0H4dW9ydOMt5dXJHmXVztL7R0AxwB3r0eigBuBTqKKACiiigAooooAKKKKACiiigAooooAKKKKACiiigApaSloAKKKKACiiigAooooAKKKKACiiigAooooAKKKKAEooooAKKKKACiiigAooooATHvS0UUAFY/iSb7Hpp1AAs1kwuCFGSUHEmB3OwvgeuK2KawzwelAHjf7M88b6J4tghnjuIU8QXDxyRvlWR1QgivZq5rwn4O0bwpLqkmhWxtl1O4+0zqD8m/H8I7D2966WgAooooAKKKKACiiigAooooAKKKKACiiigAooooAKKKKACiiigAooooAKKKKAClpKWgAooooAKKKKACiiigD/9k=";

// ============================================================
// Welcome Splash + Guide Modal
// ============================================================
const GUIDE_SECTIONS = [
  { icon: "⌕", title: "全局搜索", desc: "頂部搜索框可按歌名、歌手、作曲人搜索，支持簡體輸入匹配繁體數據" },
  { icon: "🎤", title: "按歌手", desc: "左側選擇歌手，右側顯示該歌手所有粵語作品及作曲 credits" },
  { icon: "🎹", title: "按作曲", desc: "選擇作曲人，查看其與林夕合作的全部歌曲" },
  { icon: "📅", title: "按年份", desc: "按年份瀏覽，查看林夕每年的創作產量和合作對象" },
  { icon: "🔀", title: "交叉查詢", desc: "同時選擇歌手和作曲人，查看特定搭檔的合作歌曲。常見人名可直接點選，其他可搜索" },
  { icon: "📊", title: "統計", desc: "歌手 / 作曲人排行、年度產量圖表、外國作曲來源分佈" },
  { icon: "🔗", title: "交叉導航", desc: "歌曲列表中的歌手名、作曲人名、年份均可點擊，跳轉查看該人或該年的全部作品，面包屑路徑可隨時回退" },
];

function GuideModal({ onClose }) {
  return (
    <div style={{
      position: "fixed", inset: 0, zIndex: 1000,
      background: "rgba(74,70,64,0.5)", backdropFilter: "blur(4px)",
      display: "flex", alignItems: "center", justifyContent: "center",
      padding: 20,
    }} onClick={onClose}>
      <div style={{
        background: C.bg, borderRadius: 16, maxWidth: 480, width: "100%",
        maxHeight: "85vh", overflowY: "auto",
        boxShadow: "0 20px 60px rgba(74,70,64,0.3)",
        padding: 0,
      }} onClick={e => e.stopPropagation()}>
        {/* Splash image */}
        <div style={{
          width: "100%", borderRadius: "16px 16px 0 0", overflow: "hidden",
          background: "#e8e2d8",
        }}>
          <img src={SPLASH_IMG} alt="林夕" style={{
            width: "100%", display: "block",
            objectFit: "cover", maxHeight: 320,
          }} />
        </div>

        {/* Title */}
        <div style={{ padding: "20px 24px 8px" }}>
          <h2 style={{ fontSize: 20, fontWeight: 700, color: C.text, margin: 0 }}>
            林夕粵語填詞作品
          </h2>
          <div style={{ fontSize: 13, color: C.textMid, marginTop: 4 }}>
            2764 首 · 1985–2026 · Credits 查詢
          </div>
        </div>

        {/* Guide items */}
        <div style={{ padding: "8px 24px 16px" }}>
          {GUIDE_SECTIONS.map((s, i) => (
            <div key={i} style={{
              display: "flex", gap: 12, alignItems: "flex-start",
              padding: "10px 0",
              borderBottom: i < GUIDE_SECTIONS.length - 1 ? `1px solid ${C.border}` : "none",
            }}>
              <span style={{ fontSize: 18, flexShrink: 0, width: 28, textAlign: "center" }}>{s.icon}</span>
              <div>
                <div style={{ fontSize: 14, fontWeight: 600, color: C.text, marginBottom: 2 }}>{s.title}</div>
                <div style={{ fontSize: 12, color: C.textMid, lineHeight: 1.5 }}>{s.desc}</div>
              </div>
            </div>
          ))}
        </div>

        {/* Close button */}
        <div style={{ padding: "8px 24px 20px", textAlign: "center" }}>
          <button onClick={onClose} style={{
            padding: "10px 40px", borderRadius: 20, border: "none",
            background: C.accent, color: C.white, fontSize: 14,
            fontWeight: 600, cursor: "pointer", fontFamily: "inherit",
          }}>開始使用</button>
        </div>
      </div>
    </div>
  );
}

// ============================================================
// App
// ============================================================
const GUIDE_SEEN_KEY = "linxi-guide-seen";

export default function App() {
  const [tab, setTab] = useState("singer");
  const data = useMemo(() => DATA, []);
  const index = useMemo(() => buildIndex(data), [data]);

  // Guide modal: show on first visit, remember dismissal
  const [showGuide, setShowGuide] = useState(() => {
    try { return !localStorage.getItem(GUIDE_SEEN_KEY); } catch(e) { return true; }
  });

  const closeGuide = useCallback(() => {
    setShowGuide(false);
    try { localStorage.setItem(GUIDE_SEEN_KEY, "1"); } catch(e) {}
  }, []);

  const openGuide = useCallback(() => setShowGuide(true), []);

  if (data.length === 0) return <div style={{ padding: 40, textAlign: "center", color: C.textMid }}>載入中…</div>;

  return (
    <div style={{
      maxWidth: 960, margin: "0 auto", padding: "24px 20px",
      fontFamily: "'Noto Sans SC', 'PingFang SC', 'Hiragino Sans GB', -apple-system, sans-serif",
      color: C.text, background: C.bg, minHeight: "100vh",
    }}>
      {/* Header with guide button */}
      <div style={{ marginBottom: 20, display: "flex", justifyContent: "space-between", alignItems: "flex-start" }}>
        <div>
          <h1 style={{ fontSize: 22, fontWeight: 700, color: C.text, margin: 0, letterSpacing: 1 }}>林夕粵語填詞作品</h1>
          <div style={{ fontSize: 12, color: C.textLight, marginTop: 4 }}>{data.length} 首 · 1985–2026 · Credits 查詢</div>
        </div>
        <button onClick={openGuide} title="使用指南" style={{
          background: "none", border: `1px solid ${C.border}`, borderRadius: 8,
          padding: "6px 10px", cursor: "pointer", color: C.textMid, fontSize: 13,
          fontFamily: "inherit", display: "flex", alignItems: "center", gap: 4,
          transition: "all .15s",
        }}
          onMouseEnter={e => { e.currentTarget.style.borderColor = C.accent; e.currentTarget.style.color = C.text; }}
          onMouseLeave={e => { e.currentTarget.style.borderColor = C.border; e.currentTarget.style.color = C.textMid; }}
        >
          <span style={{ fontSize: 15 }}>?</span>
          <span>指南</span>
        </button>
      </div>

      <GlobalSearch data={data} />

      <div style={{ display: "flex", gap: 0, borderBottom: `2px solid ${C.border}`, marginBottom: 20, overflowX: "auto" }}>
        {TABS.map(t => (
          <button key={t.id} onClick={() => setTab(t.id)}
            style={{
              padding: "10px 18px", background: "none", border: "none",
              borderBottom: tab === t.id ? `2px solid ${C.accent}` : "2px solid transparent",
              marginBottom: -2, color: tab === t.id ? C.text : C.textLight,
              fontWeight: tab === t.id ? 600 : 400, fontSize: 14,
              cursor: "pointer", fontFamily: "inherit", transition: "all .15s", whiteSpace: "nowrap",
            }}>{t.label}</button>
        ))}
      </div>

      {tab === "singer" && <TabSinger data={data} index={index} />}
      {tab === "composer" && <TabComposer data={data} index={index} />}
      {tab === "year" && <TabYear data={data} index={index} />}
      {tab === "cross" && <TabCross data={data} index={index} />}
      {tab === "stats" && <TabStats data={data} index={index} />}

      {/* Guide modal */}
      {showGuide && <GuideModal onClose={closeGuide} />}
    </div>
  );
}
